[{"title": "\"", "rating": "PG", "description": "This dynamic documentary weaves together stories about students, educators and reformers to shed light on America's failing public school system.\n"}, {"title": "10,000 B.C.\"", "rating": "PG-13", "description": "Fierce mammoth hunter D'Leh sets out on an impossible journey to rescue the woman he loves from a vicious warlord and save the people of his village.\n"}, {"title": "13 Sins", "rating": "R", "description": "A man agrees to appear on a game show with a $6 million prize. But as the challenges become more extreme, he realizes he's made a grave mistake.\n"}, {"title": "14 Blades", "rating": "R", "description": "In the age of the Ming Dynasty, Quinglong is the best of the Jinyiwei, an elite assassin squad made up of highly trained former street urchins. When evil eunuch Jia unseats the emperor, Quinglong is called to action but is quickly betrayed.\n"}, {"title": "16 Blocks", "rating": "PG-13", "description": "Tasked with escorting a prosecution witness to court, an aging cop gears up for the 16-block trek – but they'll be lucky to make it there alive.\n"}, {"title": "17 Again", "rating": "PG-13", "description": " – and that's exactly what he gets when he wakes up to find he's 17 again.\n"}, {"title": "187", "rating": "R", "description": "After one of his high school students attacks him, dedicated teacher Trevor Garfield grows weary of the gang warfare in the New York City school system and moves to California to teach there, thinking it must be a less hostile environment.\n"}, {"title": "1898: Our Last Men in the Philippines", "rating": "R", "description": "While Spain relinquishes its last colonies, a battle-fatigued outpost engages in a long, brutal and sometimes bizarre clash with Filipino insurgents.\n"}, {"title": "20 Feet From Stardom", "rating": "PG-13", "description": "Winner of the 2014 Academy Award for Best Documentary Feature, this film takes a look at the world of backup vocalists and the legends they support.\n"}, {"title": "20th Century Women", "rating": "R", "description": "In 1979, single bohemian mom Dorothea, hoping to help her teen son find his place as a man, asks two young women to share their lives with him.\n"}, {"title": "21", "rating": "PG-13", "description": "A brilliant group of students become card-counting experts with the intent of swindling millions out of Las Vegas casinos by playing blackjack.\n"}, {"title": "21 & Over", "rating": "R", "description": "Jeff's straight-and-narrow life changes abruptly when his buddies take him out for a birthday bash – the night before a crucial med school interview.\n"}, {"title": "22-Jul", "rating": "R", "description": "After devastating terror attacks in Norway, a young survivor, grieving families and the country rally for justice and healing. Based on a true story.\n"}, {"title": "23:59", "rating": "R", "description": "When an army recruit is found dead, his fellow soldiers are forced to confront a terrifying secret that's haunting their jungle island training camp.\n"}, {"title": "24 Hours to Live", "rating": "R", "description": "Revived by an experimental procedure, a hit man gets to live an extra 24 hours – which he uses to avenge his dead wife and child and redeem himself.\n"}, {"title": "28 Days", "rating": "PG-13", "description": "After her drunken antics result in property damage, an alcoholic journalist enters rehab – and soon meets a fellow resident who changes her outlook.\n"}, {"title": "3 Days to Kill", "rating": "PG-13", "description": "A terminally ill secret agent accepts a risky mission in exchange for an experimental drug that might save him – if he can survive its side effects.\n"}, {"title": "3 Generations", "rating": "PG-13", "description": "When teenage Ray begins transitioning from female to male, his single mom and grandmother must cope with the change while tracking down his father.\n"}, {"title": "3 Idiots", "rating": "PG-13", "description": "While attending one of India's premier colleges, three miserable engineering students and best friends struggle to beat the school's draconian system.\n"}, {"title": "30 Minutes or Less", "rating": "R", "description": "Two crooks planning a bank heist wind up abducting a pizza delivery driver and force him to commit the robbery — with a strict time limit.\n"}, {"title": "3022", "rating": "R", "description": "Stranded when the Earth is suddenly destroyed in a mysterious cataclysm, the astronauts aboard a marooned space station slowly lose their minds.\n"}, {"title": "5 Flights Up", "rating": "PG-13", "description": "A couple finds unexpected drama when, after 40 years of living in the same Brooklyn walk-up, they attempt to sell their apartment and buy a new one.\n"}, {"title": "5 to 7", "rating": "R", "description": "A young novelist's life is turned upside down when a chance encounter outside a New York hotel leads to an intense affair with a diplomat's wife.\n"}, {"title": "50 First Dates", "rating": "PG-13", "description": "After falling for a pretty art teacher who has no short-term memory, a marine veterinarian has to win her over again every single day.\n"}, {"title": "50/50", "rating": "R", "description": "An otherwise healthy twentysomething has a comically early midlife crisis when he gets slapped with a cancer diagnosis and a 50-50 chance of survival.\n"}, {"title": "6 Days", "rating": "R", "description": "When armed gunmen seize the Iranian Embassy in 1980, a tense six-day standoff ensues while elite British soldiers prepare for a dangerous raid.\n"}, {"title": "6 Underground", "rating": "R", "description": "After faking his death, a tech billionaire recruits a team of international operatives for a bold and bloody mission to take down a brutal dictator.\n"}, {"title": "68 Kill", "rating": "R", "description": "A hapless guy agrees to help his stunning – but psychotic – girlfriend rob her loathsome sugar daddy in a scheme as ill-conceived as it is violent.\n"}, {"title": "9", "rating": "PG-13", "description": "In a postapocalyptic world, rag-doll robots hide in fear from dangerous machines out to exterminate them, until a brave newcomer joins the group.\n"}, {"title": "A 2nd Chance", "rating": "PG", "description": "A gymnast lacks the confidence she needs to reach the top. But with the help of her new coach, she has the chance to win a spot on the national team.\n"}, {"title": "A Bad Moms Christmas", "rating": "R", "description": "Stressed-out moms Amy, Carla and Kiki are back, and the looming Christmas holiday gets even more daunting when their mothers show up for a visit.\n"}, {"title": "A Boy Called Po", "rating": "PG", "description": "After his wife's death, an overworked engineer struggles to care for his son with autism, who regresses into a fantasy world to escape real-life bullying.\n"}, {"title": "A Bridge Too Far", "rating": "PG", "description": "This wartime drama details a pivotal day in 1944 when an Allied task force tried to win World War II by seizing control of key bridges in Holland.\n"}, {"title": "A California Christmas", "rating": "PG-13", "description": "With his carefree lifestyle on the line, a wealthy charmer poses as a ranch hand to get a hardworking farmer to sell her family’s land before Christmas.\n"}, {"title": "A Champion Heart", "rating": "G", "description": "When a grieving teen must work off her debt to a ranch, she cares for a wounded horse that teaches her more about healing than she expected.\n"}, {"title": "A Cinderella Story", "rating": "PG", "description": "Teen Sam meets the boy of her dreams at a dance before returning to toil in her stepmother's diner. Can her lost cell phone bring them together?\n"}, {"title": "A Cinderella Story: Christmas Wish", "rating": "PG", "description": "Despite her vain stepmother and mean stepsisters, an aspiring singer works as an elf at a Christmas tree lot and finds her own holiday miracle.\n"}, {"title": "A Clockwork Orange", "rating": "R", "description": "In this dark satire from director Stanley Kubrick, a young, vicious sociopath in a dystopian England undergoes an experimental rehabilitation therapy.\n"}, {"title": "A Dangerous Woman", "rating": "R", "description": "At the center of this engrossing melodrama is a Golden Globe-nominated turn by Debra Winger, who plays a sheltered, slow-witted woman living with her widowed Aunt Frances while working at a dry cleaners.\n"}, {"title": "A Family Man", "rating": "R", "description": "A ruthless corporate headhunter battles his rival for a promotion while dealing with a family crisis that threatens to derail his career.\n"}, {"title": "A Ghost Story", "rating": "R", "description": "Following a fatal car crash, a man's spirit remains stuck in the home he shared with his wife as doors into the past and future begin to open.\n"}, {"title": "A Glimpse Inside the Mind of Charles Swan III", "rating": "R", "description": "When his girlfriend walks out and leaves him a wreck, a graphic designer – who seemed to have it all – sets out to discover where he went wrong.\n"}, {"title": "A Haunted House", "rating": "R", "description": "This spoof on scary movies follows a young couple settling into a new home, where an evil spirit — and horrifyingly hilarious antics — await.\n"}, {"title": "A Kind of Murder", "rating": "R", "description": "Obsessed with an unsolved murder case, a crime novelist stuck in an unhappy marriage fantasizes about killing his wife, who soon turns up dead.\n"}, {"title": "A Little Chaos", "rating": "R", "description": "A willful young woman is hired to design a garden at Versailles for Louis XIV. Soon, she's ensnared in political and romantic complications.\n"}, {"title": "A Monster Calls", "rating": "PG-13", "description": "Overwhelmed by his mother’s illness, a young boy begins to understand human complexity through the fantastic tales of a consoling tree monster.\n"}, {"title": "A Most Violent Year", "rating": "R", "description": "Abel Morales tries to avoid corruption's easy path as he pursues the American Dream amid an increasingly violent business war in 1981 New York City.\n"}, {"title": "A Murder in the Park", "rating": "PG-13", "description": "This documentary excoriates a noted anti-death-penalty activist and his team, whose questionable methods got a convicted killer freed in 1999.\n"}, {"title": "A Night at the Roxbury", "rating": "PG-13", "description": " sketch.\n"}, {"title": "A Perfect Man", "rating": "R", "description": "Nina thinks her husband, James, is cheating on her, and she sets out to prove it by calling him and pretending to be another woman.\n"}, {"title": "A Separation", "rating": "PG-13", "description": "Amid an impasse in his marriage, a father in Tehran is beset by a bitter feud involving the family of a pious caretaker he hired for his aging dad.\n"}, {"title": "A Serious Man", "rating": "R", "description": "With every aspect of his life unraveling, a Jewish physics professor seeks out three rabbis for spiritual guidance.\n"}, {"title": "A Shaun the Sheep Movie: Farmageddon", "rating": "G", "description": "Shaun and the flock race to help an adorable alien find her way home after her ship crash-lands near Mossy Bottom Farm and sparks a UFO frenzy.\n"}, {"title": "A Single Man", "rating": "R", "description": "This stream-of-consciousness drama centers on a day in the life of a gay college professor who's reeling from his longtime lover's recent death.\n"}, {"title": "A Tale of Love and Darkness", "rating": "PG-13", "description": "Based on the memoirs of author Amos Oz, this poetic drama shares his family's tale of suffering and survival in the early years of independent Israel.\n"}, {"title": "A Thin Line Between Love & Hate", "rating": "R", "description": "When a philandering club promoter sets out to woo a rich, glamorous woman, he has no clue just how much mayhem he's about to unleash on his life.\n"}, {"title": "A Thousand Words", "rating": "PG-13", "description": "When he learns his karma will permit him to speak just a thousand more words before he dies, fast-talking agent Jack must make every syllable count.\n"}, {"title": "A Walk to Remember", "rating": "PG", "description": "When bad boy Landon is cast opposite campus bookworm Jamie in a high school play, romance blooms — until tragedy threatens to tear them apart.\n"}, {"title": "A Witches' Ball", "rating": "PG", "description": "Beatrix can't wait to be inducted as a witch, but an unfortunate incident threatens to take her pending title away if she doesn't act fast.\n"}, {"title": "A Wrinkle in Time", "rating": "PG", "description": "Years after their father disappears, Meg and her younger brother Charles Wallace cross galaxies on a quest to save him from the heart of darkness.\n"}, {"title": "A.X.L.", "rating": "PG", "description": "Young motocross racer Miles Hill helps a top-secret robotic combat dog evade its ruthless creator and the military, who are in hot pursuit.\n"}, {"title": "About Time", "rating": "R", "description": "When Tim learns that the men in his family can travel in time and change their own lives, he decides to go back and win the woman of his dreams.\n"}, {"title": "About a Boy", "rating": "PG-13", "description": "Hip, irresponsible Londoner Will invents an imaginary son and starts attending single-parent meetings to find available women.\n"}, {"title": "Across the Universe", "rating": "PG-13", "description": "An American girl and a British lad fall in love amid the social and political upheaval of the 1960s, in this musical featuring songs by the Beatles.\n"}, {"title": "Act of Valor", "rating": "R", "description": "An elite squad of Navy SEALs is tasked with rescuing a kidnapped CIA agent from a lethal terrorist cell.\n"}, {"title": "Acts of Vengeance", "rating": "R", "description": "Devastated by the murder of his wife and child, a formerly fast-talking lawyer takes a vow of silence and trains himself for a mission of revenge.\n"}, {"title": "Acts of Violence", "rating": "R", "description": "When his future sister-in-law is kidnapped by human traffickers, a military veteran joins forces with his brothers and a world-weary cop to rescue her.\n"}, {"title": "Adore", "rating": "R", "description": "When lifelong friends Roz and Lil fall in love with each other's teenage sons, they must carry out their affairs in relative secrecy.\n"}, {"title": "Adrift", "rating": "PG-13", "description": "A young couple’s sailing adventure becomes a fight to survive when their yacht faces a catastrophic hurricane in this story based on true events.\n"}, {"title": "After", "rating": "PG-13", "description": "Wholesome college freshman Tessa Young thinks she knows what she wants out of life, until she crosses paths with complicated bad boy Hardin Scott.\n"}, {"title": "After We Collided", "rating": "R", "description": "Tessa fell hard and fast for Hardin, but after a betrayal tears them apart, she must decide whether to move on — or trust him with a second chance.\n"}, {"title": "Aftermath", "rating": "R", "description": "After an air traffic controller's mistake results in a tragic accident, a man who lost his wife and daughter seeks answers from the man responsible.\n"}, {"title": "Aftershock", "rating": "R", "description": "An American tourist and his friends are partying in Chile, but a major earthquake devastates the area and forces them to scramble for survival.\n"}, {"title": "Ai Weiwei: Never Sorry", "rating": "R", "description": "Chinese artist and activist Ai Weiwei uses social media and art to inspire protests and suffers government persecution for his actions.\n"}, {"title": "Alice Doesn't Live Here Anymore", "rating": "PG", "description": "A widowed singer and single mother starts over as a diner waitress in Arizona, befriending her coworkers and romancing a ruggedly handsome rancher.\n"}, {"title": "Aliens Ate My Homework", "rating": "PG", "description": "Tiny alien lawmen fly into Rod's bedroom and recruit him into helping them stop an intergalactic criminal – who's disguised as a very familiar human.\n"}, {"title": "All About Nina", "rating": "R", "description": "Fearless provocation has fueled stand-up comic Nina Geld's career, but a move to LA and a new love take her to new levels of honesty.\n"}, {"title": "All Day and a Night", "rating": "R", "description": "While serving life in prison, a young man looks back at the people, the circumstances and the system that set him on the path toward his crime.\n"}, {"title": "All Dogs Go to Heaven", "rating": "G", "description": "When a canine con artist becomes an angel, he sneaks back to Earth and crosses paths with an orphan girl who can speak to animals.\n"}, {"title": "All Together Now", "rating": "PG", "description": "An optimistic, talented teen clings to a huge secret: She's homeless and living on a bus. When tragedy strikes, can she learn to accept a helping hand?\n"}, {"title": "All the Boys Love Mandy Lane", "rating": "R", "description": "During a weekend excursion to a secluded ranch, an unwelcome visitor begins picking off the randy admirers of teenage temptress Mandy Lane.\n"}, {"title": "All the Devil's Men", "rating": "R", "description": "A battle-scarred Special Ops military vet joins a CIA-funded assignment to take down a Russian terrorist and his trigger-happy comrades.\n"}, {"title": "AllI Wish", "rating": "R", "description": "Over a series of birthdays, a happy-go-lucky, commitment-averse fashion designer strives to bring a bit of calm to her chaotic love life.\n"}, {"title": "Alone in Berlin", "rating": "R", "description": "After learning of their son's death on the battlefield, a grieving Berlin couple embark on a quietly dangerous act of resistance against Adolf Hitler.\n"}, {"title": "Along Came a Spider", "rating": "R", "description": "When a girl is kidnapped from a prestigious prep school, a homicide detective takes the case, teaming up with young security agent.\n"}, {"title": "Amandla! A Revolution in Four Part Harmony", "rating": "PG-13", "description": "This documentary recounts the fascinating and little-known role that music has played in the struggle to eradicate apartheid in South Africa.\n"}, {"title": "American Assassin", "rating": "R", "description": "After grad student Mitch Rapp suffers a tragic loss during a terrorist attack, his single-minded thirst for vengeance catches the interest of the CIA.\n"}, {"title": "American Beauty", "rating": "R", "description": "While struggling to endure his tightly wound wife, an unfulfilling job and a surly teen, a man becomes obsessed with one of his daughter's friends.\n"}, {"title": "American Heist", "rating": "R", "description": "An ex-con is just getting his life back on track when his older brother is released from prison and drags him into the underworld for one final heist.\n"}, {"title": "American History X", "rating": "R", "description": "A neo-Nazi gets sent to prison for murder and comes out a changed man. But can he prevent his younger brother from following in his footsteps?\n"}, {"title": "American Honey", "rating": "R", "description": "A teenage girl leaves her dull life in Oklahoma to join a raucous band of travelling magazine sellers on an alcohol-, drug- and sex-filled road trip.\n"}, {"title": "American Pie 9: Girls' Rules", "rating": "R", "description": "Four tight-knit high school seniors vow to turn their love lives around by homecoming when the arrival of a new student muddles their plans.\n"}, {"title": "American Psycho", "rating": "R", "description": "With chiseled good looks that belie his insanity, a businessman takes pathological pride in yuppie pursuits and indulges in sudden homicidal urges.\n"}, {"title": "Amy", "rating": "R", "description": "Rare home videos and interviews with Amy Winehouse's inner circle offer an intimate look at her journey from charismatic teen to troubled star.\n"}, {"title": "An American Tail", "rating": "G", "description": "Fievel, a young Russian mouse, immigrates to America and must make his own way in the strange and sometimes perilous new world.\n"}, {"title": "An American Tail: Fievel Goes West", "rating": "G", "description": "Fievel and his family head west for what turns out to be a wild adventure. Deep in cowboy country, the intrepid mouse faces down a nasty feline.\n"}, {"title": "An American Tail: The Mystery of the Night Monster", "rating": "G", "description": "When a monster goes on a mouse-napping spree in New York, Fievel and his friends help a reporter get to the bottom of the mystery.\n"}, {"title": "An American Tail: The Treasures of Manhattan Island", "rating": "G", "description": "When Fievel and friends go hunting for buried treasure beneath the ruins of an old subway tunnel, they stumble onto something surprising.\n"}, {"title": "An Evening with Beverly Luff Linn", "rating": "R", "description": "When an unhappily married woman discovers a man from her past has a role in a local theater production, she'll do anything to reconnect with him.\n"}, {"title": "An Imperfect Murder", "rating": "R", "description": "Haunted by a nightmare involving her abusive ex-boyfriend, an actress begins to question her reality and whether the incident took place.\n"}, {"title": "An Ordinary Man", "rating": "R", "description": "A war criminal in hiding begins to suspect that the maid, his only confidant and contact with the outside world, may be hiding something herself.\n"}, {"title": "Anesthesia", "rating": "R", "description": "After a popular professor is attacked on a New York street, the story of how a series of intertwined events led to the life-altering assault unfolds.\n"}, {"title": "Angel Eyes", "rating": "R", "description": "When a violent assault leaves her vulnerable, a streetwise Chicago cop receives help from a haunted loner who's struggling with traumas of his own.\n"}, {"title": "Angel Has Fallen", "rating": "R", "description": "Secret Service agent Mike Banning is caught in the crossfire when he’s framed for a deadly attack on the president and forced to run for his life.\n"}, {"title": "Angels & Demons", "rating": "PG-13", "description": "A Harvard symbologist races to uncover clues that will help stop an attack on the Vatican by a secret society looking to retaliate for old persecutions.\n"}, {"title": "Anger Management", "rating": "PG-13", "description": "After a gentle businessman is forced to get anger management counseling, his therapist moves in – but turns out to have anger issues of his own.\n"}, {"title": "Ant-Man and the Wasp", "rating": "PG-13", "description": "Problems big and small pop up when Scott Lang, aka Ant-Man, gets drafted by Dr. Hank Pym and Hope van Dyne, aka the Wasp, for an urgent rescue mission.\n"}, {"title": "Apollo 18", "rating": "PG-13", "description": "This sci-fi thriller suggests that Apollo 17, despite official statements to the contrary, wasn't NASA's last manned mission to the moon.\n"}, {"title": "April and the Extraordinary World", "rating": "PG", "description": "After the world's top scientists disappear, orphaned April secretly forges ahead with a family experiment and gets tangled up in a vast conspiracy.\n"}, {"title": "Arctic Dogs", "rating": "PG", "description": "When he stumbles upon evil Otto Von Walrus's scheme to melt the Arctic, ambitious delivery fox Swifty assembles a ragtag crew to protect the planet.\n"}, {"title": "Arthur", "rating": "PG-13", "description": "Russell Brand stars in this remake as a philanderer who must decide whether to give up an inheritance of millions for the sake of romance.\n"}, {"title": "Arthur Christmas", "rating": "PG", "description": "At Santa Claus's super-secret toy-making facility, Mr. Claus entrusts his son, Arthur, to carry out an ultra-important Christmas mission.\n"}, {"title": "As Above, So Below\"", "rating": "R", "description": "A beautiful tomb raider and her crew hunt for treasure in the catacombs of Paris and find themselves in a hellish underworld.\n"}, {"title": "As Good as It Gets", "rating": "PG-13", "description": "The structured world of a sour, obsessive-compulsive author crumbles when he's drawn into the lives of a stressed-out single mom and his gay neighbor.\n"}, {"title": "Asoka", "rating": "R", "description": "This elaborate Bollywood epic dramatizes one man's transformation from a vengeful and cunning warrior into a legendary leader and teacher of Buddhism.\n"}, {"title": "Athlete A", "rating": "PG-13", "description": "This documentary focuses on the gymnasts who survived USA Gymnastics doctor Larry Nassar's abuse and the reporters who exposed USAG's toxic culture.\n"}, {"title": "Atlas Shrugged: Part II", "rating": "PG-13", "description": "With the world's economy in dire straits, corporate protagonist Dagny Taggart searches for a solution amid the rubble of a long-abandoned factory.\n"}, {"title": "Austin Powers in Goldmember", "rating": "PG-13", "description": "The world's most shagadelic spy continues his fight against the diabolical Dr. Evil, who's teamed with a new foe: 1970s villain Goldmember.\n"}, {"title": "Austin Powers: International Man of Mystery", "rating": "PG-13", "description": "A swingin' fashion photographer by day and a groovy British secret agent by night, superspy Austin Powers must foil the sinister schemes of Dr. Evil.\n"}, {"title": "Austin Powers: The Spy Who Shagged Me", "rating": "PG-13", "description": " Austin must return to the swingin' '60s himself.\n"}, {"title": "Automata", "rating": "R", "description": "In a dystopian future, an insurance adjuster for a tech company investigates a robot killed for violating protocol and discovers a global conspiracy.\n"}, {"title": "Ava", "rating": "R", "description": "An elite assassin wrestling with doubts about her work scrambles to protect herself — and her estranged family — after a hit goes dangerously wrong.\n"}, {"title": "Avengers: Infinity War", "rating": "PG-13", "description": "Superheroes amass to stop intergalactic sociopath Thanos from acquiring a full set of Infinity Stones and wiping out half of all life in the universe.\n"}, {"title": "BASEketball", "rating": "R", "description": "When two slackers' made-up sport, BASEketball, becomes a national craze, they hope to cash in on the basketball/baseball hybrid's popularity.\n"}, {"title": "Babel", "rating": "R", "description": "When an American couple vacationing in Morocco falls victim to a random act of violence, a series of events unfolds across four countries.\n"}, {"title": "Backdraft 2", "rating": "R", "description": "In this sequel to the 1991 film, a determined fire investigator recruits an imprisoned arsonist to help untangle a web of fire, murder and corruption.\n"}, {"title": "Backtrack", "rating": "R", "description": "Haunted by visions of the dead, psychologist Peter returns home to confront a long-ago trauma. But will the trip exorcise or embolden the ghosts?\n"}, {"title": "Bad Boys", "rating": "R", "description": "In this fast-paced actioner, two Miami narcotics cops are hot on the trail of a master crook who has snatched $100 million worth of heroin.\n"}, {"title": "Bad Boys II", "rating": "R", "description": "In this hyperkinetic sequel, a pair of Miami narcotics cops investigate a Cuban drug kingpin's connection to Florida's influx of Ecstasy.\n"}, {"title": "Balto", "rating": "G", "description": "Balto, who is half wolf and half dog, endures the taunts of disapproving humans as he guides a precious cargo of medicine through the Alaskan winter.\n"}, {"title": "Balto 2: Wolf Quest", "rating": "G", "description": "Half-dog, half-wolf Balto (voiced by Maurice LaMarche) and his wife proudly put their pups up for adoption to humans, but when nobody takes daughter Aleu because she looks too much like a wolf, she runs away to search for her place in the world.\n"}, {"title": "Balto 3: Wings of Change", "rating": "G", "description": "A pilot challenges Balto's son Kodi and his sled team to see who can deliver the mail faster, but the dogs race to the rescue when the plane vanishes.\n"}, {"title": "Band Aid", "rating": "R", "description": "A young married couple tries to save their disintegrating relationship by turning their fights into songs, with the help of an oddball neighbor.\n"}, {"title": "Barely Lethal", "rating": "PG-13", "description": "A girl raised to be a government assassin just wants to be a normal teen – so she runs away and pretends to be a high school exchange student.\n"}, {"title": "Basic Instinct", "rating": "R", "description": "A detective investigating a rock star's brutal murder becomes drawn to the prime suspect — a mysterious novelist whose recent book mirrors the crime.\n"}, {"title": "Bathtubs Over Broadway", "rating": "PG-13", "description": "A comedy writer for David Letterman unearths a hidden world of hilariously bizarre musicals, which turns into a toe-tapping obsession.\n"}, {"title": "Batman: The Killing Joke", "rating": "R", "description": "The Joker makes life hell for the Gordon family in a monstrous attempt to prove to Batman that one bad day can drive a good man to madness.\n"}, {"title": "Be Somebody", "rating": "PG", "description": "To escape the stress of fame, teen pop star Jordan goes incognito in a small town, where he forms a special bond with high school art student Emily.\n"}, {"title": "Bean: The Ultimate Disaster Movie", "rating": "PG-13", "description": "Disaster-prone Mr. Bean is sent to Los Angeles to guard a famous painting, but as he's unfit for any physical task, everything goes hilariously wrong.\n"}, {"title": "Beavis and Butt-head Do America", "rating": "PG-13", "description": "After realizing that their boob tube is gone, Beavis and Butt-head set off on an expedition that takes them from Las Vegas to the nation's capital.\n"}, {"title": "Bebe's Kids", "rating": "PG-13", "description": "When ladies' man Robin meets Jamika, he falls head over heels, but she greets him with four surprises: her son and her girlfriend Bebe's three kids.\n"}, {"title": "Becoming", "rating": "PG", "description": "\n"}, {"title": "Becoming Jane", "rating": "PG-13", "description": "A passionate romance with roguish barrister Tom Lefroy serves as the inspiration for the works of budding novelist Jane Austen.\n"}, {"title": "Bedtime Stories", "rating": "PG", "description": "Skeeter's life is turned upside down when the fantastical stories he makes up to entertain his niece and nephew inexplicably turn into reality.\n"}, {"title": "Bee Movie", "rating": "PG", "description": "Barry, a worker bee stuck in a dead-end job making honey, sues humans when he learns they've been stealing bees' nectar all along.\n"}, {"title": "Before I Fall", "rating": "PG-13", "description": "Forced to continually relive the day she dies in a car crash, a privileged high schooler must unravel the cosmic mystery of her suddenly looping life.\n"}, {"title": "Before I Wake", "rating": "PG-13", "description": "Still mourning the death of their son, Mark and Jessie welcome foster child Cody into their lives. Soon they discover he has a strange ability.\n"}, {"title": "Before the Flood", "rating": "PG", "description": "Leonardo DiCaprio crisscrosses the globe to investigate the consequences of man-made globe warming and the measures being taken to reverse it.\n"}, {"title": "Being Elmo: A Puppeteer's Journey", "rating": "PG", "description": "\n"}, {"title": "Benchwarmers 2: Breaking Balls", "rating": "PG-13", "description": "A rookie lawyer with an emasculating past in baseball can break into the legal world only if he manages a law firm's ragtag company softball team.\n"}, {"title": "Benji: Off the Leash", "rating": "PG", "description": "Benji is back in this charming story that's told from the pooch's point of view, tracking his early days as a pup to his current life in showbiz.\n"}, {"title": "Bennett's War", "rating": "PG-13", "description": "A medically discharged soldier attempts an improbable return to motorcycle racing to win enough prize money to save his father's farm.\n"}, {"title": "Berlin Syndrome", "rating": "R", "description": "What starts as a passionate one-night stand quickly turns sinister when Clare learns she's locked inside Andi's apartment with no way out.\n"}, {"title": "Berlin, I Love You\"", "rating": "R", "description": " installment is a star-studded, 10-story collection of redemptive love, crushing loss and everyday romances.\n"}, {"title": "Bethany Hamilton: Unstoppable", "rating": "PG", "description": "This documentary follows the rising tide of Bethany Hamilton who lost her arm as a teen before making waves in pro surfing and her personal life.\n"}, {"title": "Between Worlds", "rating": "R", "description": "Grieving for his dead wife and daughter, a trucker plunges into a romance with a mother who needs his help. The dead, however, are far from gone.\n"}, {"title": "Beyond Skyline", "rating": "R", "description": "In the wake of an extraterrestrial invasion, a suspended L.A. cop teams up with survivors to stop the onslaught and rescue human captives.\n"}, {"title": "Big Daddy", "rating": "PG-13", "description": "Dumped by his girlfriend because he refuses to accept responsibility, overgrown adolescent Sonny Koufax adopts a 5-year-old to prove he's a grownup.\n"}, {"title": "Big Fat Liar", "rating": "PG", "description": "Junior high students Jason and Kaylee take action when a greedy Hollywood producer turns Jason's essay into a hit film without giving him credit.\n"}, {"title": "Big Kill", "rating": "R", "description": "A tenderfoot and two gamblers seeking their fortunes in a boom town instead find themselves defending it from a gunslinging preacher and his gang.\n"}, {"title": "Big Miracle", "rating": "PG", "description": "After a reporter writes about whales trapped in the Arctic Circle, the U.S. and U.S.S.R. team up to rescue them in this tale inspired by true events.\n"}, {"title": "Big Stone Gap", "rating": "PG-13", "description": "A single middle-aged woman who has lived her whole life in a small Virginia mining town uncovers a family secret that alters her profoundly.\n"}, {"title": "Bigger Fatter Liar", "rating": "PG", "description": "When his video game concept is stolen by a dishonest executive, a teenage chronic liar sets out to prove that he's telling the truth, for once.\n"}, {"title": "Biggie & Tupac", "rating": "R", "description": "British documentarian Nick Broomfield investigates the murders of rappers Tupac Shakur and Biggie Smalls, digging up some surprises in the process.\n"}, {"title": "Billy Elliot", "rating": "R", "description": "When a boy trades boxing school for ballet lessons, he may take his newfound talent all the way to the top - and win over his disapproving father.\n"}, {"title": "Bird Box", "rating": "R", "description": "Five years after an ominous unseen presence drives most of society to suicide, a survivor and her two children make a desperate bid to reach safety.\n"}, {"title": "Bitch", "rating": "R", "description": "Cracking under the demands of children and a philandering, thankless husband, an overworked suburban mother assumes the persona of a ferocious dog.\n"}, {"title": "Black '47", "rating": "R", "description": "When the Great Famine ravages his beloved country, a battle-hardened Irishman deserts the British Empire and exacts revenge on the tyrants responsible.\n"}, {"title": "Black Hawk Down", "rating": "R", "description": "When U.S. forces attempt to capture two underlings of a Somali warlord, their helicopters are shot down and the Americans suffer heavy casualties.\n"}, {"title": "Black Panther", "rating": "PG-13", "description": "T'Challa, the superpowered new leader of the hidden, highly advanced African nation of Wakanda, strives to protect his home from enemies old and new.\n"}, {"title": "Black Sea", "rating": "R", "description": "A hard-driving submarine captain is hired to steal gold from a sunken Nazi sub, but there's no honor among thieves during this underwater heist.\n"}, {"title": "Black Snake Moan", "rating": "R", "description": "Lazarus finds Rae beaten and near death, and acts as a father figure to help redeem her. But before saving anyone, Lazarus must face his own demons.\n"}, {"title": "Blackfish", "rating": "PG-13", "description": "This fascinating documentary examines the life of performing killer whale Tilikum, who has caused the deaths of several people while in captivity.\n"}, {"title": "Blackway", "rating": "PG-13", "description": "Menaced by a psychopath who's got the local cops scared, waitress Lillian turns to a mysterious old logger to help her turn the tables on her stalker.\n"}, {"title": "Blaze", "rating": "R", "description": "An influential, if unsung country songwriter reflects on his career, and how the love of his life drove him to write his most personal music.\n"}, {"title": "Bleed for This", "rating": "R", "description": "After a devastating injury derails his career, scrappy world champion boxer Vinny Pazienza determines to make an against-all-odds comeback.\n"}, {"title": "Blinky Bill: The Movie", "rating": "PG", "description": "Happy koala Blinky Bill and some spunky pals travel the Outback following clues to help him find his long-lost father and finally bring him home.\n"}, {"title": "Blood Father", "rating": "R", "description": "An ex-convict and estranged father finds the chance to prove himself when his daughter seeks his help shaking off a dangerous group of drug dealers.\n"}, {"title": "Blow", "rating": "R", "description": "Cocaine smuggler George rises from poverty to become one of the biggest drug dealers in America before his eventual downfall.\n"}, {"title": "Blue Is the Warmest Color", "rating": "NC-17", "description": "Determined to fall in love, 15-year-old Adele is focused on boys. But it's a blue-haired girl she meets on the street who really piques her interest.\n"}, {"title": "Blue Jasmine", "rating": "PG-13", "description": "The high life leads to high anxiety for a fashionable New York City homemaker in crisis who finds herself forced to live a more modest lifestyle.\n"}, {"title": "Blue Mountain State: The Rise of Thadland", "rating": "R", "description": "New NFL star Thad buys his old teammates' beloved frat house, renames it Thadland and throws the raunchiest, most debauched party in school history.\n"}, {"title": "Blue Ruin", "rating": "R", "description": "Bad news from the past unhinges vagabond Dwight Evans, sending him on a mission of bloody retribution that takes him to his childhood hometown.\n"}, {"title": "Blue Streak", "rating": "PG-13", "description": "A jewel thief returns to his hiding place after a stint in jail — only to find that his diamond is buried under a newly constructed police station.\n"}, {"title": "Blue Valentine", "rating": "R", "description": "As Cindy and Dean muddle through their languishing marriage, they hearken back to the golden days when life was filled with possibility and romance.\n"}, {"title": "Bobbleheads The Movie", "rating": "PG", "description": "A team of bobbleheads band together to defend their collector’s home when uninvited relatives barge in looking to steal from his prized collection.\n"}, {"title": "Bolt", "rating": "PG", "description": "This tale follows German shepherd Bolt, a canine actor who makes a cross-country trek when he's mistakenly shipped from Hollywood to New York City.\n"}, {"title": "Bonnie and Clyde", "rating": "R", "description": "Bonnie Parker and Clyde Barrow are young, in love and on the run during a bullet-riddled bank robbery spree across Depression-ravaged America.\n"}, {"title": "Born Racer", "rating": "R", "description": "In this all-access pass, IndyCar champion Scott Dixon and his team navigate the risks on the road in the quest to win it all.\n"}, {"title": "Boy and the World", "rating": "PG", "description": "Young Cuca leaves his idyllic village on a grand adventure to find his father, who has traveled to the city seeking work.\n"}, {"title": "Boyka: Undisputed", "rating": "R", "description": "The fourth film in the action franchise finds Boyka taking on brutal gangsters to protect the widow of a man he unintentionally killed in the ring.\n"}, {"title": "Brain on Fire", "rating": "PG-13", "description": "Stricken with seizures, psychosis and memory loss, a young New York Post reporter visits doctor after doctor in search of an elusive diagnosis.\n"}, {"title": "Bratz: The Movie", "rating": "PG", "description": "When high school hierarchy divides four best friends into different cliques, the girls defy expectations and try to bring their groups together.\n"}, {"title": "Braven", "rating": "R", "description": "A logger defends himself and his family from a group of murderous drug traffickers who have hidden a stash of heroin in his hunting cabin.\n"}, {"title": "Brick", "rating": "R", "description": "Teenage loner Brendan Fry navigates his high school's intense social network to discover a killer's identity after his secret crush is murdered.\n"}, {"title": "Bring It On: Worldwide Showdown", "rating": "PG-13", "description": "When cheerleading champs the Rebels are challenged by an edgy new squad, they take on teams from all over the world in a virtual cheer battle.\n"}, {"title": "Brooklyn's Finest", "rating": "R", "description": "Three cops find themselves hurtling toward the same crime scene on one fatal night in this tense, edge-of your-seat thriller.\n"}, {"title": "Bullet Head", "rating": "R", "description": "After a daring heist, three fugitives lock themselves in a warehouse hoping to evade the police, but find a worse threat as they fight to stay alive.\n"}, {"title": "Bully", "rating": "PG-13", "description": "This eye-opening documentary tracks the stories of five different families whose children are struggling to defend themselves from school bullies.\n"}, {"title": "Burlesque", "rating": "PG-13", "description": "After leaving Iowa with stars in her eyes, Ali arrives at a Los Angeles burlesque lounge with dreams of taking the stage with her soaring voice.\n"}, {"title": "By the Sea", "rating": "R", "description": "Troubled by the state of their marriage, Vanessa and Roland visit a French seaside town, where they have a fateful encounter with a pair of newlyweds.\n"}, {"title": "Cabin Fever", "rating": "R", "description": "As a flesh-eating virus rips its way through a remote woodland cabin, the terrified teens vacationing inside wonder who'll fall victim next.\n"}, {"title": "Camp X-Ray", "rating": "R", "description": "Fresh Army recruit Amy Cole is assigned to Guantanamo Bay's Camp X-Ray, where she forms a surprising bond with one of the prisoners in her charge.\n"}, {"title": "Can't Hardly Wait", "rating": "PG-13", "description": "At a wild high school graduation party, aspiring writer Preston hopes to declare his love to popular girl Amanda, who just got dumped by the class jock.\n"}, {"title": "Candyman", "rating": "R", "description": "Grad student Helen Lyle unintentionally summons the Candyman, a hook-handed creature made flesh by other people's belief in him.\n"}, {"title": "Canvas", "rating": "G", "description": "After a heartbreaking loss, a grandfather struggling to reclaim his passion for painting finds the inspiration to create again.\n"}, {"title": "Carol", "rating": "R", "description": "In the 1950s, a glamorous married woman and an aspiring photographer embark on a passionate, forbidden romance that will forever change their lives.\n"}, {"title": "Carrie", "rating": "R", "description": " torments her with a sick joke at the prom.\n"}, {"title": "Carriers", "rating": "PG-13", "description": "As a lethal virus spreads globally, four friends seek a reputed plague-free haven. But while avoiding the infected, the travelers turn on one another.\n"}, {"title": "Casa de mi Padre", "rating": "R", "description": "Will Ferrell stars as a Spanish-speaking cowboy in this comedy about a Mexican clan trying to rescue their ranch from greedy creditors.\n"}, {"title": "Case 39", "rating": "R", "description": "A naïve social worker brings a 10-year-old child into her home to rescue the girl from abusive parents – only to learn that she isn't what she seems.\n"}, {"title": "Casino Royale", "rating": "PG-13", "description": "Daniel Craig makes his debut as the newly minted agent 007, who's pitted against an infamous financier of global terrorism – at the poker table.\n"}, {"title": "Catch Me If You Can", "rating": "PG-13", "description": "An FBI agent makes it his mission to put cunning con man Frank Abagnale Jr. behind bars. But Frank not only eludes capture, he revels in the pursuit.\n"}, {"title": "Cats & Dogs: The Revenge of Kitty Galore", "rating": "PG", "description": "Cats and dogs must set aside their differences and merge animal instincts when Kitty Galore decides to claw her way to global domination.\n"}, {"title": "Center Stage", "rating": "PG-13", "description": "Vying for a spot in the American Ballet Company, 12 dance students are ready to push their bodies and minds to the limit to realize their dreams.\n"}, {"title": "Change in the Air", "rating": "PG", "description": "When a secretive woman breezes into a quiet town, her subdued neighbors get swept up in curiosity over her ethereal presence.\n"}, {"title": "Chappaquiddick", "rating": "PG-13", "description": "Senator Ted Kennedy watches his future unravel in the wake of an infamous car crash as family and allies vie to protect his reputation.\n"}, {"title": "Chappie", "rating": "R", "description": "In a futuristic society where a robot police force keeps crime at bay, a lone droid gains the power of artificial intelligence.\n"}, {"title": "Charlie and the Chocolate Factory", "rating": "PG", "description": "The eccentric Willy Wonka opens the doors of his candy factory to five lucky kids who learn the secrets behind his amazing confections.\n"}, {"title": "Charlie's Angels", "rating": "PG-13", "description": "Three beauties use their looks, charm and martial-arts training to kick butt on the trail of stolen software in this reboot of the classic TV series.\n"}, {"title": "Charlie's Angels: Full Throttle", "rating": "PG-13", "description": "In this reboot of the TV classic, the Angels are tasked with finding lost rings encoded with the personal information of people in witness protection.\n"}, {"title": "Charlotte's Web", "rating": "G", "description": "Follow the adventures of Wilbur the pig, Templeton the rat and Charlotte the spider in this animated musical version of E.B. White's timeless story.\n"}, {"title": "Chasing Amy", "rating": "R", "description": "Comic book artist Holden meets the perfect woman, only to learn that she's a lesbian. But that doesn't stop him from falling in love with her.\n"}, {"title": "Chef", "rating": "R", "description": "After igniting a Twitter war with a well-known culinary critic, a Los Angeles chef packs his knives, heads home to Miami and opens a food truck.\n"}, {"title": "Chernobyl Diaries", "rating": "R", "description": "A group of kids takes an illegal tour through an abandoned city near Chernobyl, where mysterious humanoid forms begin to haunt their steps...\n"}, {"title": "Chicken Little", "rating": "G", "description": "No one believes Chicken Little when he tries to warn of an alien invasion – so it's up to him and his misfit friends to save the world!\n"}, {"title": "Child's Play", "rating": "R", "description": "When a rash of murders unfolds, 6-year-old Andy knows that his toy doll Chucky is the killer, but neither his mom nor the cops believe him.\n"}, {"title": "Chitty Chitty Bang Bang", "rating": "G", "description": "Quirky inventor Caractacus Potts and his family travel in their magical flying car to Vulgaria, a kingdom strangely devoid of children.\n"}, {"title": "Chloe", "rating": "R", "description": "Suspecting her husband of infidelity, Catherine hires sexy Chloe to test his faithfulness. Soon, the relationships between all three intensify.\n"}, {"title": "Christian Mingle", "rating": "PG", "description": "A career woman who has everything but romance finds her values challenged when she starts dating a good man she met on a Christian matchmaking site.\n"}, {"title": "Christine", "rating": "R", "description": "In a film based on true events, an awkward but ambitious TV reporter struggles to adapt when she's ordered to focus on violent and salacious stories.\n"}, {"title": "Christmas Wedding Planner", "rating": "PG", "description": "A wedding planner’s world is turned upside down when a handsome private investigator is hired to disrupt one of her biggest jobs.\n"}, {"title": "Christmas with the Kranks", "rating": "PG", "description": "When Luther Krank and his wife opt to skip Christmas – no tree and no rooftop Frosty – can they handle the fallout from their family and neighbors?\n"}, {"title": "Christopher Robin", "rating": "PG", "description": "Now a careworn middle-aged man, Christopher Robin goes on a familiar adventure when his old pal Winnie the Pooh brings him to the Hundred Acre Wood.\n"}, {"title": "Chronicle of an Escape", "rating": "R", "description": "Soccer goalie Claudio Tamburrini is kidnapped by the Argentine military. Several months later, he joins other prisoners in planning a daring escape.\n"}, {"title": "Cirque du Freak: The Vampire's Assistant", "rating": "PG-13", "description": "When Darren Shan is taken to a circus that's chock-full of sideshow oddities, he meets a vampire and receives a life-changing bite on the neck.\n"}, {"title": "City of God", "rating": "R", "description": "Growing up in a Rio de Janeiro slum, Rocket is able to avoid being drawn into a life of drugs and crime by having a passion for photography.\n"}, {"title": "Clash of the Titans", "rating": "PG-13", "description": "If he is to save the life of the beautiful Princess Andromeda, the valiant Perseus must battle a host of powerful, beastly enemies.\n"}, {"title": "Cleopatra Jones", "rating": "PG", "description": "A stylin' special agent chases down drug lords and does her part to stop trafficking. Soon, she finds herself seeking revenge on a dealer.\n"}, {"title": "Click", "rating": "PG-13", "description": "Overworked Michael Newman stumbles on a universal remote control that gives him the power to pause or fast-forward through scenes in his life.\n"}, {"title": "Closed Circuit", "rating": "R", "description": "Martin and Claudia, top-flight lawyers who happen to be former lovers, become targets when they're teamed up to defend a notorious terrorist.\n"}, {"title": "Cloud Atlas", "rating": "R", "description": "In this star-studded drama, six seemingly disparate stories explore the complicated links that humanity shares through the generations.\n"}, {"title": "Clouds of Sils Maria", "rating": "R", "description": "A middle-aged actress is cast in a film adaptation of the play that made her famous 20 years earlier, but in a much less glamorous role.\n"}, {"title": "Cloudy with a Chance of Meatballs", "rating": "PG", "description": "When inventor Flint Lockwood makes clouds rain food, the citizens of Chewandswallow can feed themselves. But a bowl of disaster is about to overflow.\n"}, {"title": "Cloudy with a Chance of Meatballs 2", "rating": "PG", "description": "Inventor Flint Lockwood battles mutant food beasts created by his notorious machine, including shrimpanzees, tacodiles and jellyfish sandwiches.\n"}, {"title": "Cloverfield", "rating": "PG-13", "description": "A going-away party in Manhattan is interrupted when a mysterious monster of epic proportions launches an attack on New York City.\n"}, {"title": "Coach Carter", "rating": "PG-13", "description": "Controversial basketball coach Ken Carter puts school before sports and benches his undefeated high school team for poor academic performance.\n"}, {"title": "Code Name: The Cleaner", "rating": "PG-13", "description": "A mild-mannered janitor duped into believing he's an undercover agent stumbles into an international arms ring plot involving the CIA and the FBI.\n"}, {"title": "Colonia", "rating": "R", "description": "When her boyfriend is caught up in a Chilean coup, a young woman tries to free him from a prison camp posing as a commune by joining it voluntarily.\n"}, {"title": "Come and Find Me", "rating": "R", "description": "When his photographer girlfriend vanishes, an L.A. graphic designer starts his own investigation and uncovers a web of deceit, crime and corruption.\n"}, {"title": "Concussion", "rating": "R", "description": "A lesbian housewife, feeling trapped in a stale marriage, begins visiting female prostitutes and soon seeks excitement by becoming a sex worker.\n"}, {"title": "Conor McGregor: Notorious", "rating": "R", "description": "From making ends meet to lavish rides and fur coats, the Irish MMA champion grants an all-access pass to the highs – and lows – of his ascent.\n"}, {"title": "Cop Car", "rating": "R", "description": "Two mischievous boys get thrust into a game of cat and mouse with a murderous psychopath after they decide to steal a police officer’s cruiser.\n"}, {"title": "Cop and a Half: New Recruit", "rating": "PG", "description": "A world-weary detective is forced to team up with a 12-year-old who thinks she's a cop in order to solve a case that's baffled police.\n"}, {"title": "Cops and Robbers", "rating": "PG-13", "description": "Animation and activism unite in this multimedia spoken-word response to police brutality and racial injustice.\n"}, {"title": "Coraline", "rating": "PG", "description": "Curious young Coraline unlocks a door in her family's home and is transported to a universe that strangely resembles her own – only better.\n"}, {"title": "Crash", "rating": "R", "description": "In post-Sept. 11 Los Angeles, tensions erupt when the lives of people from all walks of life converge during a 36-hour period.\n"}, {"title": "Creep", "rating": "R", "description": "When a cash-strapped videographer takes a job in a remote mountain town, he finds that the client has some unsettling ideas in mind.\n"}, {"title": "Crip Camp: A Disability Revolution", "rating": "R", "description": "A groundbreaking summer camp galvanizes a group of teens with disabilities to help build a movement, forging a new path toward greater equality.\n"}, {"title": "Crouching Tiger, Hidden Dragon\"", "rating": "PG-13", "description": "A young woman in ancient China longs for an adventurous life rather than a dull arranged marriage in Ang Lee's Oscar-winning martial arts epic.\n"}, {"title": "Crouching Tiger, Hidden Dragon: Sword of Destiny\"", "rating": "PG-13", "description": "Renowned warrior Yu Shu-Lien comes out of retirement to keep the legendary Green Destiny sword away from villainous warlord Hades Dai.\n"}, {"title": "Cult of Chucky", "rating": "R", "description": "Following a string of murders in the asylum where she's confined, Nica Pierce begins to wonder whether Chucky is real after all.\n"}, {"title": "Cut Bank", "rating": "R", "description": "A small-town dreamer is sure he's landed on a gold mine after accidentally filming a murder but is sucked into a violent tale of greed and deception.\n"}, {"title": "Cutie and the Boxer", "rating": "R", "description": "A 2014 Oscar nominee for Best Documentary Feature, this film explores the symbiotic relationship of artists Ushio and Noriko Shinohara.\n"}, {"title": "Cézanne et moi", "rating": "R", "description": "This historical drama explores the long and often volatile friendship of painter Paul Cézanne and writer Émile Zola, who first met as schoolboys.\n"}, {"title": "Da 5 Bloods", "rating": "R", "description": "Four African American veterans return to Vietnam decades after the war to find their squad leader's remains — and a stash of buried gold. From Spike Lee.\n"}, {"title": "Dad", "rating": "PG", "description": "Family bonds are revived after a father is diagnosed with cancer in this bittersweet drama. Dutiful son John cares for his aging father, Jake, but not without complaint.\n"}, {"title": "Daddy Day Care", "rating": "PG", "description": "When a conscientious father loses his lucrative dot-com job and faces economic ruin, he joins two friends in opening a business called Daddy Day Care.\n"}, {"title": "Dallas Buyers Club", "rating": "R", "description": "Refusing to accept a death sentence from his doctor after being diagnosed with AIDS in 1986, Ron Woodroof smuggles medications from abroad.\n"}, {"title": "Dante's Peak", "rating": "PG-13", "description": "When a volcanologist comes to investigate the recent rumblings of a dormant volcano, a massive eruption has everyone in town fighting for their lives.\n"}, {"title": "Dark Crimes", "rating": "R", "description": "A detective on a cold murder case discovers that a famous writer’s latest novel contains details chillingly similar to the crime he’s investigating.\n"}, {"title": "Dark Places", "rating": "R", "description": "Years after surviving a brutal crime as a child, Libby Day comes to believe that the brother she testified against for committing it may be innocent.\n"}, {"title": "Dark Skies", "rating": "PG-13", "description": "A couple has trouble convincing friends and neighbors that an alien is entering their house each night to terrorize their children.\n"}, {"title": "David Attenborough: A Life on Our Planet", "rating": "PG", "description": "A broadcaster recounts his life, and the evolutionary history of life on Earth, to grieve the loss of wild places and offer a vision for the future.\n"}, {"title": "Day of the Dead: Bloodline", "rating": "R", "description": "A former medical student battles for survival against an evil human-zombie hybrid determined to destroy her, in this reimagining of the 1985 classic.\n"}, {"title": "De Palma", "rating": "R", "description": "\n"}, {"title": "Dean", "rating": "PG-13", "description": "As his father takes steps to move on, a New Yorker grieving his mom's death visits Los Angeles where new possibilities may bring him out of his funk.\n"}, {"title": "Death House", "rating": "R", "description": "Two federal agents battle through an army of rioting prisoners – and their sense of reality – inside a high-tech prison modeled after Dante’s Inferno.\n"}, {"title": "Death Race: Beyond Anarchy", "rating": "R", "description": "\n"}, {"title": "Death at a Funeral", "rating": "R", "description": "When a Los Angeles family's patriarch dies, his dutiful eldest son plans the funeral – which becomes a fiasco thanks to a colorful cast of attendees.\n"}, {"title": "Death of Me", "rating": "R", "description": "With no memory of the previous night, a vacationing couple uncovers a disturbing personal video that inexplicably shows one of them killing the other.\n"}, {"title": "Deep", "rating": "PG", "description": "After accidentally trapping his family in their underwater home, a young octopus and his ocean-dwelling buddies search for help far across the sea.\n"}, {"title": "Defiance", "rating": "R", "description": "In this action-packed drama based on an extraordinary true story, four brothers protect more than 1,000 Jewish refugees during World War II.\n"}, {"title": "Delirium", "rating": "R", "description": "A man with a history of mental issues moves into his late parents' mansion and comes to suspect his new home may be haunted.\n"}, {"title": "Demonic", "rating": "R", "description": "When amateur ghost hunters visit an abandoned house, their investigation turns into a massacre, leaving questions for a detective and a psychologist.\n"}, {"title": "Den of Thieves", "rating": "R", "description": "A highly skilled crew of bank robbers plotting a heist at the supposedly impenetrable Federal Reserve faces off against an elite unit of L.A. cops.\n"}, {"title": "Denis Leary: No Cure For Cancer", "rating": "R", "description": "In the stand-up performance that made him a legend, comedian Denis Leary caustically holds forth on nonsmokers, vegetarians and other undesirables.\n"}, {"title": "Detour", "rating": "R", "description": "Convinced his stepfather caused the crash that left his mother in a coma, a law student drunkenly agrees to his murder, then can't rescind the deal.\n"}, {"title": "Dick Johnson Is Dead", "rating": "PG-13", "description": "As her father nears the end of his life, filmmaker Kirsten Johnson stages his death in inventive and comical ways to help them both face the inevitable.\n"}, {"title": "Die Another Day", "rating": "PG-13", "description": "Pierce Brosnan's final outing as 007 finds James Bond facing off against a North Korean terrorist who's in league with a British diamond merchant.\n"}, {"title": "Dinner for Schmucks", "rating": "PG-13", "description": "The host of a dinner party invites his friends to bring the saddest loser they can find. But the ultimate schmuck turns everyone else into the losers.\n"}, {"title": "District 9", "rating": "R", "description": "After years of segregation and forced labor, a race of stranded aliens enlists in a resistance movement spearheaded by a rogue government agent.\n"}, {"title": "Django Unchained", "rating": "R", "description": "Accompanied by a German bounty hunter, a freed slave named Django travels across America to free his wife from a sadistic plantation owner.\n"}, {"title": "Doctor Zhivago", "rating": "PG-13", "description": "A young physician and his beautiful mistress get swept up in the danger and drama of the Bolshevik Revolution in this Oscar-winning epic.\n"}, {"title": "Dolemite Is My Name", "rating": "R", "description": "In 1970s LA, struggling comedian Rudy Ray Moore hits it big with his raunchy alter ego, Dolemite, then risks it all to take his act to the big screen.\n"}, {"title": "Dolphin Tale 2", "rating": "PG", "description": "Winter the dolphin, who survived a tragic injury by receiving a prosthetic tail, bonds with an orphaned baby dolphin after her beloved pool mate dies.\n"}, {"title": "Domino", "rating": "R", "description": "A Copenhagen police officer hunts for the man who attacked his partner, only to stumble into a high-stakes game of espionage.\n"}, {"title": "Don Verdean", "rating": "PG-13", "description": " advances his cause by creating phony religious artifacts.\n"}, {"title": "Don't Be Afraid of the Dark", "rating": "R", "description": "Young Sally Hurst discovers she isn't alone in her new house: strange creatures live there – and they might not be as friendly as Sally thinks.\n"}, {"title": "Don't Knock Twice", "rating": "R", "description": "A recovering addict becomes her estranged daughter's only hope after the teen awakens a terrifying child-stealing witch from an urban legend.\n"}, {"title": "Don't Think Twice", "rating": "R", "description": "Six talented but struggling improv comics see a sudden shift in their troupe's dynamic after one of them lands a much-coveted gig on television.\n"}, {"title": "Donnie Brasco", "rating": "R", "description": "When FBI agent Joe Pistone goes undercover to infiltrate the mob, he starts to identify with the made men he's charged with taking down.\n"}, {"title": "Doom", "rating": "R", "description": "A special ops squad investigating a distress signal from a distant planet discovers that mutant aliens have already wiped out most of the population.\n"}, {"title": "Doom: Annihilation", "rating": "R", "description": "When a swarm of soul-stealing demons invades a Martian moon, a group of elite space Marines must obliterate the beasts to save Earth.\n"}, {"title": "Double Jeopardy", "rating": "R", "description": " husband for good.\n"}, {"title": "Doubt", "rating": "PG-13", "description": "Sister Aloysius begins to have doubts about doting Father Flynn, who seems to have become overly involved in the life of an African American pupil.\n"}, {"title": "Dovlatov", "rating": "PG-13", "description": "Over six days in 1971, brilliant writer Sergei Dovlatov encounters maddening barriers to publishing his work under the repressive Soviet regime.\n"}, {"title": "Dr. Seuss' The Cat in the Hat", "rating": "PG", "description": "\n"}, {"title": "Dr. Seuss' The Grinch", "rating": "PG", "description": "A grump with a mean streak plots to bring Christmas to a halt in the cheerful town of Whoville. But a generous little girl could change his heart.\n"}, {"title": "Dr. Seuss' The Lorax", "rating": "PG", "description": "The forest-dwelling Lorax has to stop the short-sighted Once-ler from ruining the environment for profit in this adaptation of the Dr. Seuss classic.\n"}, {"title": "Dragonheart", "rating": "PG-13", "description": "In ancient times when majestic fire-breathers soared through the skies, a knight comes face to face and heart to heart with the last dragon on Earth.\n"}, {"title": "Dragonheart 3: The Sorcerer", "rating": "PG-13", "description": "When an aspiring knight crosses paths with a dragon, the two form an unlikely alliance in a high-stakes battle against a malicious sorcerer.\n"}, {"title": "Dragonheart: A New Beginning", "rating": "PG", "description": "This sequel introduces Draco the dragon's offspring, Drake, who dreams of becoming a knight and teams up with a stable boy to master his skills.\n"}, {"title": "Dragonheart: Battle for the Heartfire", "rating": "PG-13", "description": "When the king of Brittania dies, the dragon who shares his heart must find a new ruler, but the monarch's grandchildren go to war over the throne.\n"}, {"title": "Dragonheart: Vengeance", "rating": "PG-13", "description": "When his family is slain by vicious savages, a young farmer teams with an ice-breathing dragon and sword-wielding mercenary to avenge their deaths.\n"}, {"title": "Drunk Parents", "rating": "R", "description": "Two desperate parents go to extreme lengths to hide their dire financial straits from their daughter and friends.\n"}, {"title": "Duck Duck Goose", "rating": "PG", "description": "As his flock's annual migration nears, a carefree goose is grounded with an injury and takes a pair of lost ducklings under his wing.\n"}, {"title": "Dumb and Dumberer: When Harry Met Lloyd", "rating": "PG-13", "description": "This wacky prequel to the 1994 blockbuster goes back to the lame-brained title characters' days as classmates at a Rhode Island high school.\n"}, {"title": "Dumplin'", "rating": "PG-13", "description": "To prove a point about measuring up and fitting in, Texas teen Willowdean Dickson enters a local pageant run by her ex-beauty queen mom.\n"}, {"title": "Earth to Echo", "rating": "PG", "description": "When a construction project begins in their neighborhood, four friends start receiving bizarre encoded text messages on their cell phones.\n"}, {"title": "Earthquake Bird", "rating": "R", "description": "In 1980s Tokyo, an enigmatic expat is suspected of killing her friend, who's gone missing in the wake of their love triangle with a local photographer.\n"}, {"title": "East Side Sushi", "rating": "PG", "description": "She’s not the usual candidate for the role, but a dogged Mexican-American mother makes it her mission to become a talented sushi chef.\n"}, {"title": "Easy A", "rating": "PG-13", "description": "When a lie about Olive's reputation transforms her from anonymous to infamous at her high school, she decides to embrace a provocative new persona.\n"}, {"title": "Eat Pray Love", "rating": "PG-13", "description": "After deciding to reshape her life after divorce, Liz travels around the world in search of good food, spirituality and true love.\n"}, {"title": "Echo in the Canyon", "rating": "PG-13", "description": "An affectionate documentary looks back at the mid-1960s, when Hollywood’s Laurel Canyon was a creative nexus for young, innovative musicians.\n"}, {"title": "Eddie Murphy: Raw", "rating": "R", "description": "This stand-up comedy classic features Eddie Murphy live in a provocative series of impressions, observations and remembrances of his childhood.\n"}, {"title": "Effie Gray", "rating": "PG-13", "description": "Trapped in a loveless marriage, the young wife of Victorian-era art critic John Ruskin finds herself falling for an artist — and looking for a way out.\n"}, {"title": "El último testigo", "rating": "R", "description": "A security expert and ex-CIA agent living in Belgium must go on the run with his estranged teen daughter when they're both marked for assassination.\n"}, {"title": "Elizabeth Harvest", "rating": "R", "description": "When a young newlywed enters the one chamber in her husband’s mansion that’s off-limits, she faces the horrifying consequences of defying the rules.\n"}, {"title": "Elliot the Littlest Reindeer", "rating": "PG", "description": "When Blitzen suddenly retires, a miniature horse determined to join Santa's reindeer team faces fierce competition in the North Pole tryouts.\n"}, {"title": "Employee of the Month", "rating": "PG-13", "description": "Warehouse workers Vince and Zack compete in a full-on war to be named Employee of the Month and win a date with their dream girl.\n"}, {"title": "End of Watch", "rating": "R", "description": "Officers Taylor and Zavala patrol the streets of South Central Los Angeles, an area of the city ruled by gangs and riddled with drug violence.\n"}, {"title": "Enemy", "rating": "R", "description": "When a humdrum academic spots his double in a movie, he launches a search that leads him to a small-time actor who looks exactly like him.\n"}, {"title": "Enola Holmes", "rating": "PG-13", "description": "While searching for her missing mother, intrepid teen Enola Holmes uses her sleuthing skills to outsmart big brother Sherlock and help a runaway lord.\n"}, {"title": "Enter the Dragon", "rating": "R", "description": "Recruited by a British agent, Shaolin master Lee infiltrates a remote island and a brutal martial arts tournament to spy on a sinister crime lord.\n"}, {"title": "Enter the Warriors Gate", "rating": "PG-13", "description": "An avid gamer is magically transported to ancient China, where he must become a warrior in order to save the princess from an evil warlord.\n"}, {"title": "Equals", "rating": "PG-13", "description": "Two young lovers depart from the norm simply by having romantic feelings for each other in a society where humans have been relieved of all emotions.\n"}, {"title": "Equilibrium", "rating": "R", "description": "In a dystopian future, a totalitarian regime maintains peace by subduing the populace with a drug, and displays of emotion are punishable by death.\n"}, {"title": "Euphoria", "rating": "R", "description": "An entrepreneur prone to partying and his estranged brother, a teacher resigned to a humdrum life, begin to bond under fragile circumstances.\n"}, {"title": "Eurovision Song Contest: The Story of Fire Saga", "rating": "PG-13", "description": "Two small-town singers chase their pop star dreams at a global music competition, where high stakes, scheming rivals and onstage mishaps test their bond.\n"}, {"title": "Evan Almighty", "rating": "PG", "description": "God summons narcissistic Evan to build an ark in preparation for a flood. Meanwhile, Evan's family interprets his new hobby as a midlife crisis.\n"}, {"title": "Event Horizon", "rating": "R", "description": "After a signal is received from a long-missing spaceship, a rescue ship investigates, but the crew soon realizes something unimaginable has happened.\n"}, {"title": "Everybody Knows", "rating": "R", "description": "Journeying back to her small Spanish hometown for her sister's wedding, Laura must grapple with long-buried secrets when her daughter is abducted.\n"}, {"title": "Evolution", "rating": "PG-13", "description": "After two community college geology professors discover microscopic alien life-forms on a meteorite, the military and government become involved.\n"}, {"title": "Ex Machina", "rating": "R", "description": "A coder at a tech company wins a week-long retreat at the compound of his company's CEO, where he's tasked with testing a new artificial intelligence.\n"}, {"title": "Executive Decision", "rating": "R", "description": "When terrorists hijack a 747 and turn it into a nerve gas bomb aimed at Washington, D.C., commandos use an experimental plane to try to stop them.\n"}, {"title": "Exit Wounds", "rating": "R", "description": "Maverick cop Orin Boyd joins forces with an unlikely ally in gangster Latrell Walker to take down a group of dirty Detroit cops.\n"}, {"title": "Extraction", "rating": "R", "description": "A hardened mercenary's mission becomes a soul-searching race to survive when he's sent into Bangladesh to rescue a drug lord's kidnapped son.\n"}, {"title": "Extremely Wicked, Shockingly Evil and Vile\"", "rating": "R", "description": "Single mother Liz falls for Ted Bundy and refuses to believe the truth about his crimes for years. A drama based on a true story.\n"}, {"title": "Faith, Hope & Love\"", "rating": "PG", "description": "After shattering losses, a recent divorcée and a heartbroken widower restore their lives when they partner for a dance competition to save her studio.\n"}, {"title": "Fallen", "rating": "R", "description": "A tough homicide cop faces his most dangerous assignment when he must stop a murderous evil spirit who can move from one host to the next.\n"}, {"title": "Father Soldier Son", "rating": "R", "description": "After a single father is severely wounded in Afghanistan, he and his sons embark on a journey of sacrifice and a search for redemption.\n"}, {"title": "Fear and Loathing in Las Vegas", "rating": "R", "description": "A sportswriter and his Samoan lawyer embark on a hallucinogenic three-day romp from Los Angeles to Las Vegas in this counterculture cult favorite.\n"}, {"title": "Ferris Bueller's Day Off", "rating": "PG-13", "description": "Ferris convinces his entire school he's at death's door, then hits the streets of Chicago with his girlfriend and best friend for a day of fun.\n"}, {"title": "Fiddler on the Roof", "rating": "G", "description": "This adaptation of the musical chronicles the trials of a Jewish peasant, his wife, and their three strong-willed daughters in pre-revolutionary Russia.\n"}, {"title": "Final Destination", "rating": "R", "description": "After narrowly avoiding a fatal plane explosion, a group of seemingly lucky teen classmates finds that Death is not so easily cheated.\n"}, {"title": "Final Destination 2", "rating": "R", "description": "On a road trip with friends, Kimberly has a premonition that saves everyone from a freak accident. More terrifying visions prompt her to seek help.\n"}, {"title": "Final Destination 3", "rating": "R", "description": "When a girl prevents her premonition of a deadly roller-coaster mishap from coming true, the survivors must face the consequences of cheating death.\n"}, {"title": "First Kill", "rating": "R", "description": "A stock broker brings his young son back to the town where he grew up for a hunting trip, but things take a dangerous turn when they witness a crime.\n"}, {"title": "Fisherman's Friends", "rating": "PG-13", "description": "Sea shanties have long united 10 Cornish fishermen, but when their chants sail to the music charts, their friendship is kept at bay.\n"}, {"title": "Five Elements Ninjas", "rating": "R", "description": "When five ninjas whose fighting styles are based on natural elements unleash their fury on a rival school, a lone survivor vows deadly revenge.\n"}, {"title": "Flash of Genius", "rating": "PG-13", "description": "A college professor goes up against the giants of the auto industry when they fail to give him credit for inventing intermittent windshield wipers.\n"}, {"title": "Footprints: The Path of Your Life", "rating": "PG", "description": "This documentary follows 10 men who agree to walk the Camino de Santiago, a 500-mile, 40-day trek that will challenge their strength and faith.\n"}, {"title": "For Colored Girls", "rating": "R", "description": "This adaptation of Ntozake Shange's play consists of a series of poetic vignettes that explore the lives of modern African American women.\n"}, {"title": "For Greater Glory", "rating": "R", "description": "When a vicious war against Catholics is waged in Mexico in the 1920s, a retired general joins the militia fighting to preserve religious freedom.\n"}, {"title": "For the Love of Benji", "rating": "G", "description": "Benji and his owner get separated in Greece. On his quest to find them, he's targeted by various bad guys who want to get their hands on him.\n"}, {"title": "Forbidden Planet", "rating": "G", "description": "A pulp-fiction sci-fi classic, Forbidden Planet stars Leslie Nielsen as a heroic starship captain who finds the paradise planet Altair-IV.\n"}, {"title": "Forks Over Knives", "rating": "PG", "description": "According to the research of two food scientists, the popularity of processed foods has led to epidemic rates of obesity, diabetes and other diseases.\n"}, {"title": "Four Christmases", "rating": "PG-13", "description": "A dating couple is forced to spend their first Christmas together visiting each of their four divorced parents – in a single day.\n"}, {"title": "Four Weddings and a Funeral", "rating": "R", "description": "A commitment-phobic Brit tries to reconnect with an alluring American who's about to make a seemingly awful mistake by marrying a wealthy, boring man.\n"}, {"title": "Fracture", "rating": "R", "description": "Ted Crawford, who allegedly attempted to murder his wife, is now locked in a battle of wits with a young assistant district attorney.\n"}, {"title": "Frances Ha", "rating": "R", "description": "Determined to make it as a modern dancer in New York, a young woman pursues her unlikely goal with more enthusiasm than natural talent.\n"}, {"title": "Freaks", "rating": "R", "description": "Hidden away by her eccentric father, a mysterious young girl uncovers frightening truths when she starts to make contact with the outside world.\n"}, {"title": "Fred Claus", "rating": "PG", "description": "The holiday season is ruined for Santa Claus when his cranky older brother – a repo man with a sizable rap sheet – visits him at the North Pole.\n"}, {"title": "Free Fire", "rating": "R", "description": "A sketchy arms transaction in a deserted warehouse turns into a free-for-all when the two sides engage in a take-no-prisoners shootout.\n"}, {"title": "Free State of Jones", "rating": "R", "description": "A Mississippi farmer turns outlaw as he leads a ragtag band of fellow Civil War deserters and escaped slaves in a rebellion against the Confederacy.\n"}, {"title": "Free Willy", "rating": "PG", "description": "Ordered to clean up the graffiti he painted at a marine theme park, a troubled young boy unexpectedly bonds with a killer whale on exhibit.\n"}, {"title": "Freeway: Crack in the System", "rating": "R", "description": " Rick Ross's empire and how the CIA helped him fuel America's  devastating crack cocaine epidemic.\n"}, {"title": "Friday the 13th", "rating": "R", "description": "A group of teenage camp counselors raises the ire of Jason Voorhees, a masked, homicidal maniac, in this remake of the classic slasher flick.\n"}, {"title": "Friend Request", "rating": "R", "description": "A popular college student's love of social media becomes her biggest regret when a mysterious account marks each of her friends for a grisly demise.\n"}, {"title": "From Paris with Love", "rating": "R", "description": "A low-level intelligence agent gets pulled into action and espionage above his pay grade when he's ordered to assist a trigger-happy senior agent.\n"}, {"title": "Froning: The Fittest Man in History", "rating": "PG", "description": "Follow the grueling training regimen of Rich Froning Jr. as he sets his sights on winning an unprecedented fourth CrossFit Games title.\n"}, {"title": "Frozen River", "rating": "R", "description": "On a Mohawk reservation on the Canadian border, Ray Eddy teams with a widowed tribe member to smuggle illegal immigrants into the United States.\n"}, {"title": "Fruitvale Station", "rating": "R", "description": "This dramatic rendering of a real-life tragedy recounts the final hours of Oscar Grant, shot by San Francisco transit police on New Year's Day, 2009.\n"}, {"title": "Fun Mom Dinner", "rating": "R", "description": "Four preschool moms with little in common need a night out to take a break from their kids. But one thing leads to another, and things get rowdy.\n"}, {"title": "G-Force", "rating": "PG", "description": "When a billionaire sets out to take over the world, only one special forces unit can handle the job – a squad of highly trained guinea pigs.\n"}, {"title": "Gangs of New York", "rating": "R", "description": "In the crime-ridden slums of New York in the 1860s, vengeful orphan Amsterdam Vallon joins the cutthroat gang of his father's killer, Bill the Butcher.\n"}, {"title": "Garfield's Pet Force", "rating": "G", "description": "When an alien menace and her army of undead minions threaten to enslave the world, Garfield heads a team of comic-strip superheroes to save the day.\n"}, {"title": "Generation Iron 2", "rating": "PG-13", "description": "New-generation bodybuilding stars – including Rich Piana, Kai Greene and Calum von Moger – share their experiences competing in the demanding sport.\n"}, {"title": "George of the Jungle 2", "rating": "PG", "description": "Now married and raising a son, clumsy ape-man George finds his jungle kingdom in peril as Really Mean Lion challenges him for the throne.\n"}, {"title": "Get Him to the Greek", "rating": "R", "description": "Ambitious young record company intern Aaron must escort an unruly rock star to Los Angeles for the start of his anniversary concert.\n"}, {"title": "Get Santa", "rating": "PG", "description": "When Santa gets arrested for trespassing after crashing his sleigh, it's up to a father-son team to spring him from jail and save Christmas.\n"}, {"title": "Get Smart", "rating": "PG-13", "description": "When the identities of secret agents are compromised, hapless Maxwell Smart teams with far more capable Agent 99 to thwart an evil terrorist group.\n"}, {"title": "Getting Played", "rating": "PG-13", "description": "Tired of dealing with boyfriends who wrong them, gal pals Lauren, Emily and Andrea decide to turn the tables and become the players themselves.\n"}, {"title": "Ghost Rider", "rating": "PG-13", "description": "After selling his soul to save a loved one, daredevil biker Johnny Blaze pays the price by becoming a flame-skulled bounty hunter for Mephistopheles.\n"}, {"title": "Ghost of the Mountains", "rating": "G", "description": "An international group of filmmakers sets out on a mission to get up close and personal with a family of elusive snow leopards.\n"}, {"title": "Ghosts of War", "rating": "R", "description": "Five, battle-worn Allied soldiers guarding a chateau previously occupied by Nazis start experiencing unexplained and terrifying supernatural horrors.\n"}, {"title": "Gigi", "rating": "G", "description": "Gigi's an avant-garde French waif being groomed as the fille de joie of affluent and handsome Gaston. Soon Gigi metamorphoses into a stunning beauty.\n"}, {"title": "Gimme Shelter", "rating": "PG-13", "description": "After running away from her abusive mother, a streetwise teen seeks refuge with her father, but he rejects her when he learns that she's pregnant.\n"}, {"title": "Ginger & Rosa", "rating": "PG-13", "description": "With the Cold War looming over them, teen best pals Ginger and Rosa share everything in early 1960s London – until betrayal drives them apart.\n"}, {"title": "Girl", "rating": "R", "description": "Fifteen-year-old ballet dancer Lara faces physical and emotional hurdles as she prepares for gender confirmation surgery. Inspired by a true story.\n"}, {"title": "Giving Voice", "rating": "PG-13", "description": "Six ambitious student actors audition for the prestigious August Wilson Monologue Competition, culminating in a riveting final round on Broadway.\n"}, {"title": "Gnome Alone", "rating": "PG", "description": "After moving into a new house with her mom, high schooler Chloe discovers a troupe of talking garden gnomes who need her help saving the world.\n"}, {"title": "God Bless the Broken Road", "rating": "PG", "description": "After a young mother is widowed by war, her faith is tested as she struggles to stay afloat financially and raise her daughter.\n"}, {"title": "God's Not Dead", "rating": "PG", "description": "A spiritual college student clashes with an atheistic professor who insists that students will only pass his class by admitting that God is dead.\n"}, {"title": "God's Not Dead: A Light in Darkness", "rating": "PG", "description": "After a fire breaks out at his church, a pastor faces a legal battle against university leaders who wish to push the congregation off the campus.\n"}, {"title": "GoldenEye", "rating": "PG-13", "description": "Pierce Brosnan takes his first turn as debonair secret agent James Bond, who investigates the destruction of a Russian satellite weapons base.\n"}, {"title": "Goldstone", "rating": "R", "description": "In the Australian outback, an Indigenous cop on a missing persons case unearths a trafficking ring and runs afoul of political-industrial interests.\n"}, {"title": "Gone are the Days", "rating": "R", "description": "As a notorious outlaw comes to grips with his past, he reconnects with his estranged daughter and gets one more shot to make things right.\n"}, {"title": "Good Burger", "rating": "PG", "description": "Working at a neighborhood fast-food joint, two teens try to save the restaurant when a giant burger franchise fires up the competition.\n"}, {"title": "Good Hair", "rating": "PG-13", "description": "Chris Rock hops around the world going from beauty salons to science labs to comb through the mystery of Black hair.\n"}, {"title": "Good Kids", "rating": "R", "description": "Four overachieving friends spend the summer after finishing high school doing everything possible to enjoy the party life and ruin their reputations.\n"}, {"title": "Good Kill", "rating": "R", "description": "As Tommy Egan pilots armed drones over Afghanistan from the safe comfort of Las Vegas, the remote nature of his work begins to raise moral questions.\n"}, {"title": "Good Night, and Good Luck\"", "rating": "PG", "description": "Veteran television newsman Edward R. Murrow faces off against Sen. Joseph McCarthy and his crusade to quell the threat of communism in America.\n"}, {"title": "Good People", "rating": "R", "description": "A struggling couple can't believe their luck when they find a stash of money in the apartment of a neighbor who was recently murdered.\n"}, {"title": "Good Time", "rating": "R", "description": "After spearheading an ill-fated bank robbery, a man must get his mentally challenged younger brother out of jail while eluding his own capture.\n"}, {"title": "GoodFellas", "rating": "R", "description": "Former mobster Henry Hill recounts his colorful yet violent rise and fall in a New York crime family – a high-rolling dream turned paranoid nightmare.\n"}, {"title": "Goon", "rating": "R", "description": "When he's seen dispatching a rude opposing hockey player in the stands, Doug Glatt is hired by a rival team ... for his fighting skills.\n"}, {"title": "Goon: Last of the Enforcers", "rating": "R", "description": "Injury and family push hockey player Doug Glatt into retirement, but his plans change when his beloved former team appoints his nemesis as captain.\n"}, {"title": "Goosebumps 2: Haunted Halloween", "rating": "PG", "description": " novels to life.\n"}, {"title": "Gosford Park", "rating": "R", "description": "In this witty whodunit, wealthy guests and their servants gather for a weekend stay at the home of Sir William McCordle, who is soon found murdered.\n"}, {"title": "Gothika", "rating": "R", "description": "After a car crash, a criminal psychiatrist awakens to find that she's a patient in the same mental institution that currently employs her.\n"}, {"title": "Gran Torino", "rating": "R", "description": "A newly widowed Korean War veteran faces his racism and his past when the son of the Hmong family next door tries to steal his beloved 1972 Gran Torino.\n"}, {"title": "Grand-Daddy Day Care", "rating": "PG-13", "description": "A frustrated novelist with money problems opens an unsanctioned senior center at his house to make quick cash and occupy his cumbersome father-in-law.\n"}, {"title": "Grease", "rating": "PG", "description": "John Travolta and Olivia Newton-John star in this hit musical comedy about a greaser and the good girl he falls for – much to his friends' chagrin.\n"}, {"title": "Greater", "rating": "PG", "description": "Faith and determination transform a talentless football player at the University of Arkansas into an All-American in this inspiring true story.\n"}, {"title": "Green Room", "rating": "R", "description": "At the end of their low-budget tour, a punk band accepts a gig at an isolated rural club, only to discover that their hosts are neo-Nazis.\n"}, {"title": "Gridlocked", "rating": "R", "description": "An embittered cop is tasked with baby-sitting a spoiled actor, but the two must learn to fight together when they run afoul of a group of mercenaries.\n"}, {"title": "Grizzlies", "rating": "R", "description": "A group of disaffected students form an unlikely bond through the game of lacrosse when a new teacher introduces the sport to their remote Arctic town.\n"}, {"title": "Growing Up Wild", "rating": "G", "description": "Five baby animals from different parts of the world grow up learning to survive in the wild, nurtured by the love and guidance of their families.\n"}, {"title": "Guest House", "rating": "R", "description": "The only downside to a young couple’s new dream home — and fresh start — is the nightmare of the raucous houseguest in back who refuses to leave.\n"}, {"title": "HALO Legends", "rating": "PG-13", "description": "This anthology features seven independent anime shorts from renowned directors, delving into the futuristic universe of the video game franchise Halo.\n"}, {"title": "Hail, Caesar!\"", "rating": "PG-13", "description": "When a major star is kidnapped from a movie set, a hard-charging but overwhelmed studio boss sets out to find the actor and save the film.\n"}, {"title": "Hairspray", "rating": "PG", "description": "In 1962, ambitious plus-size teen Tracy Turnblad tries to integrate a racially divided Baltimore one Watusi at a time.\n"}, {"title": "Hamburger Hill", "rating": "R", "description": "The Vietnam War's horrors come brutally to life through the eyes of American soldiers trying to take a heavily fortified hill under Vietcong control.\n"}, {"title": "Hangman", "rating": "R", "description": "A homicide detective, a criminal profiler and a journalist team up to nab a serial killer whose murders are inspired by the classic game of Hangman.\n"}, {"title": "Happy as Lazzaro", "rating": "PG-13", "description": "Purehearted teen Lazzaro is content living as a sharecropper in rural Italy, but an unlikely friendship with the marquise's son will change his world.\n"}, {"title": "Hard Kill", "rating": "R", "description": "When a billionaire hires a team of mercenaries for protection, they soon realize world-changing technology and his daughter’s life are also at stake.\n"}, {"title": "Hardcore Henry", "rating": "R", "description": "Shot entirely like a first-person shooter video game, this film tracks Henry, a cyborg racing to save his wife from a villain with paranormal powers.\n"}, {"title": "Harold & Kumar Escape from Guantanamo Bay", "rating": "R", "description": "Harold and Kumar jump on a plane to catch up with Harold's love interest but must change their plans when Kumar is accused of being a terrorist.\n"}, {"title": "Harold & Kumar Go to White Castle", "rating": "R", "description": "Buddies Harold and Kumar set out to satisfy a stoner craving for hamburgers but end up on an epic journey when they can't find White Castle.\n"}, {"title": "Haywire", "rating": "R", "description": "A last-minute mission in Dublin turns deadly for stunning secret operative Mallory Kane when she realizes she's been betrayed.\n"}, {"title": "He Named Me Malala", "rating": "PG-13", "description": "This documentary tells the story of a teenage Pakistani girl shot for her advocacy of women's education, her survival, and her continued efforts.\n"}, {"title": "He Never Died", "rating": "R", "description": "A reclusive immortal who needs human flesh but tries to stay clean finds himself cast back into society by a gang of thugs and his estranged daughter.\n"}, {"title": "He's Out There", "rating": "R", "description": "While vacationing at a remote lake house, a mother and her daughters become pawns in the twisted game of an ax-wielding psychopath.\n"}, {"title": "Heartbreakers", "rating": "PG-13", "description": "In this stylish comedy, a mother-daughter con team makes money the old-fashioned way: They use their feminine wiles to swindle it.\n"}, {"title": "Hedgehogs", "rating": "PG", "description": "When a hedgehog suffering from memory loss forgets his identity, he ends up on a big city journey with a pigeon to save his habitat from a human threat.\n"}, {"title": "Hell and Back", "rating": "R", "description": "When best friends break a blood oath, one of them is cast away to hell, and the other two must save him from the misfits of the underworld.\n"}, {"title": "Hell or High Water", "rating": "R", "description": "In a desperate bid to save their family ranch, two brothers stage a series of clever bank robberies with a pair of Texas Rangers in hot pursuit.\n"}, {"title": "Hellboy", "rating": "PG-13", "description": "This fast-paced action flick tells the dark story of Hellboy, a charismatic demon who's put on Earth by the Nazis to terrorize the rest of the world.\n"}, {"title": "Heneral Luna", "rating": "R", "description": "Flashbacks reveal Gen. Antonio Luna's tireless fight for Filipino independence from the U.S. and his leadership in the Philippine-American War in 1899.\n"}, {"title": "Her", "rating": "R", "description": "Love comes to a lonely writer in the sleekest of packages when he finds himself falling for the advanced operating system he bought to run his life.\n"}, {"title": "Hillbilly Elegy", "rating": "R", "description": "An urgent phone call pulls a Yale Law student back to his Ohio hometown, where he reflects on three generations of family history and his own future.\n"}, {"title": "Hit & Run", "rating": "R", "description": "Determined to get his fiancée to L.A. to take advantage of an amazing opportunity, Charlie breaks out of the witness protection program to drive her.\n"}, {"title": "Hitch", "rating": "PG-13", "description": "Smooth and sexy Hitch helps clients make a great first impression on a date, but he's thrown when a lovely reporter starts nosing around his business.\n"}, {"title": "Holly Star", "rating": "PG", "description": "Home for the holidays, a broke puppeteer knows there’s treasure buried somewhere under her town. To find it, all she has to do is die – almost.\n"}, {"title": "Honey 2", "rating": "PG-13", "description": "Determined to prove herself as a street dancer, Maria heads from juvie to a Bronx rec center where she's introduced to her dance idol, Honey Daniels.\n"}, {"title": "Honey: Rise Up and Dance", "rating": "PG-13", "description": "Despite discouragement from her loved ones, a talented street dancer tries out for an exclusive dance crew in a bid to win a college scholarship.\n"}, {"title": "Hoodwinked Too! Hood vs. Evil", "rating": "PG", "description": "Fresh off a top-secret training, feisty heroine Little Red teams up with intrepid reporter Wolf to investigate the disappearance of Hansel and Gretel.\n"}, {"title": "Hook", "rating": "PG", "description": "Peter Pan, now grown up and a workaholic, must return to Neverland to save his kids from the clutches of vengeful pirate Captain Hook.\n"}, {"title": "Hop", "rating": "PG", "description": "A jobless slacker finds himself beyond busy after he runs over the Easter Bunny and has to take over the rabbit's duties so the holiday can continue.\n"}, {"title": "Hope Springs Eternal", "rating": "PG", "description": "When a teen with terminal cancer miraculously finds herself in remission, she struggles to give up the attention her illness gave her at school.\n"}, {"title": "Horns", "rating": "R", "description": "Accused of murder, Ig Perish wakes up one day to find he's grown a set of horns – compelling people to confess their sins to him.\n"}, {"title": "Horse Girl", "rating": "R", "description": "A sweet misfit with a fondness for crafts, horses and supernatural crime shows finds her increasingly lucid dreams trickling into her waking life.\n"}, {"title": "Hostiles", "rating": "R", "description": "After a long career battling the Cheyenne, a U.S. Army captain is ordered to safely escort the tribe's most influential chief to his Montana homeland.\n"}, {"title": "Hot Rod", "rating": "PG-13", "description": "Andy Samberg stars in this comedy as an accident-prone daredevil who's determined to jump 15 buses on his moped and impress his abusive stepfather.\n"}, {"title": "Hotel Transylvania 3: Summer Vacation", "rating": "PG", "description": "It's love at first sight for Dracula when he meets Ericka, the charming but mysterious captain of the monster cruise that Mavis plans for the family.\n"}, {"title": "Hotel for Dogs", "rating": "PG", "description": "Placed in a foster home that doesn't allow pets, 16-year-old Andi and her younger brother Bruce turn an abandoned hotel into a home for their dog.\n"}, {"title": "House at the End of the Street", "rating": "PG-13", "description": "Moving to a new town proves even more stressful for a teenager when she learns that the house next door was the site of a double murder.\n"}, {"title": "How the Grinch Stole Christmas", "rating": "PG", "description": "The Grinch decides to rob Whoville of Christmas – but a dash of kindness from little Cindy Lou Who and her family may be enough to melt his heart.\n"}, {"title": "How to Be a Latin Lover", "rating": "PG-13", "description": "When an aging Lothario gets the boot from his sugar mama, he must pull out all the stops to find a new female sponsor.\n"}, {"title": "How to Be a Player", "rating": "R", "description": "Dray lives life one woman at a time and is the envy of all his friends, until his sister decides to show him the error of his philandering ways.\n"}, {"title": "How to Make an American Quilt", "rating": "PG-13", "description": "A conflicted young woman spends the summer with her grandmother, her great-aunt and their quilting circle, whose life stories captivate her.\n"}, {"title": "How to Train Your Dragon 2", "rating": "PG", "description": "Hiccup, Toothless and a mysterious dragon rider join forces to protect the island of Berk from a power-hungry warrior with a dragon army of his own.\n"}, {"title": "Howards End", "rating": "PG", "description": " does not accept his wife's deathbed wish, providence dictates that he pay for his duplicity.\n"}, {"title": "Hubie Halloween", "rating": "PG-13", "description": "Hubie's not the most popular guy in Salem, Mass., but when Halloween turns truly spooky, this good-hearted scaredy-cat sets out to keep his town safe.\n"}, {"title": "Hugo", "rating": "PG", "description": "Living inside a Paris train station, an orphan eludes the rigid stationmaster, meets a legendary filmmaker and finds the key to unlocking his destiny.\n"}, {"title": "Hulk Vs.", "rating": "PG-13", "description": "This action-packed animated double feature pits the Hulk against two of the Marvel Universe's most powerful characters: Wolverine and Thor.\n"}, {"title": "Hunt for the Wilderpeople", "rating": "PG-13", "description": "A misadventure in the wilderness leads to life-changing discoveries for a troubled orphan teen from the city and his belligerent foster father.\n"}, {"title": "Hunt to Kill", "rating": "R", "description": "U.S. Border Patrol agent and deadly hunter Jim Rhodes takes violent revenge when a group of desperate thieves kidnaps his daughter after a robbery.\n"}, {"title": "Hunter's Prayer", "rating": "R", "description": "A hired gun has second thoughts when he's contracted to kill a teenage girl whose father's shady business dealings put her life in danger.\n"}, {"title": "Hush", "rating": "R", "description": "A deaf writer who retreated into the woods to live a solitary life must fight for her life in silence when a masked killer appears in her window.\n"}, {"title": "Hustle & Flow", "rating": "R", "description": "A pimp with aspirations of grandeur wants to make it as a rapper but discovers that fame isn't all it's cracked up to be in this indie drama.\n"}, {"title": "I Am Bolt", "rating": "PG", "description": "Mixing archival footage with present-day interviews, Olympic champion and global icon Usain Bolt opens up about his athletic legacy.\n"}, {"title": "I Am Not Your Negro", "rating": "PG-13", "description": "Based on James Baldwin's unfinished book, this visual essay explores racism through the stories of Medgar Evers, Malcolm X and Martin Luther King Jr.\n"}, {"title": "I Am Vengeance", "rating": "R", "description": "After learning that an ex-military friend and his parents were killed, the highly trained John Gold comes to town seeking answers and revenge.\n"}, {"title": "I Am Vengeance: Retaliation", "rating": "R", "description": "To clear his criminal record, an ex-special forces soldier agrees to lead a team to retrieve a double-crossing mercenary and deliver him to justice.\n"}, {"title": "I Am Wrath", "rating": "R", "description": "Hell-bent on avenging his wife's murder, Stanley Hill summons an old partner's help in exposing a cover-up by crooked cops and slimy politicians.\n"}, {"title": "I Don't Know How She Does It", "rating": "PG-13", "description": "In this affable yuppie comedy, Kate Reddy is a successful executive, wife and mom whose personal and professional lives hang in precarious balance.\n"}, {"title": "I'll See You in My Dreams", "rating": "PG-13", "description": "After the passing of her dog, a long-widowed senior citizen is in need of companionship. Two very different possibilities present themselves.\n"}, {"title": "I'm Thinking of Ending Things", "rating": "R", "description": "Nothing is as it seems when a woman experiencing misgivings about her new boyfriend joins him on a road trip to meet his parents at their remote farm.\n"}, {"title": "I'm in Love with a Church Girl", "rating": "PG", "description": "When a tough-minded ex-drug dealer falls for a beautiful but highly devout woman, their mutual attraction takes them both down a twisty path.\n"}, {"title": "I, Daniel Blake\"", "rating": "R", "description": "While fighting for his welfare benefits following a job-ending heart attack, a widowed carpenter befriends a single mother in a similar plight.\n"}, {"title": "Iceman", "rating": "R", "description": "Four hundred years after they were frozen in time, a Ming Dynasty guard and his three pursuers are defrosted to continue their ancient battle.\n"}, {"title": "If Anything Happens I Love You", "rating": "PG", "description": "Grieving parents journey through an emotional void as they mourn the loss of a child in the aftermath of a tragic school shooting.\n"}, {"title": "Igor", "rating": "PG", "description": "Igor, the brilliant but deformed assistant to mad Dr. Glickenstein, dreams of winning the Evil Science Fair and the heart of village beauty Gretchen.\n"}, {"title": "Imagine That", "rating": "PG", "description": "Work problems are piling up for a businessman. But when he discovers a pathway to his daughter's imaginary world, he starts finding some solutions.\n"}, {"title": "In Search of Fellini", "rating": "R", "description": "A naive and sheltered young woman embarks on a whimsical adventure across Italy in the hopes of meeting director Federico Fellini.\n"}, {"title": "In The Deep", "rating": "PG-13", "description": "With little oxygen left in their scuba tanks, two sisters are trapped in a shark cage at the bottom of the ocean while great whites circle nearby.\n"}, {"title": "In This Corner of the World", "rating": "PG-13", "description": "Suzu marries into a family living outside of Hiroshima and quickly settles into her new life, until World War II challenges her ability to survive.\n"}, {"title": "In a Valley of Violence", "rating": "R", "description": "After a quiet drifter is met with violence and bullying in a small town, he finds himself enmeshed in a vengeful struggle with the local marshal.\n"}, {"title": "Incarnate", "rating": "PG-13", "description": "An unconventional demon hunter faces his greatest challenge when he steps inside the subconscious mind of a boy possessed by a powerful entity.\n"}, {"title": "Inception", "rating": "PG-13", "description": "In this mind-bending sci-fi thriller, a man runs an espionage business built around entering the subconscious of his targets to mold their thoughts.\n"}, {"title": "Inconceivable", "rating": "R", "description": "A couple trying to conceive invite a woman with a mysterious past to move in with them. But it's an invitation they might come to regret.\n"}, {"title": "Incredibles 2 (Spanish Version)", "rating": "PG", "description": "When Elastigirl gets recruited for a high-profile crime-fighting mission, Mr. Incredible takes on his toughest assignment ever: full-time parenting.\n"}, {"title": "Indiana Jones and the Kingdom of the Crystal Skull", "rating": "PG-13", "description": "Indiana Jones is drawn into a Russian plot to unearth the Crystal Skulls of Akator, Amazonian artifacts with supernatural powers.\n"}, {"title": "Indiana Jones and the Last Crusade", "rating": "PG-13", "description": "Accompanied by his father, Indiana Jones sets off on his third adventure to explore the cradle of civilization on a perilous hunt for the Holy Grail.\n"}, {"title": "Indiana Jones and the Raiders of the Lost Ark", "rating": "PG", "description": "When Indiana Jones is hired by the government to locate the legendary Ark of the Covenant, he finds himself up against the entire Nazi regime.\n"}, {"title": "Indiana Jones and the Temple of Doom", "rating": "PG", "description": "Indiana Jones, his young sidekick and a spoiled songbird get more than they bargained for when they go to India in search of a missing magical stone.\n"}, {"title": "Inequality for All", "rating": "PG", "description": "Former U.S. Labor Secretary Robert Reich makes a compelling case about the serious crisis the U.S. faces due to the widening economic gap.\n"}, {"title": "Inglourious Basterds", "rating": "R", "description": "A Jewish cinema owner in occupied Paris is forced to host a Nazi premiere, where a group of American soldiers called the Basterds plans a face-off.\n"}, {"title": "Inkheart", "rating": "PG", "description": "Unbeknownst to his 12-year-old daughter, a bookbinder has a secret ability to bring characters to life by reading their stories out loud.\n"}, {"title": "Inside Man: Most Wanted", "rating": "R", "description": "A hotshot NYPD negotiator butts heads with the FBI and meets his match in a meticulous criminal mastermind as she attempts to rob the Federal Reserve.\n"}, {"title": "Insidious", "rating": "PG-13", "description": "Hoping to leave their haunted house behind, a suburban family moves to a new place, only to learn the home wasn't haunted... but their eldest son is.\n"}, {"title": "Instructions Not Included", "rating": "PG-13", "description": "Unable to locate the elusive mother of a baby girl left on his doorstep, an Acapulco playboy unexpectedly begins to develop feelings for the tot.\n"}, {"title": "Into the Forest", "rating": "R", "description": "In the near future, two frightened sisters fight for survival after losing their father during a deadly, quietly looming apocalypse.\n"}, {"title": "Into the Wild", "rating": "R", "description": "A young man gives up everything – including his trust fund and ties to a seemingly stable family – to lead a solitary life in the wild.\n"}, {"title": "Invictus", "rating": "PG-13", "description": "After the end of apartheid, newly elected President Nelson Mandela uses the 1995 World Cup rugby matches to unite his people in South Africa.\n"}, {"title": "Ip Man", "rating": "R", "description": "An occupying Japanese general challenges Chinese men to duels to prove the superiority of the Japanese, but Ip Man refuses to fight – at first.\n"}, {"title": "Ip Man 2", "rating": "R", "description": "New in Hong Kong, martial arts instructor Ip Man perseveres and retaliates against his rivals' opposition to the Wing Chun fighting style he teaches.\n"}, {"title": "Ip Man 3", "rating": "PG-13", "description": "Martial arts master Ip springs into action when his son's school is threatened by a shady American, then defends his status as wing chun champion.\n"}, {"title": "Iron Man & Captain America: Heroes United", "rating": "PG", "description": "While battling to keep the Red Skull and Taskmaster from unleashing a Hydra army, Iron Man and Captain America must learn to work together.\n"}, {"title": "It Comes at Night", "rating": "R", "description": "As danger stalks the world outside his isolated home, an overprotective father faces a tough decision when another family shows up seeking help.\n"}, {"title": "It Takes Two", "rating": "PG", "description": " playing identical 9-year-olds from very different backgrounds: orphaned Amanda and wealthy Alyssa.\n"}, {"title": "Jack and the Cuckoo-Clock Heart", "rating": "PG", "description": "Equipped with a mechanical heart and determined to stay out of death's shadow, young Jack understands that love could prove fatal.\n"}, {"title": "Jackie Brown", "rating": "R", "description": "When an aging flight attendant's caught smuggling cash and forced to help with an investigation, she hatches a clever plan to make off with the dough.\n"}, {"title": "Jacob's Ladder", "rating": "R", "description": "After being reunited with a brother he thought was killed in combat, a former army medic begins to experience violent, paranoid visions.\n"}, {"title": "Jarhead: Law of Return", "rating": "R", "description": "When a U.S. senator’s son is held captive by Hezbollah militiamen, a group of highly trained soldiers ventures into enemy territory to bring him home.\n"}, {"title": "Jay and Silent Bob Strike Back", "rating": "R", "description": "Jay and Silent Bob's comic book alter egos have been sold to Hollywood without permission, so they head to Tinseltown to sabotage the production.\n"}, {"title": "Jem and the Holograms", "rating": "PG", "description": "After becoming an overnight star via the internet, teenage rocker Jem and her sisters journey to LA, where fame, fun and a family mystery await.\n"}, {"title": "Jeremiah Tower: The Last Magnificent", "rating": "R", "description": "This documentary profiles influential chef Jeremiah Tower, who played a pivotal role in the invention of a revolutionary new American cuisine.\n"}, {"title": "Jeremy Scott: The People's Designer", "rating": "PG-13", "description": "The journey of fashion designer Jeremy Scott from humble roots on a Missouri farm to creative director of Moschino is charted in this documentary.\n"}, {"title": "Jerry Seinfeld: Comedian", "rating": "R", "description": "Christian Charles's documentary follows established comedian Jerry Seinfeld and up-and-comer Orny Adams as they navigate the stand-up circuit.\n"}, {"title": "Jersey Boys", "rating": "R", "description": "Adapted from the hit Broadway musical, this nostalgic look at the Four Seasons and their bumpy offstage lives stretches across four decades.\n"}, {"title": "Jimi Hendrix", "rating": "R", "description": "Jimi Hendrix's family, friends, and fellow musicians discuss his life and influence. Hendrix also appears in classic performance footage.\n"}, {"title": "Jimmy Neutron: Boy Genius", "rating": "G", "description": "When gooey green aliens kidnap all the adults in Retroville, it's up to 11-year-old Jimmy Neutron to come up with a plan to rescue them.\n"}, {"title": "Jingle Jangle: A Christmas Journey", "rating": "PG", "description": "Decades after his trusted apprentice betrayed him, a once-joyful toymaker finds new hope when his kind and curious granddaughter comes into his life.\n"}, {"title": "Jiro Dreams of Sushi", "rating": "PG", "description": "This documentary profiles sushi chef Jiro Ono, an 85-year-old master whose 10-seat, $300-a-plate restaurant is legendary among Tokyo foodies.\n"}, {"title": "John Carter", "rating": "PG-13", "description": "One minute, Civil War veteran John Carter is evading Apaches; the next, he's waking up on Mars, a once-fruitful planet that's devolved into chaos.\n"}, {"title": "John Henry", "rating": "R", "description": "A reformed LA gang member upends his peaceful new life when he steps in to protect two young immigrants from his violent former leader.\n"}, {"title": "Judy Moody and the Not Bummer Summer", "rating": "PG", "description": "In this family film, never-dull third-grader Judy Moody embarks on a summer adventure with her brother, Stink, and always-up-for-fun Aunt Opal.\n"}, {"title": "Julie & Julia", "rating": "PG-13", "description": "In this heartwarming tale, Julie Powell decides to spice up her uneventful life by cooking all 524 recipes outlined in Julia Child's classic cookbook.\n"}, {"title": "Jumping the Broom", "rating": "PG-13", "description": " at the bride's family estate on Martha's Vineyard, where their relations meet — and clash.\n"}, {"title": "Junebug", "rating": "R", "description": "When a big-city art dealer travels to North Carolina to meet her new husband's small-town family, their trip gives rise to a multitude of problems.\n"}, {"title": "Jupiter Ascending", "rating": "PG-13", "description": "A young impoverished woman learns she's been predestined to change the fate of the universe after a genetically engineered hunter tracks her down.\n"}, {"title": "Just Friends", "rating": "PG-13", "description": "Years after high school, a once-portly nice guy comes home for the holidays and reunites with a former crush he still has feelings for.\n"}, {"title": "Justice", "rating": "R", "description": "A U.S. Marshal arrives at a small town in Nevada, only to learn that his preacher brother is dead after standing up to the town's mayor and outlaws.\n"}, {"title": "Justin Bieber: Never Say Never", "rating": "G", "description": "Teen idol Justin Bieber provides personal snapshots from throughout his career, culminating with scenes from his triumphant 2010 concert tour.\n"}, {"title": "K-19: The Widowmaker", "rating": "PG-13", "description": "On board Russia's first nuclear ballistic submarine, Capt. Vostrikov must race against time to prevent a Chernobyl-like explosion.\n"}, {"title": "Kahlil Gibran's The Prophet", "rating": "PG", "description": "A troubled young girl and her mother find solace on a journey with a subversive poet whose words captivate their hearts and imaginations.\n"}, {"title": "Kate & Leopold", "rating": "PG-13", "description": "A present-day woman takes responsibility for guiding a charming time-traveling 19th-century nobleman through the 21st century.\n"}, {"title": "Kevin Hart: Laugh at My Pain", "rating": "R", "description": "Sometimes edgy and always hilarious, comedian Kevin Hart shines in this theatrical version of his record-breaking 2011 live tour.\n"}, {"title": "Kevin Hart: Let Me Explain", "rating": "R", "description": " world tour.\n"}, {"title": "Kevin Hart: What Now?", "rating": "R", "description": "Frenetic comic Kevin Hart hits Philadelphia and dishes on suburban wildlife, jean shorts and the fine art of getting even with a 7-year-old.\n"}, {"title": "Kickboxer: Retaliation", "rating": "R", "description": "Sloan's vow to never return to Thailand is cut short when he's kidnapped and taken to a Thai prison, where he's forced to fight a 400-pound brute.\n"}, {"title": "Kicking and Screaming", "rating": "R", "description": " – reluctantly step into adulthood in this ensemble comedy.\n"}, {"title": "Kidnapping Mr. Heineken", "rating": "R", "description": " Heineken is kidnapped in 1983, his abductors make the largest ransom demand in history.\n"}, {"title": "Kill Bill: Vol. 1", "rating": "R", "description": "An assassin is shot by her ruthless employer, Bill, and other members of their assassination circle. But she lives – and plots her vengeance.\n"}, {"title": "Kill Bill: Vol. 2", "rating": "R", "description": "The Bride has three left on her rampage list: Budd, Elle Driver and Bill himself. But when she arrives at Bill's house, she's in for a surprise.\n"}, {"title": "Kill the Irishman", "rating": "R", "description": "This true crime tale charts the rise and fall of mobster Danny Greene, who faced down the Mafia to gain control of organized crime in 1970s Cleveland.\n"}, {"title": "Kill the Messenger", "rating": "R", "description": "In the 1980s, a crusading journalist uncovers secret CIA funding for Nicaraguan rebels, but the powers that be silence his investigation.\n"}, {"title": "Killer Klowns from Outer Space", "rating": "PG-13", "description": "An alien band of killer clowns descends from the cosmos to harvest scores of small-town victims, cocooning their prey in cotton candy to eat later.\n"}, {"title": "Killers", "rating": "PG-13", "description": "After a whirlwind romance, Jen and Spencer settle into married life — until Spencer's secret past as a hit man shakes up their suburban bliss.\n"}, {"title": "Killing Hasselhoff", "rating": "R", "description": "In major debt to a loan shark, a nightclub owner who's entered in a celebrity death pool tries to murder a famous figure for half a million dollars.\n"}, {"title": "Killing Them Softly", "rating": "R", "description": "When a couple low-level crooks rob a Mob-protected poker game, a slick enforcer is hired to track down the offenders and take care of business.\n"}, {"title": "Kilo Two Bravo", "rating": "R", "description": "On patrol in Afghanistan, a British paratrooper unit unwittingly ventures into a dry riverbed that turns out to be littered with land mines.\n"}, {"title": "King's Ransom", "rating": "PG-13", "description": "A wealthy, despicable businessman comes to the realization that he may lose half his fortune to the obnoxious wife he's trying to divorce. So, he decides to arrange his own kidnapping in order to wipe himself out and claim poverty.\n"}, {"title": "Kingpin", "rating": "PG-13", "description": "After a bowler loses his hand, his career takes a nosedive. That is, until he uncovers the next big thing: an Amish kid named Ishmael.\n"}, {"title": "Kings", "rating": "R", "description": "A foster mom and her houseful of kids befriend a bitter neighbor after the Rodney King verdict is handed down in 1992 Los Angeles.\n"}, {"title": "Kiss the Girls", "rating": "R", "description": "A forensic psychologist teams up with an escaped kidnapping victim to hunt down a serial killer who abducts and dominates strong-willed women.\n"}, {"title": "Klaus", "rating": "PG", "description": "A selfish postman and a reclusive toymaker form an unlikely friendship, delivering joy to a cold, dark town that desperately needs it.\n"}, {"title": "Knock Down The House", "rating": "PG", "description": "Go behind the scenes as four determined women – including Alexandria Ocasio-Cortez – challenge big-money politicians in the 2018 race for Congress.\n"}, {"title": "Knock Knock", "rating": "R", "description": "A devoted husband and father on his own for the weekend has his life turned inside out after giving shelter to two young women during a storm.\n"}, {"title": "Knowing", "rating": "PG-13", "description": "An MIT astrophysics professor and his son unearth a string of numbers from a time capsule that seem to reveal a cataclysm that will wipe out humanity.\n"}, {"title": "Kon-Tiki", "rating": "PG-13", "description": "With five loyal friends in tow, explorer Thor Heyerdahl sails a fragile balsa wood raft along an ancient path some 4,300 miles across the Pacific.\n"}, {"title": "Krisha", "rating": "R", "description": "After 10 years away from her family, Krisha returns for Thanksgiving, but bitter grudges and troubling addictions threaten to ruin the event.\n"}, {"title": "Krystal", "rating": "R", "description": "A kid with a heart condition falls for an ex-stripper with a lot of baggage and joins her Alcoholics Anonymous group to catch her attention.\n"}, {"title": "Kung Fu Hustle", "rating": "R", "description": "Sing, a mobster in 1940s China, longs to be as cool as the formally clad Axe Gang, a band of killers who rule Hong Kong, but can only pretend.\n"}, {"title": "Kurt & Courtney", "rating": "R", "description": "This film charts Nirvana's Kurt Cobain's rise to fame, his drug-addled romance with Courtney Love and the conspiracy theories surrounding his death.\n"}, {"title": "Kyaa Kool Hain Hum 3", "rating": "R", "description": "When an unlikely porn actor falls for a woman outside the industry, he employs his co-stars as a stand-in traditional family to impress her father.\n"}, {"title": "LA 92", "rating": "R", "description": "Previously unseen footage is shaped into a fresh and timely retelling of the 1992 Rodney King trial – and the verdict that sparked civil unrest.\n"}, {"title": "La Bamba", "rating": "PG-13", "description": "The plane crash that killed Buddy Holly also took Ritchie Valens, whose modest upbringing and rise to fame are depicted in this exhilarating biopic.\n"}, {"title": "Lady Bird", "rating": "R", "description": "An intrepid high schooler in Sacramento undergoes the trials of love, family and self-discovery as she dreams of escaping to college on the East Coast.\n"}, {"title": "Lady Bloodfight", "rating": "R", "description": "An American travels to Hong Kong in hopes of winning a lucrative – but potentially deadly – all-female underground fighting tournament.\n"}, {"title": "Lady Driver", "rating": "PG", "description": "When a rebellious teen searches for her unknown roots, it leads her to the sport of dirt track racing and a discovery she didn't expect.\n"}, {"title": "Lady in the Water", "rating": "PG-13", "description": "When an apartment building manager discovers a water nymph in the complex's swimming pool, he tries to help her return to her mythical home.\n"}, {"title": "Lady-Like", "rating": "NC-17", "description": "After she pushes her best friend Kort to date a handsome transfer student, college student Allie is left to tackle adulthood on her own.\n"}, {"title": "Lagaan", "rating": "PG", "description": "In 1890s India, an arrogant British commander challenges the harshly taxed residents of Champaner to a high-stakes cricket match.\n"}, {"title": "Last Knights", "rating": "R", "description": "A nobleman who values his people's well-being over his emperor's edicts is killed. His knights vow revenge.\n"}, {"title": "Last Night", "rating": "R", "description": "During an evening apart, married couple Joanna and Michael encounter tempting opportunities to cheat on each other with sexy acquaintances.\n"}, {"title": "Lawless", "rating": "R", "description": "This true-to-life action saga profiles Virginia's bootlegging Bondurant brothers, whose exploits during the Prohibition era made them outlaw heroes.\n"}, {"title": "Layer Cake", "rating": "R", "description": "A seasoned British drug dealer longs to ditch his illegal trade. But he can't do that without wrapping up just one more job.\n"}, {"title": "Leap Year", "rating": "PG", "description": "Anna chooses February 29 to propose marriage to her boyfriend, but after meeting a charming innkeeper, she must evaluate her original plans.\n"}, {"title": "Leap!", "rating": "PG", "description": "Félicie and Victor, two young friends in 1880s France, escape from an orphanage to pursue their dreams in Paris, the glittering City of Lights.\n"}, {"title": "Lee Daniels' The Butler", "rating": "PG-13", "description": "The life of a White House butler who worked for eight presidents unfolds against a backdrop of unparalleled change in American history.\n"}, {"title": "Left Behind", "rating": "PG-13", "description": "After millions of people on Earth suddenly disappear, a pilot flying a plane stuck at 30,000 feet must find a way to ensure the passengers' survival.\n"}, {"title": "Legend", "rating": "R", "description": "Identical twins and notorious gangsters Reggie and Ronnie Kray elude the authorities in 1960s London while transfixing and terrifying the public.\n"}, {"title": "Legend of the Guardians: The Owls of Ga'Hoole", "rating": "PG", "description": "Soren, a barn owl kidnapped from his peaceful forest home, is brought to an orphanage where he must train to become a soldier.\n"}, {"title": "Legion", "rating": "R", "description": "A motley crew of apocalypse survivors living at an abandoned truck stop never suspects that the pregnant woman among them is carrying the Messiah.\n"}, {"title": "Les Misérables", "rating": "PG-13", "description": "The musical version of Victor Hugo's epic tale of love and sacrifice, first produced for the stage in 1985, now receives the big-screen treatment.\n"}, {"title": "Let It Snow", "rating": "PG-13", "description": "A snowstorm hits a small town on a cold Christmas Eve, affecting the friendships, love lives and futures of several high school seniors.\n"}, {"title": "Life After Beth", "rating": "R", "description": "Following the death of his beloved girlfriend, Beth, Zach is first shattered and then overjoyed when she inexplicably comes back to life.\n"}, {"title": "Like Water for Chocolate", "rating": "R", "description": "When Pedro marries her sister, Tita throws herself into her cooking – and discovers she can transfer her emotions through the food she prepares.\n"}, {"title": "Lila & Eve", "rating": "R", "description": "After each of them loses a child to murder, two women who meet in a support group initiate their own investigation when the police are no help.\n"}, {"title": "Lincoln", "rating": "PG-13", "description": "Director Steven Spielberg takes on the towering legacy of Abraham Lincoln, focusing on his stewardship of the Union during the Civil War years.\n"}, {"title": "Little Men", "rating": "PG", "description": "Jake and Tony become friends when Jake's dad inherits a home above Tony's mother's shop. Friendship is tested when Jake's dad raises the shop's rent.\n"}, {"title": "Little Monsters", "rating": "PG", "description": "Brian knows there are creatures under his bed. When he faces his fears and confronts them, however, he makes some hilariously weird new friends.\n"}, {"title": "Little Nicky", "rating": "PG-13", "description": "The devil sends his sweet son Nicky to Earth to bring back his scheming siblings, who have plans to oust dear old dad from power.\n"}, {"title": "Lo and Behold: Reveries of the Connected World", "rating": "PG-13", "description": "Filmmaker Werner Herzog presents a history of the internet, starting with its birth in 1969, and ponders the joys and sorrows of its social influence.\n"}, {"title": "Lock, Stock and Two Smoking Barrels\"", "rating": "R", "description": "Hoping to make a bundle in a high-stakes poker game, four shiftless lads from London's East End instead find themselves swimming in debt.\n"}, {"title": "Locke", "rating": "R", "description": "Over the space of 90 minutes, Ivan Locke's life spins out of control via a series of phone calls made while he drives down the highway to London.\n"}, {"title": "Lockout", "rating": "PG-13", "description": "A government agent wrongly accused of a crime gets a shot at freedom if he can engineer a high-risk rescue mission to outer space.\n"}, {"title": "Logan's Run", "rating": "PG", "description": "In the 23rd century, inhabitants of a domed city exist in a world filled with life's pleasures – but no one is allowed to live past the age of 30.\n"}, {"title": "Lolita", "rating": "R", "description": "In this black comedy, an English professor marries his landlady to get closer to his forbidden obsession: her teenage daughter.\n"}, {"title": "London Heist", "rating": "R", "description": "After a heist gone wrong, a career criminal gradually uncovers the hidden motive behind his father's murder – and it has nothing to do with money.\n"}, {"title": "Lost Girls", "rating": "R", "description": "Desperate to find her missing daughter, a mother fights to uncover the truth — and helps expose a string of unsolved murders. Based on a true story.\n"}, {"title": "Love Beats Rhymes", "rating": "R", "description": "After enrolling in a college poetry course, a struggling rapper finds inspiration for her new voice through slam poetry.\n"}, {"title": "Love Jacked", "rating": "PG-13", "description": "To assert her independence from her rigid father’s expectations, a headstrong woman hires a desperate Los Angeles man to pose as her fiancé in Africa.\n"}, {"title": "Love Jones", "rating": "R", "description": "In this urban romantic comedy set in Chicago, the ups and downs of courtship play out between a young black poet and a pretty shutterbug.\n"}, {"title": "Love, Rosie\"", "rating": "R", "description": "Over the years, as they come and go in each other's life, childhood pals Rosie and Alex struggle to resolve the lasting, intimate bond between them.\n"}, {"title": "Loving", "rating": "PG-13", "description": "A young couple's interracial marriage in 1958 sparks a case that leads to the Supreme Court. Based on the true story of Richard and Mildred Loving.\n"}, {"title": "Lu Over the Wall", "rating": "PG", "description": "Middle schooler Kai's depressing life in a boring fishing village changes drastically when a local mermaid named Lu joins his band.\n"}, {"title": "Lupin the 3rd: The Castle of Cagliostro: Special Edition", "rating": "PG-13", "description": "Lupin, his sidekick, Jigen, and the samurai warrior Goemon set out to take over an evil counterfeit operation at Count Cagliostro's fortress.\n"}, {"title": "MANK", "rating": "R", "description": "1930s Hollywood is reevaluated through the eyes of scathing wit and alcoholic screenwriter Herman J. Mankiewicz as he races to finish “Citizen Kane.”\n"}, {"title": "MFKZ", "rating": "R", "description": "Mysterious goons chase teenage slacker Angelino through chaotic Dark Meat City as he uncovers secret powers that could be the key to saving the world.\n"}, {"title": "MI-5", "rating": "R", "description": "When a terrorist escapes custody, MI-5 director Harry Pearce becomes the scapegoat. But the wily veteran still has some spycraft tricks up his sleeve.\n"}, {"title": "MR. RIGHT", "rating": "R", "description": "Fresh off a bad relationship, thrill-seeking Martha finds romance and danger with Francis, a hit man who's decided to turn the tables on his clients.\n"}, {"title": "Ma Rainey's Black Bottom", "rating": "R", "description": "Tensions and temperatures rise at a Chicago music studio in 1927 when fiery, fearless blues singer Ma Rainey joins her band for a recording session.\n"}, {"title": "Mac & Devin Go to High School", "rating": "R", "description": "Devin Overstreet may be the class valedictorian, but he hasn't had much life experience. Enter Mac Johnson, a 10th-year senior and weed dealer.\n"}, {"title": "Machete Kills", "rating": "R", "description": "Killer-for-hire Machete cuts a deal with the U.S. president to stop a nuclear missile attack but discovers a much larger conspiracy.\n"}, {"title": "Mad Max", "rating": "R", "description": "In a post-apocalyptic future, a malicious gang murders Max's family as an act of retaliation, forcing Max to hit the open road seeking vengeance.\n"}, {"title": "Mad Money", "rating": "PG-13", "description": "A woman joins the janitorial staff of the Federal Reserve Bank and conspires with two co-workers to pilfer old money that's scheduled to be destroyed.\n"}, {"title": "Madagascar: Escape 2 Africa", "rating": "PG", "description": "A botched rescue strands Alex the lion and his companions in Africa. Sadly, Alex discovers he has little in common with the locals.\n"}, {"title": "Magnolia", "rating": "R", "description": "Through chance, human action, past history and divine intervention, an eclectic cast of characters weaves and warps through each other's lives.\n"}, {"title": "Man Up", "rating": "R", "description": "A single woman seizes an opportunity when, while standing under a train station clock, she meets a stranger who mistakes her for his blind date.\n"}, {"title": "Man of Tai Chi", "rating": "R", "description": "In this kung fu tale set in Beijing, a young man armed with incomparable martial arts skills gets embroiled in the world of underground fight clubs.\n"}, {"title": "Manglehorn", "rating": "PG-13", "description": "A reclusive small-town locksmith who can't stop writing letters to a lost love meets a kindly bank teller who challenges him to look to the future.\n"}, {"title": "Mansfield Park", "rating": "PG-13", "description": "A poor heroine is sent to live with wealthy relatives in 1800s England, where her wit and writing talent find the room, and circumstance, to grow.\n"}, {"title": "Maps to the Stars", "rating": "R", "description": "A showbiz family revolving around its teen celebrity son desperately tries to hang on to fame and success in this savage satire of Hollywood.\n"}, {"title": "Marauders", "rating": "R", "description": "A series of high-stakes thefts at banks owned by a manipulative millionaire sparks an FBI agent to suspect a sinister plan behind the deadly heists.\n"}, {"title": "Marriage Story", "rating": "R", "description": "Academy Award-nominated filmmaker Noah Baumbach directs this incisive and compassionate look at a marriage coming apart and a family staying together.\n"}, {"title": "Martial Arts of Shaolin", "rating": "R", "description": "In ancient China, Zhi Ming trains at the legendary Northern Shaolin temple to avenge the death of his father at the hands of a nefarious magistrate.\n"}, {"title": "Martin Lawrence Live: Runteldat", "rating": "R", "description": "This provocative film sheds light on actor-comedian Martin Lawrence's roots, his rise to fame and his walk on the wild side.\n"}, {"title": "Marvel Super Hero Adventures: Frost Fight!", "rating": "PG", "description": "In this Christmas-themed special, Captain America and the Avengers battle Loki and Ymir, who plot to steal Santa Claus' powers and conquer the world.\n"}, {"title": "Marvel's Hulk: Where Monsters Dwell", "rating": "PG", "description": "On Halloween, the Hulk and Dr. Strange battle monsters wreaking havoc on New York and uncover an evil plot by Nightmare, ruler of the Dream Dimension.\n"}, {"title": "Marvel's Iron Man & Hulk: Heroes United", "rating": "PG", "description": "When scientists join Hulk's gamma energy with Tony Stark's Arc Reactor, the resulting force creates a foe that only the two Marvel heroes can combat.\n"}, {"title": "Mary Poppins Returns", "rating": "PG", "description": "In 1930s London, Michael Banks and his three children get some help turning their topsy-turvy world around when his magical childhood nanny reappears.\n"}, {"title": "Mary and the Witch's Flower", "rating": "PG", "description": "Ordinary girl Mary picks an extraordinary flower and travels to Endor College, a school for magic. But its foremost teachers have a sinister plan.\n"}, {"title": "Mean Dreams", "rating": "R", "description": "Desperate to start a new life with his girlfriend, a teenage boy steals drug money from her father, who happens to be the town's corrupt lawman.\n"}, {"title": "Mean Girls 2", "rating": "PG-13", "description": "The father of a high school pariah offers to pay another student's way through college if she makes friends with his outcast daughter.\n"}, {"title": "Mean Streets", "rating": "R", "description": "In New York's Little Italy, a low-level hoodlum wrestles with loyalty to his mobster uncle, his faith and his friendship with an inveterate gambler.\n"}, {"title": "Melvin Goes to Dinner", "rating": "R", "description": "When Melvin and his friends gather for dinner, their casual conversation takes a sharp turn as they begin to disclose raw truths about themselves.\n"}, {"title": "Men in Black", "rating": "PG-13", "description": "A streetwise cop teams with a veteran government agent to work for a super-secret, extremely dapper team that monitors extraterrestrials on Earth.\n"}, {"title": "Men in Black II", "rating": "PG-13", "description": "Will Smith and Tommy Lee Jones reprise their roles as two highly secretive and unofficial government agents dealing with all things evil and alien.\n"}, {"title": "Menashe", "rating": "PG", "description": "A year after his wife's death, a widower faces pressure from his Hasidic community to give up his son for adoption unless he finds a new partner.\n"}, {"title": "Merantau", "rating": "R", "description": "In this fast-paced Indonesian thriller, a young martial arts master travels to Jakarta, where he saves an orphan from a human-trafficking ring.\n"}, {"title": "Metallica Through The Never", "rating": "R", "description": "As heavy metal band Metallica tears up the stage, a young roadie is sent on an urgent errand. But his mission soon takes a surreal turn.\n"}, {"title": "Middle Men", "rating": "R", "description": "An entrepreneur develops an adult entertainment online billing company – and winds up dealing with mobsters, the FBI, con men and terrorists.\n"}, {"title": "Middle School: The Worst Years of My Life", "rating": "PG", "description": "At Hills Village Middle School, budding cartoonist Rafe and best pal Leo challenge their uptight principal by breaking every rule in his handbook.\n"}, {"title": "Midnight Special", "rating": "PG-13", "description": "When his son exhibits supernatural powers, a father takes the youngster on the run to protect him from government authorities and religious fanatics.\n"}, {"title": "Mile 22", "rating": "R", "description": "An officer in a top-secret CIA unit leads his team in escorting a prized intelligence asset to safety, with enemy forces hot on their trail.\n"}, {"title": "Milk", "rating": "R", "description": "Sean Penn stars in this biopic about Harvey Milk, the openly gay San Francisco politician who was murdered by a disgruntled city supervisor in 1978.\n"}, {"title": "MindGamers", "rating": "R", "description": "Brilliant young students discover a breakthrough that could change humankind, but soon find themselves the subjects of a much bigger experiment.\n"}, {"title": "Miracle", "rating": "PG", "description": "U.S. hockey coach Herb Brooks unites a motley crew of college athletes and turns them into a force to be reckoned with at the 1980 Winter Olympics.\n"}, {"title": "Mirai", "rating": "PG", "description": "Unhappy after his new baby sister displaces him, four-year-old Kun begins meeting people and pets from his family's history in their unique house.\n"}, {"title": "Mirror Mirror", "rating": "PG", "description": "This remake of the classic Grimm tale follows fair-skinned Snow White on a quest to regain her royal throne with help from a team of shady dwarves.\n"}, {"title": "Miss Hokusai", "rating": "PG-13", "description": "Herself a talented artist, O-Ei works with her father, Tetsuzo, later known as Hokusai, on the woodblock prints that would make Edo famous worldwide.\n"}, {"title": "Miss Julie", "rating": "PG-13", "description": "On a summer night in 1890 Ireland, the unsettled daughter of aristocrats coaxes her father's valet to seduce her, though he's engaged to their cook.\n"}, {"title": "Mississippi Grind", "rating": "R", "description": "A gambler mired in debt thinks another cardsharp may just be his good luck charm as the two head for New Orleans to buy into a high-stakes poker game.\n"}, {"title": "Modest Heroes: Ponoc Short Films Theatre", "rating": "PG", "description": "Two underwater siblings surviving on their own. A boy with a serious egg allergy. A man invisible to the rest of society. Three short animated tales.\n"}, {"title": "Mojave", "rating": "R", "description": "A lethal game of cat and mouse stretches from the desert to Tinseltown after Hollywood bad boy Thomas runs afoul of a cunning and dangerous drifter.\n"}, {"title": "Molly's Game", "rating": "R", "description": "Former Olympian Molly Bloom ran a high-stakes poker game for the stars – until her lofty lifestyle nearly sent her to prison.\n"}, {"title": "Mona Lisa Smile", "rating": "PG-13", "description": "In 1953, the women of Wellesley College are measured by how well they marry – until the arrival of a professor who threatens to upend the status quo.\n"}, {"title": "Money", "rating": "R", "description": "Two corporate spies with a $5 million haul for selling secrets are held hostage by a thief, triggering a game of cat and mouse to gain the upper hand.\n"}, {"title": "Money Talks", "rating": "R", "description": "TV news reporter James Russell helps put small-time criminal Franklin Hatchett in jail, but turns to protecting Hatchett when he escapes from prison.\n"}, {"title": "Monkey Up", "rating": "PG", "description": "A talking monkey famous for his TV commercials dreams of breaking into real movies. But first he stumbles upon a brother and sister who need his help.\n"}, {"title": "Monster Family", "rating": "PG", "description": "A family’s festive Halloween plans take a spooky turn when an evil witch's curse transforms the costumed clan into actual monsters.\n"}, {"title": "Monster House", "rating": "PG", "description": "A trio of friends sets out to expose the terrors of a vacant neighborhood house, which appears to have a craving for people — and a life of its own.\n"}, {"title": "Monster-in-Law", "rating": "PG-13", "description": "An office temp thinks she's found Mr. Right when she starts dating a handsome surgeon. But there's a problem standing in the way of everlasting bliss.\n"}, {"title": "Monsters: Dark Continent", "rating": "R", "description": "An American platoon stationed in the Middle East is thrust into battle with a breed of tentacled aliens whose rapid spread threatens human survival.\n"}, {"title": "Monty Python and the Holy Grail", "rating": "PG", "description": "The Monty Python comedy clan skewers King Arthur and his Knights of the Round Table as they quest far and wide for the Holy Grail.\n"}, {"title": "Monty Python's Life of Brian", "rating": "R", "description": "Born in a stable in Judea, Brian grows up to join a group of anti-Roman zealots, but his fate keeps getting confused with that of a certain carpenter.\n"}, {"title": "Monty Python: Live at The Hollywood Bowl", "rating": "R", "description": "\n"}, {"title": "Moon", "rating": "R", "description": "As he nears the end of a lonely three-year stint on the moon base Sarang, astronaut Sam Bell begins to hear and see strange things.\n"}, {"title": "Moonlight", "rating": "R", "description": "In a crime-infested Miami neighborhood, a gay African-American boy with a drug-addicted mother grows up with the help of a mentoring drug dealer.\n"}, {"title": "Moonwalkers", "rating": "R", "description": "A brain-addled war vet, a failing band manager and a Stanley Kubrick impersonator help the CIA construct an epic scam by faking the 1969 moon landing.\n"}, {"title": "Morris from America", "rating": "R", "description": "When his father moves from the U.S. to Heidelberg, Germany, an African American teenager struggles to find his place and pursue his hip-hop dreams.\n"}, {"title": "Mountain", "rating": "PG", "description": "Featuring breathtaking imagery and thought-provoking narration, this film takes viewers to the summits of some of the world’s most amazing mountains.\n"}, {"title": "Movie 43", "rating": "R", "description": "An eye-popping cast stars in this sketch-comedy collage, the new millennium's homage to classic anthology films like The Kentucky Fried Movie.\n"}, {"title": "Mowgli: Legend of the Jungle", "rating": "PG-13", "description": "An orphaned boy raised by animals in the jungle seizes his destiny while confronting a dangerous enemy – and his own human origins.\n"}, {"title": "Mr. Church", "rating": "PG-13", "description": "A temporary personal chef, a terminally ill single mother and her young daughter form an unlikely bond that redefines the meaning of family.\n"}, {"title": "Mr. Deeds", "rating": "PG-13", "description": "After inheriting a media empire, humble Longfellow Deeds moves to the Big Apple – where a reporter and a company bigwig are waiting to pounce on him.\n"}, {"title": "Mr. Peabody & Sherman", "rating": "PG", "description": " canine genius Mr. Peabody and young Sherman take a dizzying ride through time.\n"}, {"title": "Mr. Woodcock", "rating": "PG-13", "description": "When a self-help author learns that his mother has fallen for his sadistic high school gym teacher, he tries to put a stop to their budding romance.\n"}, {"title": "Mubarakan", "rating": "PG-13", "description": "Chaos ensues after two orphaned twin brothers raised apart team up with their eccentric, unmarried uncle to find a solution to their romantic woes.\n"}, {"title": "Mud", "rating": "PG-13", "description": "Two Mississippi teens meet peculiar drifter Mud and get caught up in his web of tall tales about lost love, crimes of passion and bounty hunters.\n"}, {"title": "Mudbound", "rating": "R", "description": "Two Mississippi families – one black, one white – confront the brutal realities of prejudice, farming and friendship in a divided World War II era.\n"}, {"title": "Mune: Guardian of the Moon", "rating": "PG", "description": "When the old guardian of the moon retires, the mischievous Mune is chosen as his successor, but he worries he's not up to the job.\n"}, {"title": "Muppets Most Wanted", "rating": "PG", "description": "In the middle of their global tour, the Muppets inadvertently get mixed up in a perilous drama involving a gang of international jewel thieves.\n"}, {"title": "Murder Mystery", "rating": "PG-13", "description": "On a long-awaited trip to Europe, a New York City cop and his hairdresser wife scramble to solve a baffling murder aboard a billionaire's yacht.\n"}, {"title": "My Entire High School Sinking Into the Sea", "rating": "PG-13", "description": "After an earthquake sends their school building drifting into the sea, a group of high-schoolers struggles to survive and overcome clique wars.\n"}, {"title": "My Girl", "rating": "PG-13", "description": "This coming-of-age charmer follows a summer in the life of an 11-year-old girl who learns about love and loss as she grapples with profound changes.\n"}, {"title": "My Life as a Zucchini", "rating": "PG-13", "description": "A 9-year-old boy finds his life upended when he's sent to live in an orphanage in this stop-motion animated tale of loss, friendship and young love.\n"}, {"title": "My Perfect Romance", "rating": "PG", "description": "Just in time for Valentine's Day, a program developer pitches a revolutionary dating algorithm to her new CEO, who volunteers them as guinea pigs.\n"}, {"title": "My Sister's Keeper", "rating": "PG-13", "description": "A former defense attorney finds herself back in court when she and her husband are sued for medical emancipation by their 11-year-old daughter.\n"}, {"title": "My Week with Marilyn", "rating": "R", "description": "While filming a movie in England, Hollywood icon Marilyn Monroe slips away with a young Brit for a week of self-discovery and frivolity.\n"}, {"title": "Mystic Pizza", "rating": "R", "description": "In a small fishing town, three teenage girls from blue-collar families navigate life and love while working in a pizza parlor.\n"}, {"title": "Mystic River", "rating": "R", "description": "Tragedy reunites childhood friends Sean, Dave and Jimmy when they're linked together in a murder investigation about Jimmy's teenage daughter.\n"}, {"title": "Nacho Libre", "rating": "PG", "description": "When Ignacio learns of an orphanage's financial woes, he pitches in to help – by disguising himself and joining the professional wrestling circuit.\n"}, {"title": "National Lampoon's Loaded Weapon 1", "rating": "PG-13", "description": "In this parody of the Lethal Weapon franchise, criminals murder a detective and steal her prized evidence: microfilm with a recipe for cocaine cookies. Luckily, loose-cannon cop Jack Colt and his by-the-book partner, Wes Luger, are on the case.\n"}, {"title": "National Treasure", "rating": "PG", "description": "Modern treasure hunters search for a chest of riches rumored to have been stashed away by George Washington, Thomas Jefferson and Benjamin Franklin.\n"}, {"title": "Natural Born Pranksters", "rating": "R", "description": " with their most over-the-top stunts.\n"}, {"title": "Natural Selection", "rating": "R", "description": "As the new kid, a shy high school senior finds himself tormented by all his peers except one. But his new friend has a dark, infectious outlook.\n"}, {"title": "Neruda", "rating": "R", "description": "When a Chilean policeman vows to find and capture leftist poet Pablo Neruda, a game of cat and mouse ensues that tests both their wills.\n"}, {"title": "New York Minute", "rating": "PG", "description": "When bickering teenage twins accidentally land in the middle of a criminal operation, they'll have to work together to get themselves out of trouble.\n"}, {"title": "Next", "rating": "PG-13", "description": "Las Vegas magician Cris can see a few minutes into the future and an FBI agent wants his help thwarting a nuclear attack.\n"}, {"title": "Night Moves", "rating": "R", "description": "A pair of young environmentalists enlist the help of an ex-military explosives expert to carry out a dangerous act of eco-terrorism.\n"}, {"title": "Nightcrawler", "rating": "R", "description": "A young hustler finds success trolling the streets of Los Angeles to film disasters and death. But the darkness he captures starts to take hold of him.\n"}, {"title": "Nights in Rodanthe", "rating": "PG-13", "description": "When a hurricane hits a coastal North Carolina inn and strands the only guest, surgeon Paul Flanner, a young woman's life changes forever.\n"}, {"title": "Ninja Assassin", "rating": "R", "description": "When his best friend is murdered by the shadowy Ozunu clan, Raizo, an orphan raised to be an assassin, vows revenge.\n"}, {"title": "No Reservations", "rating": "PG", "description": "Kate, an uptight chef, finds her life turned upside down when her sister dies in a car accident and she becomes her niece's sole guardian.\n"}, {"title": "Nobel", "rating": "R", "description": "A series of incidents in Afghanistan set complicated political and personal events in motion for a returning Norwegian Special Forces officer.\n"}, {"title": "Nocturnal Animals", "rating": "R", "description": "Reading her ex-husband's violent novel manuscript destabilizes gallery owner Susan's life, upending her present while digging up their past.\n"}, {"title": "Nothing to Lose", "rating": "PG", "description": "This biographical drama traces the rise to fame of controversial Brazilian evangelical leader and business titan Edir Macedo.\n"}, {"title": "Nothing to Lose 2", "rating": "PG-13", "description": "As controversy surrounds the evangelical church he helped found, Edir Macedo must juggle betrayals, politics and personal loss in this biopic sequel.\n"}, {"title": "November Criminals", "rating": "PG-13", "description": "Dissatisfied with the police’s progress, a teen and his best friend investigate their classmate's murder, treading down a dark path to the uneasy truth.\n"}, {"title": "Now and Then", "rating": "PG-13", "description": "Waxing nostalgic about the bittersweet passage from childhood to puberty, four childhood girlfriends recall the magical summer of 1970.\n"}, {"title": "Nowhere Boy", "rating": "R", "description": "Raised by his aunt since he was a young boy, charismatic John Lennon is suddenly reunited with his mother, Julia, which ignites a bitter battle.\n"}, {"title": "Oasis: Supersonic", "rating": "R", "description": "This film details the rise of British rock group Oasis and the creativity and chaos that brothers Noel and Liam Gallagher brought to the iconic band.\n"}, {"title": "Obvious Child", "rating": "R", "description": "After being fired from her job and dumped by her cheating boyfriend, a comedian has a one-night stand. Weeks later, she finds out she's pregnant.\n"}, {"title": "Occupation", "rating": "R", "description": "When aliens take over their small Australian town, a modest group of survivors must unite to fend off their otherworldly intruders.\n"}, {"title": "Ocean's Thirteen", "rating": "PG-13", "description": "This entry in the all-star caper franchise finds debonair con man Danny Ocean and his gang taking revenge on a double-crossing Las Vegas kingpin.\n"}, {"title": "Ocean's Twelve", "rating": "PG-13", "description": "Danny Ocean reunites with his old flame and the rest of his merry band of thieves in a caper covering three huge heists in Rome, Paris and Amsterdam.\n"}, {"title": "Océans", "rating": "G", "description": "This documentary examines the vital role water plays in human existence and the cause-and-effect interplay between oceans and the environment.\n"}, {"title": "Officer Downe", "rating": "R", "description": "Fallen Los Angeles police officer Terrence Downe finds new life as a secret weapon: a scientifically altered super-cop with unlimited lives.\n"}, {"title": "Okko's Inn", "rating": "PG", "description": "After losing her parents, a young girl learns about grief and healing from a friendly ghost who lives in her grandmother's traditional Japanese inn.\n"}, {"title": "Olympus Has Fallen", "rating": "R", "description": "A disgraced Secret Service agent must come to the rescue when Korean terrorists descend on the White House and take the president hostage.\n"}, {"title": "Once Upon a Time in the West", "rating": "PG-13", "description": "In this epic spaghetti Western, a flinty gunslinger is hired by a railroad tycoon to kill anyone standing in the way of his trans-American iron horse.\n"}, {"title": "One Direction: This Is Us", "rating": "PG", "description": "Award-winning documentarian Morgan Spurlock turns his camera on boy band phenomenon One Direction in this combination concert film and backstage pass.\n"}, {"title": "Only God Forgives", "rating": "R", "description": "When a cop kills the brother of an expat American gangster who runs a Bangkok fight club, his crime-boss mother flies in to supervise revenge.\n"}, {"title": "Open Season", "rating": "PG", "description": "After saving a deer from a hunter's clutches, a domesticated grizzly finds himself relocated to the wild – and unprepared for the real world.\n"}, {"title": "Otherhood", "rating": "R", "description": "Feeling forgotten on Mother's Day, three best friends leave the suburbs and drive to New York City to surprise their adult sons.\n"}, {"title": "Our House", "rating": "PG-13", "description": "A young man invents a device he hopes will generate wireless energy, but instead, it proves to spark sinister, supernatural activity in his home.\n"}, {"title": "Our Idiot Brother", "rating": "R", "description": "A seemingly clueless idealist relies on his exasperated sisters for shelter and support after his girlfriend dumps him and his dog is taken away.\n"}, {"title": "Outlaw King", "rating": "R", "description": "In 14th-century Scotland, Robert the Bruce claims the crown and leads a fierce uprising to win back the country's independence from English rule.\n"}, {"title": "Outside the Wire", "rating": "R", "description": "In the near future, a drone pilot sent into a war zone finds himself paired with a top-secret android officer on a mission to stop a nuclear attack.\n"}, {"title": "Over the Moon", "rating": "PG", "description": "Fueled by memories of her mother, resourceful Fei Fei builds a rocket to the moon on a mission to prove the existence of a legendary moon goddess.\n"}, {"title": "P.S. I Love You", "rating": "PG-13", "description": "When she loses her beloved husband to a brain tumor, grieving widow Holly Kennedy learns that he left a series of letters behind to help her cope.\n"}, {"title": "Pachamama", "rating": "PG", "description": "When a sacred statue is taken from his Andean village, a spirited boy who dreams of becoming a shaman goes on a brave mission to get it back.\n"}, {"title": "Pad Man", "rating": "PG-13", "description": "Despite public humiliation and resistance, an entrepreneur markets a hygienic, low-cost sanitary pad that even India's poorest women can afford.\n"}, {"title": "Paid in Full", "rating": "R", "description": "This fictionalized account of three real-life notorious Harlem drug dealers is told in flashbacks as they plunge into the world of hustling.\n"}, {"title": "Paint It Black", "rating": "R", "description": "In the wake of a young artist’s suicide, his pianist mother and his despairing girlfriend square off in a living nightmare beset by guilt and blame.\n"}, {"title": "Pan's Labyrinth", "rating": "R", "description": "Young Ofelia meets a mythical faun who claims she is destined to become princess of the Underworld. But first she must carry out three perilous tasks.\n"}, {"title": "Panic Room", "rating": "R", "description": "A woman and her daughter are caught in a game of cat-and-mouse with burglars in their New York City home and are forced to retreat inside a vault.\n"}, {"title": "ParaNorman", "rating": "PG", "description": "When an army of zombies invades a small town, it's up to an odd local boy with a knack for communicating with the dead to save the day.\n"}, {"title": "Paranormal Activity", "rating": "R", "description": "When Katie and Micah fear their home may be haunted by a demonic presence, Micah sets up a video camera to document all the action.\n"}, {"title": "Paris Is Burning", "rating": "R", "description": "This Sundance prize-winning documentary is an intimate portrait of 1980s Harlem drag balls: a world of fierce competition, sustenance, and survival.\n"}, {"title": "Passenger 57", "rating": "R", "description": "Air marshal John Cutter must stop notorious terrorist Charles Rane from killing hostages on board a flight that should have delivered Rane to jail.\n"}, {"title": "Patriot Games", "rating": "R", "description": "CIA desk jockey Jack Ryan plunges into the heart of international terrorism after spoiling an assassination attempt on a British royal family member.\n"}, {"title": "Paul Blart: Mall Cop", "rating": "PG", "description": "An overzealous security guard finds himself in over his head when he tries to thwart a criminal mastermind's plot to rob an entire shopping mall.\n"}, {"title": "Penelope", "rating": "PG", "description": "In this modern fairy tale, a young woman cursed with the nose of a pig lives her life in seclusion – until an unlikely beau stumbles onto the scene.\n"}, {"title": "Penguins of Madagascar: The Movie", "rating": "PG", "description": "Elite penguin spies Skipper, Kowalski, Rico and Private join forces with the suave agents of the North Wind to defeat power-mad genius Octavius Brine.\n"}, {"title": "Peppermint", "rating": "R", "description": "After her family is murdered, a mild-mannered mom remakes herself into a badass vigilante in order to exact violent justice.\n"}, {"title": "Perfect Stranger", "rating": "R", "description": "Ro risks her life to discover the identity of a stranger lurking on the Internet who might hold the answers to her friend's murder.\n"}, {"title": "Personal Shopper", "rating": "R", "description": "A psychic medium takes a job as personal shopper for a spoiled celebrity in order to contact the spirit of her brother, who owned her employer's home.\n"}, {"title": "Peter Rabbit", "rating": "PG", "description": "In this mix of live action and CGI, rascally Peter Rabbit faces a tough new foe in his ongoing battle for the veggies in Mr. McGregor's garden.\n"}, {"title": "Phantom Boy", "rating": "PG", "description": "A boy whose illness allows him to float outside his body uses his newfound skill to help a cop take on a madman who's terrorizing New York City.\n"}, {"title": "Philadelphia", "rating": "PG-13", "description": "Philadelphia attorney Andrew Beckett launches a wrongful termination suit against his law firm when they fire him because he's gay and HIV-positive.\n"}, {"title": "Pieces of a Woman", "rating": "R", "description": "A heartbreaking home birth leaves a woman grappling with the profound emotional fallout, isolated from her partner and family by a chasm of grief.\n"}, {"title": "Piercing", "rating": "R", "description": "A family man plots to kill a spellbinding sex worker but ends up in a psychosexual exercise to outwit his twisted target.\n"}, {"title": "Pineapple Express", "rating": "R", "description": "After witnessing a murder, a perpetually stoned process server and his good-natured dealer go on the run from a drug lord who's out to kill them.\n"}, {"title": "Planet 51", "rating": "PG", "description": "After landing on a planet reminiscent of 1950s suburbia, a human astronaut tries to avoid capture, recover his spaceship and make it home safely.\n"}, {"title": "Platoon", "rating": "R", "description": "A soldier grows disillusioned as he's caught between rival sergeants in this semi-autobiographical Vietnam War drama from writer-director Oliver Stone.\n"}, {"title": "Playing for Keeps", "rating": "PG-13", "description": "A washed-up, former soccer star attempts to rebuild his relationship with his son and ex-wife by coaching his son's soccer team.\n"}, {"title": "Polaroid", "rating": "PG-13", "description": "A teen's discovery of a vintage Polaroid camera develops into a darker tale when she finds that whoever takes their photo with it dies soon afterward.\n"}, {"title": "Pope Francis: A Man of His Word", "rating": "PG", "description": "Documentary filmmaker Wim Wenders travels the world with Pope Francis, recording the controversial pontiff's humanist views in a sharply divided age.\n"}, {"title": "Popeye", "rating": "PG", "description": "During a storm that wrecks his ship, super-strong sailor Popeye washes ashore and winds up rooming at the Oyl household, where he meets Olive.\n"}, {"title": "Poseidon", "rating": "PG-13", "description": "A tidal wave spells disaster for a ship of New Year's Eve revelers when it capsizes the mammoth vessel, sending passengers into a battle for survival.\n"}, {"title": "Poster Boys", "rating": "PG-13", "description": "Three men are stunned to find their faces on a poster promoting vasectomies, and must prove to their upset loved ones that they're innocent victims.\n"}, {"title": "Pottersville", "rating": "PG-13", "description": "A man's drunken romp in a gorilla suit gets him mistaken for Bigfoot, drawing media attention and tourist dollars to his struggling small town.\n"}, {"title": "Primal Fear", "rating": "R", "description": "When a blood-spattered altar boy is found running from a murder scene, his conviction seems certain – but his attorney is determined to win the case.\n"}, {"title": "Private Life", "rating": "R", "description": "Struggling to conceive, a couple in their 40s are almost out of options – until a sliver of hope arrives in the form of their visiting step-niece.\n"}, {"title": "Project Power", "rating": "R", "description": "An ex-soldier, a teen and a cop collide in New Orleans as they hunt for the source behind a dangerous new pill that grants users temporary superpowers.\n"}, {"title": "Prom Night", "rating": "PG-13", "description": "On prom night, a high school senior still struggling with her nightmare past tries to evade a killer bent on ending the party for her and her friends.\n"}, {"title": "Prospect", "rating": "R", "description": "A father and daughter travel to an alien moon in search of a valuable gem but are forced to alter their plans when a nefarious outlaw gets involved.\n"}, {"title": "Puerto Ricans in Paris", "rating": "R", "description": "New York police detectives Luis and Eddie experience culture shock and adventure when they head to Paris to track down a stolen couture handbag.\n"}, {"title": "Pulp Fiction", "rating": "R", "description": "This stylized crime caper weaves together stories featuring a burger-loving hit man, his philosophical partner and a washed-up boxer.\n"}, {"title": "Pup Star", "rating": "G", "description": "After a singing pup with big dreams of stardom gets dognapped and escapes with a friend's help, her journey home is a fun, music-filled adventure.\n"}, {"title": "Pup Star: Better 2Gether", "rating": "PG", "description": "Returning Pup Star champ Tiny has her Yorkie paws full after an evil rival replaces her with street dog Scrappy during the national competition.\n"}, {"title": "Pup Star: World Tour", "rating": "G", "description": "Talented pooches from around the world compete to be the next Pup Star, but behind-the-scenes schemes threaten to ruin the fun.\n"}, {"title": "Puppy Star Christmas", "rating": "PG", "description": "A new pack of Pup Star pooches stumbles upon a rival team’s plan to ruin Christmas, then ends up at the North Pole to try and save the holiday spirit.\n"}, {"title": "Pusher", "rating": "R", "description": "In this remake of a 1996 Danish thriller, a drug pusher incurs his suppliers' wrath when he gets busted and is left without the money he owes.\n"}, {"title": "Puss in Boots", "rating": "PG", "description": "The fabled feline heads to the Land of Giants with friends Humpty Dumpty and Kitty Softpaws on a quest to nab its greatest treasure: the Golden Goose.\n"}, {"title": "Quantum of Solace", "rating": "PG-13", "description": "Picking up an hour after the events of 2006's Casino Royale, this James Bond adventure finds 007 tracking a traitor who's infiltrated Britain's MI6.\n"}, {"title": "Quartet", "rating": "PG-13", "description": "A trio of retired opera singers' annual celebration of Verdi's birthday sours when their estranged fourth member shows up but refuses to sing.\n"}, {"title": "Queen of the Desert", "rating": "PG-13", "description": "Driven beyond the bounds of convention, adventurer Gertrude Bell leaves turn-of-the-century Britain behind for the deserts of the Middle East.\n"}, {"title": "Quigley Down Under", "rating": "PG-13", "description": "After traveling to Australia for a job, a sharpshooting cowboy becomes a target himself when he refuses an immoral assignment from a corrupt landowner.\n"}, {"title": "R.L. Stine's Mostly Ghostly", "rating": "PG", "description": "After discovering a pair of young ghosts, a nebbish 11-year-old agrees to help the sibling spirits solve the mystery surrounding their demise.\n"}, {"title": "ROMA", "rating": "R", "description": "Director Alfonso Cuarón delivers a vivid, emotional portrait of domestic life and social hierarchy set against Mexico's political turmoil of the 1970s.\n"}, {"title": "Race to Witch Mountain", "rating": "PG", "description": "A sister and brother with special powers are on the run from a mysterious organization that wants to take advantage of the siblings' gifts.\n"}, {"title": "Rachel Getting Married", "rating": "R", "description": "Longstanding family conflicts resurface when a former model who's been in and out of rehab for a decade returns home for her sister's wedding.\n"}, {"title": "Raging Bull", "rating": "R", "description": "This gritty biopic of brutal boxer Jake LaMotta portrays a tormented soul rising to the top of his sport, only to be undone by his demons.\n"}, {"title": "Rain Man", "rating": "R", "description": "A fast-talking yuppie is forced to slow down when he meets the brother he never knew he had, an unusually gifted autistic savant named Raymond.\n"}, {"title": "Raising Victor Vargas", "rating": "R", "description": "A suave teen sets his sights on a girl who seems beyond his reach. But his game can't be confined to his tiny apartment and family's old-school values.\n"}, {"title": "Ralph Breaks the Internet: Wreck-It Ralph 2", "rating": "PG", "description": "When video-game bad guy Ralph and best friend Vanellope discover a way onto the internet, they set off on a mission to save her broken game.\n"}, {"title": "Rango", "rating": "PG", "description": "When he becomes lost in the desert, pet chameleon Rango pretends he's a tough guy and ends up sheriff of a corrupt and violent frontier town.\n"}, {"title": "Real Steel", "rating": "PG-13", "description": "A struggling fighter-turned-promoter reconnects with his estranged son to convert an old-generation robot into a mighty World Robot Boxing contender.\n"}, {"title": "Rebecca", "rating": "PG-13", "description": "A young newlywed moves to her husband's imposing estate, where she must contend with his sinister housekeeper and the haunting shadow of his late wife.\n"}, {"title": "Rebel Without a Cause", "rating": "PG-13", "description": "When Jim Stark arrives in a new town with his troubled past firmly in tow, he quickly falls for the girl next door and befriends the vulnerable Plato.\n"}, {"title": "Red Dawn", "rating": "PG-13", "description": "A group of teenagers witnesses Soviet and Cuban paratroopers descending on their small Colorado town and systematically setting off World War III.\n"}, {"title": "Redemption", "rating": "R", "description": "An Afghanistan veteran haunted by his dark past takes on an assumed identity but must risk stepping into the light when his girlfriend is murdered.\n"}, {"title": "Reincarnated", "rating": "R", "description": "Vice magazine's Andy Capper follows rapper Snoop Dogg on a pilgrimage to Jamaica, where he rechristens himself Snoop Lion, a reggae artist.\n"}, {"title": "Remember", "rating": "R", "description": "Following the written instructions of his friend, senile Zev crosses the country to find and murder the Nazi who killed their families in Auschwitz.\n"}, {"title": "Remember Me", "rating": "PG-13", "description": "Tyler's still feeling lost following the tragedy that's strained his relationship with his father when he meets Ally, a girl who understands his pain.\n"}, {"title": "Rememory", "rating": "PG-13", "description": "A psychologist is murdered after unveiling a breakthrough invention that extracts memories, spurring a fixated former patient to hunt for answers.\n"}, {"title": "Resident Evil: Afterlife", "rating": "R", "description": "The Undead Apocalypse continues as super-soldier Alice finds her way to a supposed sanctuary in Los Angeles, which may just be a deadly trap.\n"}, {"title": "Results", "rating": "R", "description": "After an ugly divorce, a wealthy but unhappy man trains at a local gym and develops a strange relationship with the owner and a captivating trainer.\n"}, {"title": "Return To The 36th Chamber", "rating": "R", "description": "When thugs prey upon innocent factory workers, a small-time scammer trains for revenge by studying the moves of Shaolin temple monks.\n"}, {"title": "Revenge of the Green Dragons", "rating": "R", "description": "In gritty 1980s New York, two Chinese immigrant boys rise through the ranks of the infamous Green Dragons gang, where they're trained to kill.\n"}, {"title": "Revolt", "rating": "R", "description": "Following a devastating alien invasion, an American soldier and a French foreign aid worker attempt to find refuge in the Kenyan countryside.\n"}, {"title": "Revolutionary Road", "rating": "R", "description": " lives becomes their last hope to escape lives engulfed in emptiness.\n"}, {"title": "Ride Like a Girl", "rating": "PG", "description": "The daughter of a horse trainer, an ambitious girl sets her sights on becoming the first female jockey to win the Melbourne Cup. Based on a true story.\n"}, {"title": "Righteous Kill", "rating": "R", "description": "Two detectives investigate a rash of vigilante killings linked to an old case, suggesting they might have put an innocent man behind bars.\n"}, {"title": "Rising Phoenix", "rating": "PG-13", "description": "Elite athletes and insiders reflect on the Paralympic Games and examine how they impact a global understanding of disability, diversity and excellence.\n"}, {"title": "Rize", "rating": "PG-13", "description": " a fast-paced urban dance, and follows the man that originated the phenomenon in South Central Los Angeles.\n"}, {"title": "Road Trip: Beer Pong", "rating": "R", "description": "When three college pals hit the road to compete in a big-time beer pong tournament, their trip morphs into an outrageous odyssey.\n"}, {"title": "Rocky", "rating": "PG", "description": "Sylvester Stallone shot to fame as Rocky Balboa, an unknown fighter who's given a shot at fighting world champ Apollo Creed as a publicity stunt.\n"}, {"title": "Rocky II", "rating": "PG", "description": "Featuring a rousing climax, this engaging sequel finds boxer Rocky Balboa returning to the ring for a rematch against reigning champ Apollo Creed.\n"}, {"title": "Rocky III", "rating": "PG", "description": "After taking a pounding from a powerful young fighter, humbled world champ Rocky Balboa turns to ex-rival Apollo Creed for help in regaining his form.\n"}, {"title": "Rocky IV", "rating": "PG", "description": "Rocky Balboa takes on the Cold War, coming out of retirement to battle a Soviet fighter who pulverized Rocky's friend and former rival, Apollo Creed.\n"}, {"title": "Rocky V", "rating": "PG-13", "description": "Inspired by the memory of his trainer, a broke and seemingly careerless Rocky finds glory in training and takes on an up-and-coming boxer.\n"}, {"title": "Roger Corman's Death Race 2050", "rating": "R", "description": "In this dystopian sequel, kills equal points in a violently gory annual cross-country road race sponsored by the United Corporations of America.\n"}, {"title": "Rogue Warfare", "rating": "R", "description": "An elite international squad of uniquely skilled special forces is assembled to combat a rising underground terrorist threat in the Middle East.\n"}, {"title": "Rogue Warfare: The Hunt", "rating": "R", "description": "When their leader is captured by an extremist organization, a special forces team stages a perilous rescue mission as time runs out.\n"}, {"title": "Room", "rating": "R", "description": "Kidnapped, confined to a tiny room and raped, a young woman gives birth to a son. When he reaches his fifth birthday, she begins plotting an escape.\n"}, {"title": "Roped", "rating": "PG", "description": "A star cowboy in a traveling rodeo gets thrown off course when he falls in love with the daughter of a tough-minded town councilman.\n"}, {"title": "Rosemary's Baby", "rating": "R", "description": "A woman is thrilled to find out she's pregnant. But as her belly grows, the more certain she becomes that her unborn child is in serious danger.\n"}, {"title": "Rounders", "rating": "R", "description": " a fellow gambling addict and a club owner, and tensions run high when they must come up with $15k in just 5 days.\n"}, {"title": "Rugrats in Paris: The Movie", "rating": "G", "description": "The Rugrats take to the big screen and visit Paris when Mr. Pickles gets summoned to fix a giant robot at the EuroReptarland theme park.\n"}, {"title": "Rumble in the Bronx", "rating": "R", "description": "During a visit to the Bronx to help out at his uncle's store, a cheerful martial arts expert springs into action when a gang terrorizes the shop.\n"}, {"title": "Rumor Has It", "rating": "PG-13", "description": "\n"}, {"title": "Runaway Bride", "rating": "PG", "description": "Sparks fly when a newspaper columnist writes a one-sided, sexist story about a commitment-phobic bride who abandoned three men at the altar.\n"}, {"title": "Russell Madness", "rating": "PG", "description": "A spunky terrier named Russell with serious wrestling chops becomes a sports phenomenon with the help of his coach, a monkey named Hunk.\n"}, {"title": "Rust Creek", "rating": "R", "description": "A wrong turn in the woods becomes a fight for her life when a career-seeking college student runs into two outlaw brothers looking to cook up trouble.\n"}, {"title": "S.W.A.T.", "rating": "PG-13", "description": "A veteran cop is tasked with drafting and training a special weapons and tactics team, who soon find themselves up against an international criminal.\n"}, {"title": "SMOSH: The Movie", "rating": "PG-13", "description": "To keep his teen crush from spotting him in an embarrassing YouTube video, Anthony and his friend Ian must enter the virtual world and alter the clip.\n"}, {"title": "SPF-18", "rating": "PG-13", "description": "The arrival of an enigmatic struggling musician in Malibu shakes the ground beneath the feet of a teenage girl and her surfer boyfriend.\n"}, {"title": "Safety Not Guaranteed", "rating": "R", "description": "A team of journalists are sent to find out who's behind a classified ad seeking a companion for time travel, then must decide how to approach him.\n"}, {"title": "Same Kind of Different as Me", "rating": "PG-13", "description": "A wealthy couple whose marriage is on the rocks befriends a local homeless man who changes their perspectives in this inspiring true story.\n"}, {"title": "Samson", "rating": "PG-13", "description": "The Biblical story of Samson becomes this sword-and-sandals epic about an Israelite warrior whose God-given brawn is undone by a beautiful temptress.\n"}, {"title": "Sarah's Key", "rating": "PG-13", "description": "Paris, 1942: To protect her brother from the police arresting Jewish families, a young girl hides him away, promising to come back for him.\n"}, {"title": "Saving Mr. Banks", "rating": "PG-13", "description": " the book's author proves a tough nut to crack.\n"}, {"title": "Saving Zoë", "rating": "R", "description": "A reserved high school freshman acts out when she recovers a diary that offers clues to a secret world that could be behind her sister's murder.\n"}, {"title": "Say When", "rating": "R", "description": "Desperately clinging to her youth, 28-year-old Megan tells her boyfriend she's attending a career seminar but hangs out with a teenage friend instead.\n"}, {"title": "Scales: Mermaids Are Real", "rating": "PG", "description": "A seemingly ordinary girl learns she will turn into a mermaid on her 12th birthday and be forced to leave her life on land behind.\n"}, {"title": "Scary Movie", "rating": "R", "description": "The Wayans brothers spoof some of Hollywood's biggest blockbusters, including Scream, I Know What You Did Last Summer, The Matrix and American Pie.\n"}, {"title": "Scary Movie 5", "rating": "PG-13", "description": " widens the franchise's scope of mockery.\n"}, {"title": "Schindler's List", "rating": "R", "description": "Oskar Schindler becomes an unlikely humanitarian, spending his entire fortune to help save 1,100 Jews from Auschwitz during World War II.\n"}, {"title": "School Daze", "rating": "R", "description": "At a Historically Black College, a student activist and his cousin pledging a fraternity navigate social divides amid parties, protests and conflicts.\n"}, {"title": "Scorpion King 5: Book of Souls", "rating": "PG-13", "description": "The Scorpion King joins forces with a Nubian princess in an all-or-nothing fight to stop a warlord from claiming the souls of the vanquished.\n"}, {"title": "Scott Pilgrim vs. the World", "rating": "PG-13", "description": "Dreamy delivery girl Ramona captures Scott Pilgrim's heart, but he must vanquish all seven of her evil exes in martial arts battles to win her love.\n"}, {"title": "Scream 2", "rating": "R", "description": "Gale has written a best-seller which has been turned into a film. As the movie premiere looms closer, the mysterious deaths begin again.\n"}, {"title": "Scream 3", "rating": "R", "description": "This installment of the tongue-in-cheek horror franchise finds Sidney Prescott once again battling a crazed killer – this time, on a movie set.\n"}, {"title": "Search Party", "rating": "R", "description": "Two guys hope to reunite their friend with his runaway bride, unaware that he's been carjacked, stripped and stranded in the Mexican desert.\n"}, {"title": "Searching for Bobby Fischer", "rating": "PG", "description": "When a father learns that his 7-year-old son is a whiz at speed chess, he hires an implacable chess master to coach the boy for competitions.\n"}, {"title": "Searching for Sugar Man", "rating": "PG-13", "description": "Decades after Detroit singer-songwriter Rodriguez disappeared following the commercial failure of his albums, two fans try to track down their idol.\n"}, {"title": "Season of the Witch", "rating": "PG-13", "description": "A group of weary warriors transport a suspected witch believed to be responsible for spreading the devastating Black Plague.\n"}, {"title": "Secret in Their Eyes", "rating": "PG-13", "description": "A former FBI investigator reopens the haunting 13-year-old murder case of his colleague, only to uncover shocking truths hidden since then.\n"}, {"title": "Security", "rating": "R", "description": "After taking a job as a mall security guard, a former Marine steps up to protect a young girl who's being hunted by heavily armed mercenaries.\n"}, {"title": "Selfless", "rating": "PG-13", "description": "A dying tycoon has his consciousness transplanted into the body of a healthy young man, only to make a troubling discovery about the body's origin.\n"}, {"title": "Senna", "rating": "PG-13", "description": "This fast-paced documentary profiles Ayrton Senna, one of the greatest drivers in the history of Formula One racing, and a hero in his native Brazil.\n"}, {"title": "Septembers of Shiraz", "rating": "PG-13", "description": "In post-revolution Tehran, a wealthy Jewish businessman is summarily jailed and tortured, but along with his wife, he fights for answers and freedom.\n"}, {"title": "Sergio", "rating": "R", "description": "Passions, ideals and bitter realities collide as charismatic UN diplomat Sergio Vieira de Mello becomes trapped in a life-threatening situation in Iraq.\n"}, {"title": "Set Up", "rating": "R", "description": "A diamond heist goes horribly wrong, and the group of friends who sought to make a fortune must instead fight for their very survival.\n"}, {"title": "Seven Pounds", "rating": "PG-13", "description": "Weighed down by a dark secret, IRS agent Ben Thomas tries to improve the lives of seven strangers in need of a second chance.\n"}, {"title": "Seven in Heaven", "rating": "PG-13", "description": "Two teenagers step into a secret closet and emerge in a terrifying alternate reality. They must find their way back before the door shuts forever.\n"}, {"title": "Seventh Son", "rating": "PG-13", "description": "In the 18th century, apprentice exorcist Tom Ward is the lynchpin in a battle between good and evil when imprisoned witch Mother Malkin escapes.\n"}, {"title": "Sex Drive", "rating": "R", "description": "Eager to hook up with a woman he met online, 18-year-old Ian embarks on an epic road trip that speeds straight toward trouble in this raunchy comedy.\n"}, {"title": "Sex and the City 2", "rating": "R", "description": "Best friends Carrie, Miranda, Samantha and Charlotte take a break from their busy New York lives for an all-expenses-paid luxury vacation to Abu Dhabi.\n"}, {"title": "Sex and the City: The Movie", "rating": "R", "description": "When Carrie's big step forward in her relationship goes awry, best friends Charlotte, Miranda and Samantha are there to help her pick up the pieces.\n"}, {"title": "Sexo, Pudor y Lagrimas\"", "rating": "R", "description": "Passions flare and alliances form when neighbors Ana and Miguel each start an affair with former lovers, right under their spouses' noses.\n"}, {"title": "Shark Night", "rating": "PG-13", "description": "A weekend of beach-house debauchery turns into a nightmare for a group of friends when they discover that the waters are infested with vicious sharks.\n"}, {"title": "She's Out of My League", "rating": "R", "description": "When average-guy Kirk starts dating drop-dead-gorgeous Molly, his friends don't see it lasting, so Kirk does everything he can to avoid losing Molly.\n"}, {"title": "Shelter", "rating": "R", "description": "A forensic psychiatrist has to think outside the box when she takes on a patient whose multiple personalities lead to a trail of murder victims.\n"}, {"title": "Shepherds and Butchers", "rating": "R", "description": "When a young prison guard commits murder in South Africa, an ardent lawyer aims to prove he was psychologically unbalanced by his role in executions.\n"}, {"title": "Sherlock Holmes", "rating": "PG-13", "description": "The game is afoot for an eccentric detective who must use his brains and brawn to track down a nefarious nemesis with the help of his partner.\n"}, {"title": "Short Term 12", "rating": "R", "description": "A new charge at a foster care facility dredges up the memories of a young supervisor's own troubled past, and her tough exterior begins eroding.\n"}, {"title": "Shorts", "rating": "PG", "description": "Chaos erupts when locals learn that an 11-year-old boy has discovered a mysterious rock that grants the wishes of whoever possesses it.\n"}, {"title": "Shot Caller", "rating": "R", "description": "Trying to go straight, a once-successful businessman fresh out of prison is forced to orchestrate a brazen crime or risk his family.\n"}, {"title": "Sierra Burgess Is A Loser", "rating": "PG-13", "description": "A wrong-number text sparks a virtual romance between a smart but unpopular teen and a sweet jock who thinks he's talking to a gorgeous cheerleader.\n"}, {"title": "Silent Hill: Revelation", "rating": "R", "description": "Haunted by nightmares and her father's disappearance, Heather goes on the hunt for him – and discovers a disturbing truth about her own identity.\n"}, {"title": "Silver Linings Playbook", "rating": "R", "description": "After a stint in a mental hospital, Pat moves in with his parents and tries to win back his wife, until he meets a woman who's as unstable as he is.\n"}, {"title": "Singularity", "rating": "PG-13", "description": "Nearly a century after artificial intelligence tried to eradicate people from Earth, two survivors search for a human enclave rumored to still exist.\n"}, {"title": "Sinister 2", "rating": "R", "description": "A single mother and her twin sons move into a rural house, unaware of its history of being inhabited by an evil spirit that preys upon young children.\n"}, {"title": "Sister Code", "rating": "R", "description": "After the death of their beloved mother, three foster sisters find their bond tested by old grudges, career tensions and a startling revelation.\n"}, {"title": "Skin Trade", "rating": "R", "description": "A New Jersey detective whose family was killed by an international gangster teams up with a Bangkok cop on a quest to bring down a criminal empire.\n"}, {"title": "Skiptrace", "rating": "PG-13", "description": "To capture a crime lord who killed his partner and kidnapped his partner's daughter, a Hong Kong detective teams with a smart aleck American gambler.\n"}, {"title": "Skyline", "rating": "PG-13", "description": "After a wild night of partying, Terry discovers that he's one of the few people left on Earth, then sets out to solve the mystery of what happened.\n"}, {"title": "Sleeping with Other People", "rating": "R", "description": "Many years after hooking up in college, two people cross paths and realize they are both serial philanderers who need each other's help to reform.\n"}, {"title": "Sleepover", "rating": "PG", "description": "As high school approaches, four best friends have a summer sleepover and participate in a scavenger hunt against their popular archrivals.\n"}, {"title": "Sling Blade", "rating": "R", "description": "A man returns home after being released from a psychiatric hospital, where he'd been confined since age 12 for murdering his mother and her lover.\n"}, {"title": "Sliver", "rating": "R", "description": "A divorcée moves into a high-rise with a sordid past and begins a steamy affair with her neighbor, unaware that her every move is being monitored.\n"}, {"title": "Slow West", "rating": "R", "description": "Determined to find the woman he loves, a Scottish teenager braves the Western frontier of 19th-century America, with bounty hunters hot on his trail.\n"}, {"title": "Small Soldiers", "rating": "PG-13", "description": "When the Commando Elite, a group of toy action figures, are released before they've been tested, they attack the children playing with them.\n"}, {"title": "Small Town Crime", "rating": "R", "description": "When a disgraced ex-cop discovers a dying woman, he's compelled to track down her killer – an act of self-redemption that takes him down a dark path.\n"}, {"title": "Smart People", "rating": "R", "description": "An unexpected romance and a surprise visit from his wild brother turn the life of widowed professor Lawrence Wetherhold upside down.\n"}, {"title": "Sniper: Special Ops", "rating": "R", "description": "After a mission to rescue a U.S. congressman from the Taliban ends with two men left behind, their sniper buddies go against orders to get them back.\n"}, {"title": "Snow Day", "rating": "PG", "description": "When a snow day shuts down the whole town, the Wheeler family cuts loose. Hal makes a play for the most popular girl in his school, 10-year-old Natalie takes on the dreaded snowplow man, and Dad gets into a showdown with a rival meteorologist.\n"}, {"title": "Snowden", "rating": "R", "description": "This thriller traces Edward Snowden's journey from Army recruit to disillusioned government analyst bent on exposing vast U.S. surveillance programs.\n"}, {"title": "Snowpiercer", "rating": "R", "description": "The Earth's remaining inhabitants are confined to a single train circling the globe as revolution brews among the class-divided cars.\n"}, {"title": "Solo: A Star Wars Story", "rating": "PG-13", "description": "A young Han Solo tries to settle an old score with the help of his new buddy Chewbacca, a crew of space smugglers and a cunning old friend.\n"}, {"title": "Solo: A Star Wars Story (Spanish Version)", "rating": "PG-13", "description": "A young Han Solo tries to settle an old score with the help of his new buddy Chewbacca, a crew of space smugglers and a cunning old friend.\n"}, {"title": "Solomon Kane", "rating": "R", "description": "In this epic tale, a once-murderous sea captain is holed up in a monastery in retreat from the devil, whom the captain fears is coming for his soul.\n"}, {"title": "Someone Great", "rating": "R", "description": "On the heels of a blindsiding breakup, music journalist Jenny braces for a new beginning – and one last adventure with her closest friends.\n"}, {"title": "Something's Gotta Give", "rating": "PG-13", "description": "Still sexy at 60, Harry Sanborn wines and dines women half his age. But a getaway with his girlfriend goes awry when her mother drops in unannounced.\n"}, {"title": "Son of a Gun", "rating": "R", "description": "A young petty thief who received protection from a notorious inmate in jail is forced to spring his defender from prison and help pull off a heist.\n"}, {"title": "Soul Surfer", "rating": "PG", "description": "Hawaiian teen Bethany Hamilton bravely returns to competitive surfing after losing her left arm in a vicious shark attack.\n"}, {"title": "Space Cowboys", "rating": "PG-13", "description": "A retired engineer agrees to help NASA prevent a Russian satellite from falling to Earth if he and his over-the-hill pals can man the mission.\n"}, {"title": "Sparkle", "rating": "PG", "description": "In 1950s Harlem, three singing sisters hit the big time and end up losing one another in this musical melodrama inspired by the Supremes.\n"}, {"title": "Speech & Debate", "rating": "PG-13", "description": "Fed up with the hypocrisy of the adults around them, three creative high school misfits revive an old debate club as a way to fight back.\n"}, {"title": "Spenser Confidential", "rating": "R", "description": "Spenser, an ex-cop and ex-con, teams up with aspiring fighter Hawk to uncover a sinister conspiracy tied to the deaths of two Boston police officers.\n"}, {"title": "Spider-Man 3", "rating": "PG-13", "description": "The seemingly invincible Spider-Man goes up against an all-new crop of villains in the third installment of the blockbuster adventure series.\n"}, {"title": "Spider-Man: Into the Spider-Verse", "rating": "PG", "description": "After being bitten by a radioactive spider, Brooklyn teen Miles Morales gets a crash course in web-slinging from his alternate-dimension counterparts.\n"}, {"title": "Spookley the Square Pumpkin", "rating": "G", "description": "When a storm terrorizes his patch, a pumpkin cast out for his shape must step up to use his smarts to save the day – and to prove himself.\n"}, {"title": "Spotlight", "rating": "R", "description": "A team of reporters and editors at the Boston Globe relentlessly investigate a shocking child molestation cover-up by the Catholic Church.\n"}, {"title": "Spring Breakers", "rating": "R", "description": "Four cash-strapped college women run afoul of the law — and fall in with a shady hustler — as they join the annual rite of bikinis, beer and debauchery.\n"}, {"title": "Spy Kids", "rating": "PG", "description": "The tables are turned when pint-sized kids Carmen and Juni must rescue their secret-agent parents from the diabolical clutches of Alexander Minion.\n"}, {"title": "Spy Kids 2: The Island of Lost Dreams", "rating": "PG", "description": "Spy kids Carmen and Juni Cortez team up with two other pint-size secret agents, Gary and Gerti Giggles, in order to take on an evil scientist.\n"}, {"title": "Spy Kids 3: Game Over", "rating": "PG", "description": "Carmen gets caught in a virtual reality game designed by the kids' new nemesis, the Toymaker, and it's up to Juni to save her by beating the game.\n"}, {"title": "Spy Kids: All the Time in the World", "rating": "PG", "description": "Former Spy Kids Carmen and Juni return to help twin siblings Rebecca and Cecil Wilson save the world with their retired secret-agent stepmother.\n"}, {"title": "Standoff", "rating": "R", "description": "After witnessing an assassin's slaughter, a young girl holes up in a farmhouse with a suicidal vet, who must use wits and guts to fend off the killer.\n"}, {"title": "Star Wars: Episode VIII: The Last Jedi", "rating": "PG-13", "description": "As the remnants of the Resistance flee Kylo Ren and the First Order, Rey seeks out Luke Skywalker – but he wants nothing more to do with the Force.\n"}, {"title": "Stardust", "rating": "PG-13", "description": "To win his true love's heart, wide-eyed Tristan Thorn journeys to a forbidden realm to retrieve a fallen star that has taken human form.\n"}, {"title": "Starsky & Hutch", "rating": "PG-13", "description": "New undercover cop partners Starsky and Hutch must overcome their differences to solve an important case with help from street informant Huggy Bear.\n"}, {"title": "Step Brothers", "rating": "R", "description": "Brennan and Dale might be grown men, but that doesn't stop a childish sibling rivalry from erupting after Brennan's mom marries Dale's dad.\n"}, {"title": "Step Sisters", "rating": "PG-13", "description": "With her Harvard Law dreams on the line, a black sorority leader agrees to help a rhythmically challenged sisterhood win a step dance championship.\n"}, {"title": "Stephanie", "rating": "R", "description": "A menacing, unseen force stalks a young girl living by herself in a suburban house, where she's surrounded by reminders of her once-happy family.\n"}, {"title": "Steve Jobs", "rating": "R", "description": "By keying in on three crucial points in his career, this biopic shows the human foibles and visionary fearlessness of the man who made the Mac.\n"}, {"title": "Stonehearst Asylum", "rating": "PG-13", "description": "In 1899, a young doctor arrives at an asylum for an apprenticeship and becomes suspicious of his mentor's methods while falling for a female patient.\n"}, {"title": "Strange Weather", "rating": "R", "description": "A grieving mother takes a road trip with her friend to confront the man who, she believes, stole her late son's business idea to get rich.\n"}, {"title": "Strange but True", "rating": "PG-13", "description": "A young woman rattles her former boyfriend’s family when she reveals she is pregnant with his child — despite his death five years ago.\n"}, {"title": "Stranger than Fiction", "rating": "PG-13", "description": "As a writer ponders how to kill off her main character, the man begins hearing her voice in his head and realizes that his days are numbered.\n"}, {"title": "Strictly Ballroom", "rating": "PG", "description": "Dumped by his partner just before a major dance competition, gifted hoofer Scott Hastings is forced to take a graceless neophyte as his new partner.\n"}, {"title": "Stripes", "rating": "R", "description": "After losing everything, an indolent sad sack impulsively joins the U.S. Army and cajoles his best friend into enlisting, too.\n"}, {"title": "Striptease", "rating": "R", "description": "A former FBI employee works as a stripper to finance her custody battle for her daughter when a secretly shady congressman takes an interest in her.\n"}, {"title": "Stuart Little", "rating": "PG", "description": "Mr. and Mrs. Little want to adopt a brother for their only child but get more than they bargained for when they take in a mouse with an attitude.\n"}, {"title": "Stuart Little 2", "rating": "PG", "description": "Zany misadventures are in store as lovable city mouse Stuart and his human brother, George, raise the roof in this sequel to the 1999 blockbuster.\n"}, {"title": "Suffragette", "rating": "PG-13", "description": "At the beginning of the 20th century, circumstances drive a young, idealistic suffragette to find radical approaches to fighting male oppression.\n"}, {"title": "Sunday's Illness", "rating": "PG-13", "description": "Decades after being abandoned as a young child, Chiara finds her mother and asks her to spend 10 days together in a remote location.\n"}, {"title": "Superbad", "rating": "R", "description": "Hoping to have sex before college, high school seniors Seth and Evan try to score booze for a huge party, leading to a series of wild misadventures.\n"}, {"title": "Superfly", "rating": "R", "description": "To get away from the thug life, cocaine dealer Youngblood Priest puts together one last deal that will net him enough money to start over.\n"}, {"title": "Superman Returns", "rating": "PG-13", "description": "When Superman returns to Metropolis, he finds that Lois Lane has moved on to another man and Lex Luthor is developing a new plan to rule the world.\n"}, {"title": "Superstar", "rating": "PG-13", "description": "A socially awkward Catholic schoolgirl vows to win a dreamy classmate’s affections by taking first prize at an upcoming talent show.\n"}, {"title": "Surf's Up", "rating": "PG", "description": "This Oscar-nominated animated comedy goes behind the scenes at the Penguin World Surfing Championship to get a close-up look at the inventors of surfing.\n"}, {"title": "Swearnet: The Movie", "rating": "NC-17", "description": "After losing a TV network deal, the Trailer Park Boys launch their own Internet series, but they soon confront personal and creative differences.\n"}, {"title": "Sweeney Todd: The Demon Barber of Fleet Street", "rating": "R", "description": "After being falsely imprisoned, a vengeful murderer covers his tracks by enlisting the help of a baker whose meat pies become the toast of London.\n"}, {"title": "Sweet Virginia", "rating": "R", "description": "In a remote Alaskan town reeling from a sudden triple murder, a former rodeo champ befriends a lone newcomer with a violent occupation.\n"}, {"title": "Sweetheart", "rating": "PG-13", "description": "A woman shipwrecked on a remote island discovers she’s not alone and begins a fight for survival against a deadly presence that emerges each night.\n"}, {"title": "Swiss Army Man", "rating": "R", "description": "A washed-up corpse with surprising abilities gives a hopeless man stranded in the wilderness someone to talk to – and a newfound reason to live.\n"}, {"title": "Sword Masters: Two Champions of Shaolin", "rating": "R", "description": "Shaolin warrior Tung Chien-chen is injured in battle against the hated Wu Tang clan, and nursed back to health by a knife-throwing master. As he recovers, Tung learns this deadly art, and also falls in love with his teacher's daughter.\n"}, {"title": "Swordfish", "rating": "R", "description": "Determined to get his mitts on $9 billion in a secret DEA account so he can fight terrorism, a rogue agent recruits an encryption expert to hack in.\n"}, {"title": "TAU", "rating": "R", "description": "Kidnapped by an inventor who uses her as a test subject to perfect his robotic AI, a street-smart young woman tries to escape her high-tech prison.\n"}, {"title": "THE RUM DIARY", "rating": "R", "description": "Johnny Depp stars in this adaptation of Hunter S. Thompson's novel about a boozy journalist who moves to Puerto Rico and falls for a taken woman.\n"}, {"title": "Taare Zameen Par", "rating": "PG", "description": "When daydreamer Ishaan is sent to boarding school, an unconventional art teacher tries to help the imaginative student discover his true identity.\n"}, {"title": "Take Me Home Tonight", "rating": "R", "description": "Set in the financial boom of the late 1980s, this tale centers on a recent college grad trying to figure out what to do with his life.\n"}, {"title": "Takers", "rating": "PG-13", "description": "A motley crew of bank robbers plans their next heist after a former colleague convinces them to target an armored car carrying $20 million.\n"}, {"title": "Tales From the Hood 2", "rating": "R", "description": "Buckle up for an anthology of socially conscious horror stories that focus on the perils of racial injustice and the price of ignorance.\n"}, {"title": "Tarzan", "rating": "G", "description": "After being shipwrecked off the African coast, a lone child grows up in the wild, and is destined to become lord of the jungle.\n"}, {"title": "Tarzan 2", "rating": "G", "description": "How did the King of the Jungle ascend to the throne? Find out in this charming prequel to the hit animated movie that catches Tarzan as a young child.\n"}, {"title": "Taxi Driver", "rating": "R", "description": "Enraged by New York's moral rot and urban decay, an unhinged cab driver goes mad, plotting an assassination and saving a teen sex worker.\n"}, {"title": "Tears of the Sun", "rating": "R", "description": "A Navy SEAL is sent to a war-torn African jungle to rescue a doctor, only to realize he must also save the refugees in the physician's care.\n"}, {"title": "Teenage Mutant Ninja Turtles", "rating": "PG", "description": "In this animated adventure, Master Splinter whips the four Ninja Turtles back into shape to defeat monsters running amok in New York.\n"}, {"title": "Teenage Mutant Ninja Turtles II: The Secret of the Ooze", "rating": "PG", "description": "The evil Shredder decides that ooze is what gives the ninja turtles their power, so he obtains some of the toxic junk and creates dangerous mutants.\n"}, {"title": "Teenage Mutant Ninja Turtles: The Movie", "rating": "PG", "description": "After exposure to a strange, glowing ooze, four mutant turtles train as ninjas in the sewers and fight crime wherever they find it.\n"}, {"title": "Term Life", "rating": "R", "description": "After a botched job, a heist mastermind must run from gangsters and stay alive long enough for his daughter to benefit from his life insurance policy.\n"}, {"title": "Terminator 3: Rise of the Machines", "rating": "R", "description": "Ten years after John Connor saved Earth from Judgment Day, he encounters T-X, a robotic assassin ordered to finish what T-1000 started.\n"}, {"title": "Terminator Salvation", "rating": "PG-13", "description": "All grown up in post-apocalyptic 2018, John Connor must lead the resistance of humans against increasingly dominating militaristic robots.\n"}, {"title": "The Adderall Diaries", "rating": "R", "description": "Author Stephen Elliott has a problem separating his own life from incidents in the life of a convicted murderer about whom he's writing a book.\n"}, {"title": "The Adventures of Sharkboy and Lavagirl", "rating": "PG", "description": "A 10-year-old dreamer's imaginary friends – mighty Sharkboy and fire-producing Lavagirl – come to life to seek his help battling a nefarious baddie.\n"}, {"title": "The Adventures of Tintin", "rating": "PG", "description": "This 3-D motion capture adapts Georges Remi's classic comic strip about the adventures of fearless young journalist Tintin and his trusty dog, Snowy.\n"}, {"title": "The American President", "rating": "PG-13", "description": "The widowed president strikes up a romance with a beautiful Washington lobbyist – but can the couple keep their private and political lives separate?\n"}, {"title": "The Amityville Horror", "rating": "R", "description": "This hair-raising remake of the 1979 horror hit depicts the ordeal of the Lutz family, whose new home has a gory past and a legacy of demons.\n"}, {"title": "The Angry Birds Movie 2", "rating": "PG", "description": "Enemies turn into frenemies when the Pigs call for a truce with the Birds to unite against a formidable new foe that’s threatening all of their homes.\n"}, {"title": "The Art of War", "rating": "R", "description": "Framed for the murder of an ambassador, a former member of the United Nations' elite covert action unit will do whatever it takes to clear his name.\n"}, {"title": "The Art of the Steal", "rating": "R", "description": "Crunch Calhoun, a daredevil motorcyclist and mostly reformed con artist, agrees to do one last job: helping his brother Nicky steal a priceless book.\n"}, {"title": "The Artist", "rating": "PG-13", "description": "Winner of five Oscars, this black-and-white silent film follows the romance between a silent-era legend on a downward spiral and a rising starlet.\n"}, {"title": "The Assignment", "rating": "R", "description": "A hitman has his body surgically altered into a woman's against his will. Now he has to track down the surgeon responsible and get his revenge.\n"}, {"title": "The Autopsy of Jane Doe", "rating": "R", "description": "A father-son team of small-town coroners performs an autopsy on an unidentified woman with mysterious injuries and a terrifying secret.\n"}, {"title": "The B-Side: Elsa Dorfman's Portrait Photography", "rating": "R", "description": "Filmmaker Errol Morris probes the life, work and studio of his pal Elsa Dorfman, a Polaroid photographer who's shot luminaries and regular folk alike.\n"}, {"title": "The Bad Batch", "rating": "R", "description": "Banished to a wasteland of undesirables, a young woman struggles to find her feet among a drug-soaked desert society and an enclave of cannibals.\n"}, {"title": "The Ballad of Buster Scruggs", "rating": "R", "description": "Ranging from absurd to profound, these Western vignettes from the Coen brothers follow the adventures of outlaws and settlers on the American frontier.\n"}, {"title": "The Ballad of Lefty Brown", "rating": "R", "description": "After his longtime partner is assassinated, a slow-footed cowboy sets out to find his killer and uncovers a conspiracy engineered by some powerful men.\n"}, {"title": "The Black Prince", "rating": "PG-13", "description": "After being exiled to England as a child, a Punjabi prince struggles to return to his homeland and his Sikh faith in this historical drama.\n"}, {"title": "The Blackcoat's Daughter", "rating": "R", "description": "When their parents fail to pick them up for winter break, two students stay on at an all-girls boarding school in the company of a terrible presence.\n"}, {"title": "The Bleeder", "rating": "R", "description": "Husband. Father. Fighter. Meet Chuck Wepner, the liquor salesman and self-proclaimed real-life inspiration behind Rocky Balboa.\n"}, {"title": "The Bling Ring", "rating": "R", "description": "Based on fact, this comic thriller tracks the saga of the Hollywood Hills Burglar Bunch, who used the Web to time their robberies of stars' homes.\n"}, {"title": "The Book of Eli", "rating": "R", "description": "Determined to protect a sacred text that promises to save humanity, Eli goes on a quest westward across the barren, postapocalyptic country.\n"}, {"title": "The Bounty Hunter", "rating": "PG-13", "description": "Bounty hunter Milo Boyd finds his latest assignment downright satisfying as he learns that the bail-jumper he must chase down is his ex-wife, Nicole.\n"}, {"title": "The Box", "rating": "PG-13", "description": "A couple must decide whether to push a button that will net them a million dollars but that will also cause the death of a complete stranger.\n"}, {"title": "The Boy", "rating": "PG-13", "description": "A nanny is hired by a couple to look after their boy. She's shocked to learn that her charge is actually a doll that the couple treats like a human.\n"}, {"title": "The Boy in the Striped Pajamas", "rating": "PG-13", "description": "When his family moves from Berlin to Poland, a young boy befriends a boy who lives on the other side of the fence, unaware he's a Jewish prisoner.\n"}, {"title": "The Boys in the Band", "rating": "R", "description": "At a birthday party in 1968 New York, a surprise guest and a drunken game leave seven gay friends reckoning with unspoken feelings and buried truths.\n"}, {"title": "The Brave One", "rating": "R", "description": "New York City radio host Erica Bain decides to take the law into her own hands after losing her fiancé in a brutal Central Park attack.\n"}, {"title": "The Breadwinner", "rating": "PG-13", "description": "A courageous 11-year-old Afghan girl disguises herself as a boy and takes on odd jobs to provide for her family when her father is arrested.\n"}, {"title": "The Break-Up", "rating": "PG-13", "description": "Cohabitating couple Gary and Brooke's petty spats turn into an all-out battle for their home condo.\n"}, {"title": "The Brothers Grimm", "rating": "PG-13", "description": "Brothers Jake and Will Grimm travel from village to village, posing as exterminators of magical creatures. But in reality, they're expert con artists.\n"}, {"title": "The Bucket List", "rating": "PG-13", "description": "Two terminally ill men bust out of the cancer ward with a plan to experience life to the fullest before they kick the bucket.\n"}, {"title": "The Bye Bye Man", "rating": "PG-13", "description": "Three college students move into an off-campus house and discover they've unwittingly unleashed a supernatural killer known as the Bye Bye Man.\n"}, {"title": "The Captive", "rating": "R", "description": "Eight years after their daughter's abduction tore them apart, her parents receive enigmatic clues from the kidnapper hinting that she's still alive.\n"}, {"title": "The Car", "rating": "PG", "description": "In his small Southwestern town, sheriff Wade Parent must find out who — or what — is running people down via a mysterious, driverless black sedan.\n"}, {"title": "The Charnel House", "rating": "R", "description": "After an architect transforms a slaughterhouse into trendy lofts, its new inhabitants discover that the structure is haunted by its evil past.\n"}, {"title": "The Christmas Candle", "rating": "PG", "description": "A progressive new minister's arrival in a small village threatens to end an age-old tradition that brings a yuletide miracle to one of the residents.\n"}, {"title": "The Christmas Chronicles: Part Two", "rating": "PG", "description": "Unhappy over her mom’s new relationship, a now-teenage Kate runs away and lands at the North Pole, where a naughty elf is plotting to cancel Christmas.\n"}, {"title": "The Clapper", "rating": "R", "description": "A newcomer ekes out a living in LA as a professional audience member on infomercials, but life gets complicated when he's thrust into the spotlight.\n"}, {"title": "The Cloverfield Paradox", "rating": "PG-13", "description": "Orbiting above a planet on the brink of war, scientists test a device to solve an energy crisis and end up face-to-face with a dark alternate reality.\n"}, {"title": "The Command", "rating": "PG-13", "description": "For the crew trapped aboard a sunken Russian submarine the deadliest threat is the bureaucracy on land. Based on a true story.\n"}, {"title": "The Company Men", "rating": "R", "description": "A successful businessman comes face-to-face with America's downsizing epidemic when he loses his job and is forced to take a construction gig.\n"}, {"title": "The Con Is On", "rating": "R", "description": "Two wedded partners-in-crime flee from their massive debt to a deadly crime boss and hatch a jewel heist that could be their ticket to total freedom.\n"}, {"title": "The Confirmation", "rating": "PG-13", "description": "A divorced handyman with a drinking problem bonds with his 8-year-old son when a search for his stolen toolbox leads to a series of misadventures.\n"}, {"title": "The Conjuring", "rating": "R", "description": "Based on true events, this spine-chiller tells the story of a New England family who begins having encounters with spirits in their farmhouse.\n"}, {"title": "The Craft", "rating": "R", "description": "At a Catholic school, a new girl falls in with a clique of teen witches who wield their powers against anyone who crosses them, even their parents.\n"}, {"title": "The Croods", "rating": "PG", "description": "When an earthquake obliterates their cave, an unworldly prehistoric family is forced to journey through unfamiliar terrain in search of a new home.\n"}, {"title": "The Crow", "rating": "R", "description": "One year after Eric Draven and his fiancée are murdered, Draven – watched over by a hypnotic crow – returns from the grave to exact revenge.\n"}, {"title": "The Crying Game", "rating": "R", "description": "IRA terrorist Fergus bonds with his prisoner, Jody. Jody tells Fergus of his girlfriend, Dil, with whom Fergus later falls in love.\n"}, {"title": "The D Train", "rating": "R", "description": "A loser in charge of planning his high school class's 20-year reunion thinks he's scored a major coup when he gets a marginally famous alum to attend.\n"}, {"title": "The Da Vinci Code", "rating": "PG-13", "description": "When the curator of the Louvre is killed, a Harvard professor and a cryptographer must untangle a web of deceit involving works of Leonardo da Vinci.\n"}, {"title": "The Danish Girl", "rating": "R", "description": "In 1920s Denmark, married artists embark on a journey of unconditional love when the husband announces his intentions to live life as a woman.\n"}, {"title": "The Dark Crystal", "rating": "PG", "description": "In this mythical tale, Jen, the last of the Gelfling race, is charged with healing the Crystal of Truth after its mutilation sets off an era of terror.\n"}, {"title": "The Darkness", "rating": "PG-13", "description": "After bringing home a set of mysterious stones from the Grand Canyon, a boy unleashes an ancient force that begins to terrorize his family.\n"}, {"title": "The Death of Mr. Lazarescu", "rating": "R", "description": "The plot of Romanian director Cristi Puiu's real-time drama is simple, following the travails of an ailing old man who waits for his illness to overtake him as a weary paramedic shuttles him between hospitals.\n"}, {"title": "The Death of Stalin", "rating": "R", "description": "The death of Russian dictator Joseph Stalin throws the Soviet Union into comic chaos as his ambitious but addled ministers maneuver to succeed him.\n"}, {"title": "The Departed", "rating": "R", "description": "Two rookie Boston cops are sent deep undercover – one inside the gang of a charismatic Irish mob boss and the other double-crossing his own department.\n"}, {"title": "The Devil All The Time", "rating": "R", "description": "Sinister characters converge around a young man devoted to protecting those he loves in a postwar backwoods town teeming with corruption and brutality.\n"}, {"title": "The Devil Inside", "rating": "R", "description": "At once spooky and grisly, this thriller follows a woman's quest to find the truth behind claims her mother killed three people during an exorcism.\n"}, {"title": "The Disaster Artist", "rating": "R", "description": "Aspiring actor Greg moves to Los Angeles with his strange friend Tommy, then agrees to star in his movie. Things start weird and get a lot weirder.\n"}, {"title": "The Duel", "rating": "R", "description": "In 1866, a Texas Ranger investigates some suspicious deaths in a town ruled by a religious despot whose past contains a disturbing link to his own.\n"}, {"title": "The Dukes of Hazzard", "rating": "PG-13", "description": "The Duke boys are back in this comedy based on the TV series, following Bo and Luke as they tear around Hazzard County in their trusty Dodge Charger.\n"}, {"title": "The Dukes of Hazzard: The Beginning", "rating": "R", "description": "The mischievous Duke boys, Bo and Luke, are sent to live with their Uncle Jesse and cousin Daisy in this prequel movie to the popular TV series.\n"}, {"title": "The Edge of Seventeen", "rating": "R", "description": "When Nadine's best (and only) friend starts dating her detested older brother, the teenage cynic's life becomes even more unbearable.\n"}, {"title": "The End of the Tour", "rating": "R", "description": " reporter David Lipsky shadows famed writer David Foster Wallace in this fictionalized account of their revealing five-day encounter.\n"}, {"title": "The Exception", "rating": "R", "description": "During World War II, a Nazi officer charged with protecting an exiled Kaiser Wilhelm II from spies begins a steamy affair with a secretive Dutch maid.\n"}, {"title": "The Eyes of My Mother", "rating": "R", "description": "At the remote farmhouse where she once witnessed a traumatic childhood event, a young woman develops a grisly fascination with violence.\n"}, {"title": "The Family", "rating": "R", "description": "The Manzonis, an infamous mob family, are relocated to Normandy, France, by the witness protection program and have some difficulty fitting in.\n"}, {"title": "The Fighter", "rating": "R", "description": "After a string of defeats, a boxer rediscovers his fighting will with help from his trainer and half-brother, a once-talented pugilist.\n"}, {"title": "The Final Destination", "rating": "R", "description": "Nick O'Bannon thinks he's cheated death when he keeps a grisly premonition from becoming reality, but he soon realizes that fate has other plans.\n"}, {"title": "The First Wives Club", "rating": "PG", "description": "Following a friend's suicide after her husband dumps her for a younger model, three women plot payback against their two-timing exes.\n"}, {"title": "The Five Venoms", "rating": "R", "description": "A dying kung fu master sends his last student to track down five former pupils in order to learn which one of them has become evil.\n"}, {"title": "The Flintstones", "rating": "PG", "description": "The Flintstones hit the big screen in this live-action comedy that finds Fred and Barney struggling to cope with the pressures of work and family.\n"}, {"title": "The Flintstones in Viva Rock Vegas", "rating": "PG", "description": "Yabba-dabba-doo! Digital dinosaurs rule the day when Fred, Barney, Betty and Wilma take Vegas by storm in this prequel that posits their lives before marriage.\n"}, {"title": "The Florida Project", "rating": "R", "description": "A mischievous 6-year-old finds the magic in her own circumstances while living with her troubled mom in a budget motel near Disney World.\n"}, {"title": "The Forbidden Kingdom", "rating": "PG-13", "description": "Jackie Chan and Jet Li star in this rousing adventure about a martial arts movie fan who finds a mystical staff that transports him to ancient China.\n"}, {"title": "The Foreigner", "rating": "R", "description": "After his daughter is killed by terrorists, a sullen restaurateur seeks the identities of those responsible and travels to Ireland to take vengeance.\n"}, {"title": "The Forest", "rating": "PG-13", "description": "A young woman conducts a search for her twin sister, who disappeared in a notorious area of Japan known as the Suicide Forest.\n"}, {"title": "The Forty-Year-Old Version", "rating": "R", "description": "Desperate for a breakthrough as she nears the big 4-0, struggling New York City playwright Radha finds inspiration by reinventing herself as a rapper.\n"}, {"title": "The Founder", "rating": "PG-13", "description": "After a fateful encounter with the McDonald brothers, struggling salesman Ray Kroc becomes driven to change the way hamburgers are made and sold.\n"}, {"title": "The Frozen Ground", "rating": "R", "description": "In this fact-based thriller, an Alaska state trooper pursuing a serial killer teams with a 17-year-old-prostitute who escaped the predator's clutches.\n"}, {"title": "The Girl with the Dragon Tattoo", "rating": "R", "description": "When a young computer hacker is tasked with investigating a prying journalist, their separate missions become entangled amid a decades-old conspiracy.\n"}, {"title": "The Good Catholic", "rating": "PG-13", "description": "A young priest’s faith is tested when he finds himself attracted to a woman he meets at confession and his ideals are shaken to the core.\n"}, {"title": "The Goods: Live Hard, Sell Hard\"", "rating": "R", "description": "Hired to rescue a flagging car dealership during a major sale, a fast-talking closer spends his days on the lot and his nights at local strip clubs.\n"}, {"title": "The Grandmaster", "rating": "PG-13", "description": "As the Japanese invasion looms, Chinese kung fu master Ip Man's world changes when rival master Gong Er and her father arrive in his village.\n"}, {"title": "The Great Raid", "rating": "R", "description": "In World War II, a battalion goes on a daring rescue mission to liberate the Americans and Filipinos who've been captured by the Japanese.\n"}, {"title": "The Green Hornet", "rating": "PG-13", "description": "A hard-partying heir dons a disguise to fight crime after hours. But with no talents or skills, he relies on his friend, a martial-arts genius.\n"}, {"title": "The Green Inferno", "rating": "R", "description": "Determined to save an Amazon tribe being squeezed by logging, a group of students finds nothing but trouble when their plane crashes in the jungle.\n"}, {"title": "The Half Of It", "rating": "PG-13", "description": "When smart but cash-strapped teen Ellie Chu agrees to write a love letter for a jock, she doesn't expect to become his friend — or fall for his crush.\n"}, {"title": "The Happytime Murders", "rating": "R", "description": "In an LA where puppets and humans coexist, a down-on-his-luck detective teams with his ex-partner to nab a killer targeting the cast of an old TV show.\n"}, {"title": "The Hateful Eight", "rating": "R", "description": "Years after the Civil War, a bounty hunter and his captive are waylaid by a Wyoming blizzard and hole up in a way station with six dicey strangers.\n"}, {"title": "The Hateful Eight: Extended Version", "rating": "R", "description": "Trapped at a stagecoach stop as a storm rages outside, two bounty hunters and an outlaw face a gallery of rogues. Features never-before-seen footage.\n"}, {"title": "The Hatred", "rating": "R", "description": "Four young women head to a country house for an idyllic weekend retreat. But what lies in store for them is far from the dreamy getaway they imagined.\n"}, {"title": "The Haunting of Molly Hartley", "rating": "PG-13", "description": "A troubled teenage girl hopes to start fresh at a new school, but the horrifying truth about her past is destined to catch up with her.\n"}, {"title": "The Heartbreak Kid", "rating": "R", "description": "Ben Stiller stars as a newlywed who marries a dreamy woman, only to learn on their honeymoon that she's a total nightmare.\n"}, {"title": "The Help", "rating": "PG-13", "description": "A young, white writer stirs up the status quo in 1960s Mississippi by interviewing Black housemaids and bringing their stories to the masses.\n"}, {"title": "The Highwaymen", "rating": "R", "description": "Two steely former Texas Rangers are tasked with tracking and killing infamous criminals Bonnie and Clyde in this crime drama based on real events.\n"}, {"title": "The Hollow Point", "rating": "R", "description": "New straight-arrow sheriff Wallace finds he must join forces with brutal ex-lawman Leland to protect a troubled border town from a cartel hit man.\n"}, {"title": "The Humanity Bureau", "rating": "R", "description": "In a dystopian, near-future United States, a deportation caseworker who has begun to question authority tries to safeguard a woman and her young son.\n"}, {"title": "The Hummingbird Project", "rating": "R", "description": "After discovering a shortcut that gives them a technological advantage, two cousins look to earn their big score by outracing a massive corporation.\n"}, {"title": "The Hundred-Foot Journey", "rating": "PG", "description": "A chef and his family leave India to open an eatery in the south of France, where they clash with the haughty restaurateur across the street.\n"}, {"title": "The Hurricane Heist", "rating": "PG-13", "description": "A deadly hurricane with mile-high waves provides the perfect cover for stealing $600 million from a U.S. Treasury outpost in Mississippi.\n"}, {"title": "The Hurt Business", "rating": "PG-13", "description": "Featuring legendary and up-and-coming MMA fighters, this documentary details the history of the brutal sport and the fighters' struggles and triumphs.\n"}, {"title": "The Imaginarium of Doctor Parnassus", "rating": "PG-13", "description": "When a deal with the devil comes due, the immortal Doctor Parnassus must renegotiate the pact to save his daughter and right the wrongs of his past.\n"}, {"title": "The Impossible", "rating": "PG-13", "description": "Tracking one family's harrowing experiences, this gripping drama depicts the chaos generated by the massive 2004 tsunami in Southeast Asia.\n"}, {"title": "The Incredibles 2", "rating": "PG", "description": "When Elastigirl gets recruited for a high-profile crime-fighting mission, Mr. Incredible takes on his toughest assignment ever: full-time parenting.\n"}, {"title": "The Indian in the Cupboard", "rating": "PG", "description": "A boy receives a wooden cupboard, antique keys and an Iroquois warrior figurine for his birthday. The figurine comes to life overnight in the cabinet.\n"}, {"title": "The Informant!", "rating": "R", "description": "While gathering evidence against his employer to help the FBI build a price-fixing case, Mark Whitacre begins to piece together a fantasy world.\n"}, {"title": "The Intouchables", "rating": "R", "description": "In need of a caregiver, a wealthy aristocrat with quadriplegia hires the last person anyone expects: an ex-con with no experience. Based on a true story.\n"}, {"title": "The Invention of Lying", "rating": "PG-13", "description": "In a world where no one fibs, a screenwriter gains fame and fortune – and maybe the girl of his dreams – by saying things that aren't true.\n"}, {"title": "The Irishman", "rating": "R", "description": "Hit man Frank Sheeran looks back at the secrets he kept as a loyal member of the Bufalino crime family in this acclaimed film from Martin Scorsese.\n"}, {"title": "The Iron Lady", "rating": "PG-13", "description": "Margaret Thatcher, the first female prime minister of Britain, navigates a career destined to change the rules of leadership and politics.\n"}, {"title": "The Jane Austen Book Club", "rating": "PG-13", "description": "Six book club members find their lives resemble a modern-day version of Jane Austen's novels in this drama.\n"}, {"title": "The Journey Is the Destination", "rating": "R", "description": "Spirited 22-year-old activist and photojournalist Dan Eldon rushes to the frontline of a dangerous relief effort for Somalian refugees in this biopic.\n"}, {"title": "The Karate Kid", "rating": "PG", "description": "After moving to Beijing with his mother, Dre falls prey to a bully, so he takes lessons from a martial arts master in this remake of the 1984 classic.\n"}, {"title": "The Keeping Hours", "rating": "PG-13", "description": "Years after the death of their only child and subsequent divorce, a couple discovers that their son's ghost continues to inhabit their former home.\n"}, {"title": "The Killing of a Sacred Deer", "rating": "R", "description": "A surgeon's carefully curated life edges toward disaster when a troubled teenage boy with mysterious motives begins to impose himself on his family.\n"}, {"title": "The Kindergarten Teacher", "rating": "R", "description": "A devoted teacher takes interest in a young student's creative potential after hearing his poetry. But she soon crosses the line into obsession.\n"}, {"title": "The King", "rating": "R", "description": "Wayward Prince Hal must turn from carouser to warrior king as he faces hostilities from inside and outside the castle walls in the battle for England.\n"}, {"title": "The King's Speech", "rating": "R", "description": "In this biographical drama, Britain's King George VI struggles with an embarrassing stutter until he seeks help from speech therapist Lionel Logue.\n"}, {"title": "The Lake House", "rating": "PG", "description": "A lonely doctor begins writing letters to the frustrated architect who lives in her former home, only to discover that they're living two years apart.\n"}, {"title": "The Lamb", "rating": "PG", "description": "A big-dreaming donkey escapes his menial existence and befriends some free-spirited animal pals in this imaginative retelling of the Nativity Story.\n"}, {"title": "The Last Airbender", "rating": "PG", "description": "In a world ravaged by the Fire nation's aggression toward the peaceful Air, Water and Earth nations, a young boy holds the key to restoring peace.\n"}, {"title": "The Last Boy Scout", "rating": "R", "description": "Private eye Joe Hallenbeck is forced to team up with a disgraced quarterback to uncover a conspiracy by a politician and a football team owner.\n"}, {"title": "The Last Days of Chez Nous", "rating": "R", "description": "Successful writer Beth's tepid marriage and home life face a new round of challenges when her footloose younger sister arrives for an extended visit.\n"}, {"title": "The Last Exorcism", "rating": "PG-13", "description": "Ready to expose his miraculous deeds as mere trickery, a famed evangelist invites a documentary crew to film his final exorcism.\n"}, {"title": "The Last Face", "rating": "R", "description": "Savage civil war and a dispute over humanitarian assistance threaten to unravel a checkered romance between an aid director and a doctor.\n"}, {"title": "The Last Thing He Wanted", "rating": "R", "description": "A hard-hitting reporter becomes entangled in the story she’s trying to break when she helps her ailing father broker an arms deal in Central America.\n"}, {"title": "The Last Whistle", "rating": "PG", "description": "After a star player dies during football practice, his coach’s career and reputation are on the line as he refuses to quit his win-at-all-costs style.\n"}, {"title": "The Late Bloomer", "rating": "R", "description": "A sex therapist with pituitary issues finally gets to experience puberty in all its glory at age 30, when an operation unleashes his raging hormones.\n"}, {"title": "The Laundromat", "rating": "R", "description": "When a widow gets swindled out of insurance money, her search for answers leads to two cunning lawyers in Panama who hide cash for the superrich.\n"}, {"title": "The Life Ahead", "rating": "PG-13", "description": "A Holocaust survivor running a daycare business forms an unlikely friendship with a bitter street kid when she takes him in after he robs her.\n"}, {"title": "The Little Hours", "rating": "R", "description": "Life at a convent takes an unruly turn when three unconventionally opinionated nuns cross paths with a tempting new gardener.\n"}, {"title": "The Little Mermaid", "rating": "PG", "description": "In this take on the classic tale, a captive circus mermaid transforms the lives of a skeptical journalist and his wide-eyed young sister.\n"}, {"title": "The Little Prince", "rating": "PG", "description": "When an overscheduled girl befriends an eccentric aviator, he regales her with tales about the adventures of an unusual boy who lives on an asteroid.\n"}, {"title": "The Lives of Others", "rating": "R", "description": "As a secret police agent eavesdrops on a successful writer in East Germany in 1984, he becomes increasingly fascinated by the man's life and politics.\n"}, {"title": "The Lobster", "rating": "R", "description": "In a near-future world, single people are hunted and forced to find mates within 45 days, or be turned into animals and banished to the wilderness.\n"}, {"title": "The Lodgers", "rating": "R", "description": "Twin siblings live under a curse in their ancestral home, but one of them is tempted to defy house rules, angering the spirits keeping them hostage.\n"}, {"title": "The Long Dumb Road", "rating": "R", "description": "Bound for art school, a sheltered student gets roped into the antics of a freewheeling mechanic who hitches a ride after fixing his car.\n"}, {"title": "The Longest Yard", "rating": "R", "description": "Washed-up professional quarterback Paul Crewe is sent to jail and forced to put together an inmate gridiron team to take on a group of prison guards.\n"}, {"title": "The Longshots", "rating": "PG", "description": "When an 11-year-old girl becomes Pop Warner football's first female quarterback, she raises eyebrows – till she takes her team to the brink of glory.\n"}, {"title": "The Look of Silence", "rating": "PG-13", "description": "In a society terrorized into silence, the brother of a 1960s Indonesian genocide victim learns the identity of his murderers and confronts them.\n"}, {"title": "The Lord of the Rings: The Return of the King", "rating": "PG-13", "description": "Aragorn is revealed as the heir to the ancient kings as he, Gandalf and the other members of the broken fellowship struggle to save Gondor.\n"}, {"title": "The Lord of the Rings: The Two Towers", "rating": "PG-13", "description": "Frodo and Sam head to Mordor to destroy the One Ring of Power while Gimli, Legolas and Aragorn search for the orc-captured Merry and Pippin.\n"}, {"title": "The Lost Husband", "rating": "PG-13", "description": "Looking to start anew, a widow retreats with her children to her aunt's goat farm, where the ranch's manager helps her navigate country life and loss.\n"}, {"title": "The Love Guru", "rating": "PG-13", "description": "Raised on an ashram in India, a self-styled love guru returns to his native America to settle a romantic rivalry between two pro hockey players.\n"}, {"title": "The Lovebirds", "rating": "R", "description": "When a couple in the fast lane to splitsville accidentally careens into a murder, they take off on a wild race to find the killer and clear their names.\n"}, {"title": "The Lovers", "rating": "R", "description": "On the verge of divorce, a middle-aged couple, each involved in a serious affair, rethink their marriage and the meaning of love and fidelity.\n"}, {"title": "The Mask of Zorro", "rating": "PG-13", "description": "An aging Zorro passes the torch to a young successor, schooling him in discipline and training him to take up the sword against crooked officials.\n"}, {"title": "The Master", "rating": "R", "description": "\n"}, {"title": "The Matrix", "rating": "R", "description": "A computer hacker learns that what most people perceive as reality is actually a simulation created by machines, and joins a rebellion to break free.\n"}, {"title": "The Matrix Reloaded", "rating": "R", "description": "The crew must protect Zion, the last outpost still under human control, after it is pinpointed by the machines responsible for the Matrix.\n"}, {"title": "The Matrix Revolutions", "rating": "R", "description": "The final installment in the Matrix trilogy finds an unconscious Neo trapped in a subway station in a zone between the Matrix and the machine world.\n"}, {"title": "The Men Who Stare at Goats", "rating": "R", "description": "\n"}, {"title": "The Midnight Sky", "rating": "PG-13", "description": "In the aftermath of a global catastrophe, a lone scientist in the Arctic races to contact a crew of astronauts with a warning not to return to Earth.\n"}, {"title": "The Monster", "rating": "R", "description": "A troubled mother-daughter relationship faces the ultimate test when the duo’s broken-down car leaves them trapped within reach of a vicious creature.\n"}, {"title": "The Muppets", "rating": "PG", "description": "When the Muppets learn that their beloved theater is slated for demolition, the gang reunite to raise the $10 million they need to save it.\n"}, {"title": "The Naked Gun 2 1/2: The Smell of Fear", "rating": "PG-13", "description": "Bumbling cop Frank Drebin is out to foil the big boys in the energy industry, who intend to suppress technology that would put them out of business.\n"}, {"title": "The Naked Gun: From the Files of Police Squad!", "rating": "PG-13", "description": "Hapless cop Frank Drebin causes more problems than he solves while trying to stop a deadly plot involving Queen Elizabeth II.\n"}, {"title": "The Natural", "rating": "PG", "description": "A gifted baseball player whose life has taken some startling turns becomes a 35-year-old rookie who helps a cellar-dwelling team get back in the game.\n"}, {"title": "The Next Karate Kid", "rating": "PG", "description": "In Boston, karate master Mr. Miyagi finds a new pupil in troubled teen Julie Pierce when she gets bullied by a group of relentless classmates.\n"}, {"title": "The Night Clerk", "rating": "R", "description": "After a charming guest checks in, a voyeuristic hotel clerk on the autism spectrum becomes a suspect in a murder that takes place during his shift.\n"}, {"title": "The Nut Job", "rating": "PG", "description": "When his grouchy attitude gets him kicked out of the park, Surly the squirrel hatches a plan to rob Maury's Nut Shop to stock up for winter.\n"}, {"title": "The Nutcracker and the Four Realms", "rating": "PG", "description": "When her late mother gifts her a key, Clara embarks on a dreamlike journey full of fantasy and conflict in this retelling of the holiday classic.\n"}, {"title": "The Old Guard", "rating": "R", "description": "Four undying warriors who've secretly protected humanity for centuries become targeted for their mysterious powers just as they discover a new immortal.\n"}, {"title": "The One I Love", "rating": "R", "description": "Confronted with the potential end of their marriage, Ethan and Sophie take off for a weekend together, hoping to negotiate their future.\n"}, {"title": "The Original Kings of Comedy", "rating": "R", "description": "Director Spike Lee documents the last night of the hit comedy tour featuring comics Steve Harvey, Cedric the Entertainer, D.L. Hughley and Bernie Mac.\n"}, {"title": "The Other Guys", "rating": "PG-13", "description": "New York cops Allen and Terry toil in obscurity as lowly desk jockeys until a big break finally gives them a chance to tackle real police work.\n"}, {"title": "The Other Side of the Wind", "rating": "R", "description": "On the last day of his life, a legendary director struggles to complete a new project and contemplates his legacy in this layered film by Orson Welles.\n"}, {"title": "The Ottoman Lieutenant", "rating": "R", "description": "As World War I looms, an American nurse travels to the Ottoman Empire on a medical mission, where she clashes with a dashing lieutenant.\n"}, {"title": "The Outpost", "rating": "R", "description": "A group of vastly outnumbered U.S. soldiers at a remote Afghanistan base must fend off a brutal offensive by Taliban fighters in the Battle of Kamdesh.\n"}, {"title": "The Parole Officer", "rating": "R", "description": "After witnessing a murder, Simon Garden is framed – and the only evidence that proves his innocence is a videotape locked inside a bank vault.\n"}, {"title": "The Peacemaker", "rating": "R", "description": "After terrorists trigger a nuclear blast in Russia, a U.S. Special Forces intelligence agent and a nuclear weapons expert come to the rescue.\n"}, {"title": "The Pelican Brief", "rating": "PG-13", "description": "When law student Darby Shaw theorizes about the assassinations of two Supreme Court justices, she is put in danger and turns to a reporter for help.\n"}, {"title": "The Perks of Being a Wallflower", "rating": "PG-13", "description": "A shy freshman struggling with depression deals with his best friend's suicide and his first love in this engaging coming-of-age tale.\n"}, {"title": "The Phantom of the Opera", "rating": "PG-13", "description": "In 1870, a disfigured recluse roams beneath a Parisian opera house and takes under his wing a young soprano, with whom a love triangle develops.\n"}, {"title": "The Physician", "rating": "R", "description": "A medical apprentice in 11th-century Persia disguises himself as a Jew to study at a school that does not admit Christians.\n"}, {"title": "The Pink Panther", "rating": "PG", "description": "Bumbling Inspector Clouseau must solve the murder of a world-famous soccer coach and catch the thief who stole his priceless diamond ring.\n"}, {"title": "The Pirate Fairy", "rating": "G", "description": "In this spritely tale, Tinker Bell and her friends set out to find free-spirited fairy Zarina after she makes off with some precious Blue Pixie Dust.\n"}, {"title": "The Pirates of Somalia", "rating": "R", "description": "An aspiring journalist travels to Somalia in hopes of making a name for himself by covering dangerous pirates and hijackers.\n"}, {"title": "The Pirates! Band of Misfits", "rating": "PG", "description": "An egotistical pirate captain strives to win the Pirate of the Year Award, but to snag the coveted prize, he'll have to outwit his dreaded rivals.\n"}, {"title": "The Pixar Story", "rating": "G", "description": "Go behind the scenes at Pixar Animation Studios with this Emmy-nominated documentary tracing the creation and history of the groundbreaking company.\n"}, {"title": "The Place Beyond the Pines", "rating": "R", "description": "A violent confrontation between a motorcycle-riding bank robber and a rookie cop spirals into a tense generational feud.\n"}, {"title": "The Polar Express", "rating": "G", "description": "In this warm-hearted tale, a young boy's faith in the holiday spirit is revived after he makes his way by train to the North Pole on Christmas Eve.\n"}, {"title": "The Prince", "rating": "R", "description": "A former Mafia hit man living quietly as a mechanic veers back into his old world after his daughter is abducted and faces an old foe in New Orleans.\n"}, {"title": "The Prince & Me", "rating": "PG", "description": "A hardworking Wisconsin college student falls for her arrogant yet charming classmate, unaware that he's a Danish prince attending school incognito.\n"}, {"title": "The Princess and the Frog", "rating": "G", "description": "In New Orleans during the Jazz Age, a beautiful girl named Tiana has a fateful encounter with frog prince who desperately wants to be human again.\n"}, {"title": "The Prom", "rating": "PG-13", "description": "A group of down-on-their-luck Broadway stars shake up a small Indiana town as they rally behind a teen who just wants to attend prom with her girlfriend.\n"}, {"title": "The Promise", "rating": "PG-13", "description": "As the Ottoman Empire enters WWI, a love triangle involving an Armenian medical student, an artist and an American journalist takes a harrowing turn.\n"}, {"title": "The Pursuit of Happyness", "rating": "PG-13", "description": "When Chris and his son are evicted, they face trying times as a desperate Chris accepts an unpaid internship at a stock brokerage firm.\n"}, {"title": "The Rainmaker", "rating": "PG-13", "description": "A young attorney and a scrappy paralegal work to help the parents of a terminally ill boy in their suit against an insurance company.\n"}, {"title": "The Reliant", "rating": "PG-13", "description": "When a town suffers an economic collapse, social unrest forces a family to seek refuge in the wilderness as bitter outlaws threaten their survival.\n"}, {"title": "The Ring", "rating": "PG-13", "description": "A reporter watches a video that supposedly sets in motion the viewer's death in seven days. Can she unravel the mystery before her own time is up?\n"}, {"title": "The Riot Club", "rating": "R", "description": "After being drafted into an elite secret society, a pair of students at Oxford University see the group's extreme debauchery spiral out of control.\n"}, {"title": "The River Wild", "rating": "PG-13", "description": "A turbulent vacation turns deadly when a fugitive and his crew kidnap a river rafting guide and her family, forcing them down the dangerous river.\n"}, {"title": "The Roommate", "rating": "PG-13", "description": "While acclimating to campus life, college freshman Sara begins to realize that her new roommate, Rebecca, is becoming obsessed with her.\n"}, {"title": "The Rover", "rating": "R", "description": "Set in a chaotic future, this Outback saga follows loner Eric's brutal ordeal when a criminal gang takes his car and leaves him nowhere with nothing.\n"}, {"title": "The Rugrats Movie", "rating": "G", "description": "When his baby brother Dil is born, Tommy Pickles and his pals decide that he's too much responsibility and try to return him to the hospital.\n"}, {"title": "The Runaways", "rating": "R", "description": "This biopic charts the rise of the rebellious California girls who formed the 1970s rock group the Runaways, paving the way for future girl musicians.\n"}, {"title": "The Runner", "rating": "R", "description": "A New Orleans politician finds his idealistic plans for rebuilding after a toxic oil spill unraveling thanks to a sex scandal.\n"}, {"title": "The Salvation", "rating": "R", "description": "In the Old West, a Danish homesteader avenges the murder of his wife and son, only to unleash a gang leader's brutal fury.\n"}, {"title": "The Sapphires", "rating": "PG-13", "description": "Sisters Gail, Cynthia and Julie have talent, but their career takes off when promoter Dave convinces them to tour for U.S. troops in Vietnam.\n"}, {"title": "The Score", "rating": "R", "description": "Ready-to-retire safecracker Nick, flamboyant fence Max and talented but volatile thief Jackie team up to rob the Montreal Customs House.\n"}, {"title": "The Sea of Trees", "rating": "PG-13", "description": " near Mount Fuji, where he meets a fellow lost wanderer.\n"}, {"title": "The Secret Life of Pets 2", "rating": "PG", "description": "On a farm outside New York, Max aims to boost his confidence while in the city, Snowball attempts to rescue a tiger cub and Gidget pretends to be a cat.\n"}, {"title": "The Seven Five", "rating": "R", "description": "This riveting film examines the case of Mike Dowd, a corrupt Brooklyn cop who became dirtier than the drug dealers he was supposed to be policing.\n"}, {"title": "The Short Game", "rating": "PG", "description": "They are fiercely competitive athletes, determined to become champions on one of the world's toughest golf courses. And they're still in grade school.\n"}, {"title": "The Signal", "rating": "PG-13", "description": "During their drive across the country, college pals Nick and Jonah – accompanied by Nick's girlfriend – run into major trouble in the Nevada desert.\n"}, {"title": "The Silence", "rating": "PG-13", "description": "With the world under attack by deadly creatures who hunt by sound, a teen and her family seek refuge outside the city and encounter a mysterious cult.\n"}, {"title": "The Smurfs", "rating": "PG", "description": "When evil Gargamel tries to capture them, the Smurfs flee their woodland home, pass through a magic portal and find themselves stranded in New York.\n"}, {"title": "The Smurfs 2", "rating": "PG", "description": " called the Naughties.\n"}, {"title": "The Social Dilemma", "rating": "PG-13", "description": "This documentary-drama hybrid explores the dangerous human impact of social networking, with tech experts sounding the alarm on their own creations.\n"}, {"title": "The Social Network", "rating": "PG-13", "description": "Director David Fincher's biographical drama chronicles the meteoric rise of Facebook CEO Mark Zuckerberg from Harvard sophomore to Internet superstar.\n"}, {"title": "The Space Between Us", "rating": "PG-13", "description": "After years of limited contact with Earth, an inquisitive teen who lives on Mars makes an interplanetary trek to discover his own origins.\n"}, {"title": "The Spectacular Now", "rating": "R", "description": "Classmates Aimee and Sutter form an unlikely friendship, and after helping Aimee raise her social confidence, Sutter begins falling for his creation.\n"}, {"title": "The Spiderwick Chronicles", "rating": "PG", "description": "When city-raised twins move to a tumbledown country mansion, it's quite an adjustment – especially after they uncover a magical fantasy world.\n"}, {"title": "The Spy Next Door", "rating": "PG", "description": "While babysitting, an undercover agent is thrust back into the world of top-secret adventure when one his young charges downloads a classified file.\n"}, {"title": "The Squid and the Whale", "rating": "R", "description": "This insightful drama looks at the crumbling marriage between a self-centered novelist – whose career is waning – and his up-and-coming writer wife.\n"}, {"title": "The Stand at Paxton County", "rating": "R", "description": "A military veteran comes home to find her father harassed by a sheriff intent on confiscating the livestock on their ranch under shady pretenses.\n"}, {"title": "The Stanford Prison Experiment", "rating": "R", "description": "Conducting a study on the psychology of incarceration, a Stanford professor assigns guard and prisoner roles to 24 male test subjects in a mock jail.\n"}, {"title": "The Super", "rating": "R", "description": "When an ex-cop becomes a superintendent of an apartment building, he suspects the sinister janitor is behind the eerie disappearances of its tenants.\n"}, {"title": "The Take", "rating": "R", "description": "After a mix-up lands him in hot water, a skilled pickpocket is forced to help a no-nonsense CIA operative track a terrorist group in Paris.\n"}, {"title": "The Taking of Pelham 123", "rating": "R", "description": "When a group of hijackers takes passengers aboard a subway train hostage and demand a ransom, it's up to dispatcher Walter Garber to bring them down.\n"}, {"title": "The Talented Mr. Ripley", "rating": "R", "description": "A charming sociopath maneuvers into the lush life of a young heir. But as he embraces the posh lifestyle, he'll stop at nothing to hold onto it.\n"}, {"title": "The Texas Chainsaw Massacre", "rating": "R", "description": "When some friends visit a vandalized graveyard, they come upon a chainsaw-wielding maniac, and it's a fight to the bloody death between good and evil.\n"}, {"title": "The Theory of Everything", "rating": "PG-13", "description": "As his esteem grows in the world of physics, Stephen Hawking's body is ravaged by ALS, forcing his increasing dependence on his devoted wife, Jane.\n"}, {"title": "The Time Machine", "rating": "PG-13", "description": "Based on the H.G. Wells classic, this adventure follows a scientist and inventor who's determined to prove to doubters that time travel is possible.\n"}, {"title": "The Time Traveler's Wife", "rating": "PG-13", "description": "Due to a genetic disorder, handsome librarian Henry involuntarily zips through time, appearing at various moments in the life of his true love.\n"}, {"title": "The Tourist", "rating": "PG-13", "description": "An American tourist seeking solace for his shattered heart instead finds it in danger again after encountering a beautiful Interpol agent.\n"}, {"title": "The Trial of the Chicago 7", "rating": "R", "description": "What was supposed to be a peaceful protest turned into a violent clash with the police. What followed was one of the most notorious trials in history.\n"}, {"title": "The Tribes of Palos Verdes", "rating": "R", "description": "When a move to an exclusive seaside community sends her mother and twin brother into a downward spiral, teenager Medina finds solace in surfing.\n"}, {"title": "The Trigger Effect", "rating": "R", "description": "When a power failure throws their suburban town into chaos, Matthew and his wife stoop to desperate measures to secure medication for their child.\n"}, {"title": "The Trust", "rating": "R", "description": "Discovering the location of a vault where a drug ring keeps its riches, two run-of-the-mill Las Vegas cops hatch a dicey plan to burgle it.\n"}, {"title": "The Tuxedo", "rating": "PG-13", "description": "After a government spy is hospitalized, New York City cab driver Jimmy unwillingly takes over the spy's role – with the aid of a computerized tuxedo.\n"}, {"title": "The Two Popes", "rating": "PG-13", "description": "At a key turning point for the Catholic Church, Pope Benedict XVI forms a surprising friendship with the future Pope Francis. Inspired by true events.\n"}, {"title": "The Ugly Truth", "rating": "R", "description": "\n"}, {"title": "The Unknown Known", "rating": "PG-13", "description": "Donald Rumsfeld reviews his long political career, from his time in Congress to serving as secretary of defense under Gerald Ford and George W. Bush.\n"}, {"title": "The Vanished", "rating": "R", "description": "When their daughter disappears during a family vacation, two terrified parents launch their own investigation that soon exposes local secrets.\n"}, {"title": "The Vatican Tapes", "rating": "PG-13", "description": "A young woman hospitalized for an infected wound becomes possessed by a satanic force that will take a priest and two Vatican exorcists to defeat.\n"}, {"title": "The Water Diviner", "rating": "R", "description": "Years after the presumed death of his three sons in battle, a grieving farmer journeys to Turkey to find them and return them to their homeland.\n"}, {"title": "The Water Horse: Legend of the Deep", "rating": "PG", "description": "A boy watches an egg he found hatch into something incredible. But how long can he keep such a big secret from his mom – and the Scottish government?\n"}, {"title": "The Waterboy", "rating": "PG-13", "description": "A water boy for a college football team has a rage that makes him a tackling machine whose bone-crushing power might vault his team into the playoffs.\n"}, {"title": "The Willoughbys", "rating": "PG", "description": "Four siblings with horribly selfish parents hatch a plan to get rid of them for good and form a perfectly imperfect family of their own.\n"}, {"title": "The Witch", "rating": "R", "description": "Believing that a witch has cursed their family, pilgrims homesteading on the edge of a primeval New England forest become increasingly paranoid.\n"}, {"title": "The World Is Not Enough", "rating": "PG-13", "description": "Greed, revenge, world domination: It's all in a day's work for James Bond, who's on a mission to protect an oil heiress from a notorious terrorist.\n"}, {"title": "The World We Make", "rating": "PG", "description": "A teenage equestrian and a local football player for each other, but simmering racism in their small town puts their relationship to the test.\n"}, {"title": "The Young Messiah", "rating": "PG-13", "description": "Tormented by a demon and on the run from a Roman centurion, a 7-year-old Jesus and his parents, Mary and Joseph, flee Egypt for Nazareth.\n"}, {"title": "Thelonious Monk: Straight, No Chaser\"", "rating": "PG-13", "description": "The spotlight shines on iconic jazz pianist and composer Thelonious Monk in this 1988 documentary featuring vintage performance clips and interviews.\n"}, {"title": "There Will Be Blood", "rating": "R", "description": "An ambitious prospector strikes it rich and turns a simple village into a boomtown, stoking the ire of a charismatic young preacher.\n"}, {"title": "Thor: Ragnarok", "rating": "PG-13", "description": "To save Asgard from a bloodthirsty goddess of death, the mighty Thor will have to battle his way to freedom and find a way back home.\n"}, {"title": "Through My Father's Eyes: The Ronda Rousey Story", "rating": "R", "description": "This documentary chronicles former Olympian and UFC champion Ronda Rousey's ascent to iconic status in the world of mixed martial arts.\n"}, {"title": "Tigertail", "rating": "PG", "description": "A man reflects on the lost love of his youth and his long-ago journey from Taiwan to America as he begins to reconnect with his estranged daughter.\n"}, {"title": "Tini: The New Life of Violetta", "rating": "G", "description": "After completing a world tour, a teen pop star spends the summer at an Italian villa to recover from heartbreak and grow into a mature artist.\n"}, {"title": "Tinker Bell and the Legend of the NeverBeast", "rating": "G", "description": "When suspicious scout fairies scheme to capture the fearsome-looking NeverBeast, Tinker Bell and Fawn set out to save the wondrous creature.\n"}, {"title": "To Wong Foo, Thanks for Everything! Julie Newmar\"", "rating": "PG-13", "description": "Three New York drag queens on their way to Hollywood for a beauty pageant get stranded in a small Midwestern town when their car breaks down.\n"}, {"title": "Tomorrow Never Dies", "rating": "PG-13", "description": "Pierce Brosnan stars in this 007 installment, which teams the secret agent and a sexy Chinese superspy against a megalomaniacal media mogul.\n"}, {"title": "Tortilla Soup", "rating": "PG-13", "description": "Widower Martin is a restaurateur with a booming business and three headstrong daughters who leave the house to pursue their individual destinies.\n"}, {"title": "Total Recall", "rating": "R", "description": "After getting a memory implant, working stiff Douglas Quaid discovers he might actually be a secret agent embroiled in a violent insurrection on Mars.\n"}, {"title": "Tracers", "rating": "PG-13", "description": "When a bike messenger falls into debt with organized criminals, a sexy woman draws him into her high-stakes world of parkour, teaching him new skills.\n"}, {"title": "Trailer Park Boys: Countdown to Liquor Day", "rating": "R", "description": "After their latest jail stint, boozy pals Julian, Bubbles and Ricky plan to go legit but learn trailer park manager Jim aims to demolish their homes.\n"}, {"title": "Trailer Park Boys: The Movie", "rating": "R", "description": "In this feature-length adventure, Ricky, Julian and Bubbles – just out of jail – plan the lamest scheme yet: to get rich by stealing tons of change.\n"}, {"title": "Trainspotting", "rating": "R", "description": "Renton and his mates cope with the gritty realities of heroin addiction. But when Renton gets clean, he can't get away from his friends' nasty habits.\n"}, {"title": "Traitor", "rating": "PG-13", "description": "An FBI agent assigned to pursue an ex-Special Ops soldier who joined a terrorist organization begins to question his target's true intentions.\n"}, {"title": "Transcendence", "rating": "PG-13", "description": "Two computer scientists work to achieve technological singularity to create a world where computers can transcend the abilities of the human brain.\n"}, {"title": "Trash", "rating": "R", "description": "Three poor Brazilian teens find something suspicious in a garbage heap, then end up on the run from the law as they try to set things right.\n"}, {"title": "Trash Fire", "rating": "R", "description": "Surprise news that his girlfriend is pregnant sends loutish Owen on an ill-advised trip to reconnect with his twisted sister and sadistic grandmother.\n"}, {"title": "Tremors", "rating": "PG-13", "description": "After a seismologist gets unusual readings on her equipment, handymen discover 30-foot-long carnivorous worms that suck their prey underground.\n"}, {"title": "Tremors 2: Aftershocks", "rating": "PG-13", "description": "A rag-tag team of survivalists and scientists battle supersucking desert creatures that are worming their way through the oil fields of Mexico.\n"}, {"title": "Tremors 3: Back to Perfection", "rating": "PG", "description": "When a theme park's simulated giant worm attacks turn real, Burt Gummer and two young entrepreneurs team up to battle the flesh-eating graboids.\n"}, {"title": "Tremors 4: The Legend Begins", "rating": "PG-13", "description": "Residents of a abandoned mining town attempt to get to the bottom of a series of recent, mysterious deaths before their own fates are sealed.\n"}, {"title": "Tremors 5:  Bloodline", "rating": "PG-13", "description": "When he is hired to capture a deadly creature terrorizing South Africa, survivalist Burt Gummer brings along a new tech-savvy partner.\n"}, {"title": "Tremors 6: A Cold Day in Hell", "rating": "PG-13", "description": "The subterranean, worm-like creatures are back, and Graboid-hunter Burt Gummer suspects they've been weaponized.\n"}, {"title": "Tremors: Shrieker Island", "rating": "PG-13", "description": "When massive mutant creatures infiltrate an island nature preserve, scientists recruit a legendary monster hunter to battle the beasts.\n"}, {"title": "Trespass Against Us", "rating": "R", "description": "A man from a criminal family yearns to break away and find a better life, but his father's staunch opposition puts his dreams of freedom in jeopardy.\n"}, {"title": "Triple 9", "rating": "R", "description": "A group of dirty Atlanta cops blackmailed by the Russian mob plan a seemingly impossible heist that sets off an explosive chain reaction of violence.\n"}, {"title": "Triple Frontier", "rating": "R", "description": "Loyalties are tested when five former special forces operatives reunite to steal a drug lord's fortune, unleashing a chain of unintended consequences.\n"}, {"title": "Triple Threat", "rating": "R", "description": "A crew of ruthless criminals hired to kill an influential heiress meet their match in a trio of surprisingly adept fighters who come to her aid.\n"}, {"title": "True Grit", "rating": "G", "description": "Teenage tomboy Mattie Ross enlists the help of crusty lawman Rooster Cogburn to track down the hired hand who murdered her father.\n"}, {"title": "True to the Game", "rating": "R", "description": "When a drug kingpin looking to go legit falls for a Philadelphia college student, it doesn't take long for his dangerous world to bleed into her life.\n"}, {"title": "Trumbo", "rating": "R", "description": "When he is blacklisted by Hollywood for his leftist political views, screenwriter Dalton Trumbo struggles to find work in secret as a ghost writer.\n"}, {"title": "Tucker and Dale vs. Evil", "rating": "R", "description": " cabin, two backwoods boys see their trip turn into a nightmare when they're accused of being psychotic killers.\n"}, {"title": "Turbo", "rating": "PG", "description": "A speed-obsessed snail who dreams of being the world's greatest race car driver gets his chance when an accident imbues him with high-octane speed.\n"}, {"title": "Tusk", "rating": "R", "description": "When a wise-guy podcaster interviews a disabled seafarer, he decides to embark on a transformational quest to track down a dangerous walrus-monster.\n"}, {"title": "Two Lovers and a Bear", "rating": "R", "description": "A troubled couple living near the North Pole begins a perilous journey south in an attempt to find peace and vanquish ghosts from the past.\n"}, {"title": "Tyson", "rating": "R", "description": "In this surprisingly emotional documentary, heavyweight champ Mike Tyson analyzes the controversies surrounding his career and turbulent private life.\n"}, {"title": "USS Indianapolis: Men of Courage", "rating": "R", "description": "After becoming stranded in the Philippine Sea during World War II, a tenacious Navy crew faces a dire lack of supplies and a string of shark attacks.\n"}, {"title": "Una", "rating": "R", "description": "A young woman tracks down the older man who preyed on her as a child, forcing them both to confront the damage done by what happened 15 years earlier.\n"}, {"title": "Unaccompanied Minors", "rating": "PG", "description": "Five disparate kids, snowed in at the airport on Christmas Eve, try to get back to their families and outsmart a disgruntled airport official.\n"}, {"title": "Uncut Gems", "rating": "R", "description": "With his debts mounting and angry collectors closing in, a fast-talking New York City jeweler risks everything in hopes of staying afloat and alive.\n"}, {"title": "Undefeated", "rating": "PG-13", "description": "An inspirational profile of an inner-city high school football team's valiant effort to reach the school's first-ever playoff game.\n"}, {"title": "Under The Skin", "rating": "R", "description": "A seductive alien prowls the streets in search of prey: unsuspecting men who fall under her spell, only to be consumed by a strange liquid pool.\n"}, {"title": "Under the Shadow", "rating": "PG-13", "description": "During the Iran-Iraq conflict, a Tehran woman caring for her daughter while her husband is at war is gradually convinced evil spirits are at work.\n"}, {"title": "Undercover Brother 2", "rating": "R", "description": "When a beloved secret agent falls deep into a coma, his bumbling brother must defend their community from a divisive political threat.\n"}, {"title": "Undercover Grandpa", "rating": "PG-13", "description": "Jake's date with his dream girl takes a turn when she disappears, and Jake's grandpa – a former intelligence officer – sets out to find her.\n"}, {"title": "Underdogs", "rating": "PG", "description": "When his archenemy returns to settle a score, a foosball ace and his magically incarnated team must save the town and woo back his girl.\n"}, {"title": "Unfinished Song", "rating": "PG-13", "description": "With his wife terminally ill, Arthur's future seems grim. But he learns to find joy in life again when he joins an unconventional church choir.\n"}, {"title": "Unfriended", "rating": "R", "description": "Six teens whose cyberbullying drove their classmate to kill herself become the target of an online stalker with a lethal agenda.\n"}, {"title": "Unknown", "rating": "PG-13", "description": "Liam Neeson stars as a man who regains consciousness after a car accident, only to discover that another man is impersonating him.\n"}, {"title": "Up in the Air", "rating": "R", "description": "Ryan Bingham flies around the country firing employees on behalf of companies, but he faces losing the job he savors to recent college grad Natalie.\n"}, {"title": "V for Vendetta", "rating": "R", "description": " takes up arms against a totalitarian government and finds an unlikely ally in a young woman.\n"}, {"title": "Vampires vs. the Bronx", "rating": "PG-13", "description": "Three gutsy kids from a rapidly gentrifying Bronx neighborhood stumble upon a sinister plot to suck all the life from their beloved community.\n"}, {"title": "Vantage Point", "rating": "PG-13", "description": "Moments after he arrives in Spain for an antiterrorism summit, U.S. President Ashton is shot.\n"}, {"title": "Velvet Buzzsaw", "rating": "R", "description": "A feared critic, an icy gallery owner and an ambitious assistant snap up a recently deceased artist's stash of paintings – with dire consequences.\n"}, {"title": "Victor", "rating": "PG-13", "description": "In 1962 Brooklyn, a Puerto Rican teen who joins a gang is seduced by violence and heroin. But can his mother's love and faith in God save him?\n"}, {"title": "Viking Destiny", "rating": "R", "description": "Framed for her father’s murder, an exiled Viking princess is guided by the god Odin as she prepares to return to her kingdom and reclaim the throne.\n"}, {"title": "Villain", "rating": "R", "description": "Fresh out of prison, an ex-con tries to save his debt-ridden brother and the family pub until local mobsters draw him back to a criminal underworld.\n"}, {"title": "Vincent N Roxxy", "rating": "R", "description": "In rural Louisiana, a terse loner forges a redemptive bond with a woman he saved from a killer, but a violent past soon catches up with both of them.\n"}, {"title": "W.E.", "rating": "R", "description": "This glossy ensemble drama juxtaposes the lives of famous divorcée Wallis Simpson and Wally Winthrop, a young 1990s housewife.\n"}, {"title": "Wadjda", "rating": "PG", "description": "A persistent 10-year-old wishes for a new bicycle so she can beat her friend (a boy) in a race. But it's going to take some ingenuity to get one.\n"}, {"title": "Waiting...", "rating": "R", "description": "Employees turn up the antics during an eight-hour shift at the restaurant Shenaniganz when new opportunities call and boredom gets the best of them.\n"}, {"title": "Wakefield", "rating": "R", "description": "An unhappy father and lawyer quits his suburban life and vanishes into the attic above his garage, where he watches his family move on without him.\n"}, {"title": "Walking Out", "rating": "PG-13", "description": "A suburban teen goes hunting with his estranged father. When a mishap with a bear occurs, he must his use his survival skills to save them both.\n"}, {"title": "War", "rating": "R", "description": "When his partner is killed and all clues point to a notorious assassin, FBI agent Jack Crawford sets out for revenge in this taut action-thriller.\n"}, {"title": "War Horse", "rating": "PG-13", "description": "During World War I, the bond between a young Englishman and his loyal horse, Joey, is tested when Joey is sold to the cavalry and sent to France.\n"}, {"title": "War on Everyone", "rating": "R", "description": "Terry and Bob excel at blackmailing small-time crooks. But when the two cops target a big score, they learn not all criminals are easily intimidated.\n"}, {"title": "Water & Power: A California Heist", "rating": "PG", "description": "California residents and farmers face powerful barons in the struggle to secure water rights in this fresh historical account of profit and interests.\n"}, {"title": "We Are Your Friends", "rating": "R", "description": "An ambitious young DJ who knows how to work a crowd puts everything at risk for a budding relationship with his mentor's girlfriend.\n"}, {"title": "We Can Be Heroes", "rating": "PG", "description": "When alien invaders capture Earth’s superheroes, their kids must learn to work together to save their parents — and the planet.\n"}, {"title": "We Summon the Darkness", "rating": "R", "description": "A night at a 1980s heavy metal concert hits a grisly note when new friends find themselves in the middle of a satanic murder spree.\n"}, {"title": "We the Animals", "rating": "R", "description": "A trio of brothers cope with their parents' volatile relationship by running wild and unchecked, and one of them experiences a visceral awakening.\n"}, {"title": "Welcome to New York", "rating": "R", "description": "A lecherous World Bank official sees his reputation crumbling when he's accused of raping a hotel maid during a trip to New York.\n"}, {"title": "Welcome to Sudden Death", "rating": "R", "description": "At a basketball game, an ex-Special Forces officer must face a group of tech-savvy hostiles when a team owner and his daughter are taken hostage.\n"}, {"title": "What Keeps You Alive", "rating": "R", "description": "A couple's romantic anniversary retreat to a rural cabin unravels when a childhood friend appears and reveals long-held secrets from the past.\n"}, {"title": "What Lies Beneath", "rating": "PG-13", "description": "When Claire Spencer starts hearing ghostly voices and seeing spooky images, her husband tries to reassure her by telling her it's all in her head.\n"}, {"title": "What a Girl Wants", "rating": "PG", "description": "In search of the father she's never met, the daughter of a bohemian American woman heads to Europe and finds that her dad is an uptight politician.\n"}, {"title": "What's Eating Gilbert Grape", "rating": "PG-13", "description": "In a backwater Iowa town, young Gilbert is torn between taking care of his troubled family and a girl who shows him new possibilities for his life.\n"}, {"title": "What's Up With Love?", "rating": "R", "description": "A popular high school girl strains her relationship with her close-knit clique when she begins falling for a reclusive, lower-class schoolmate.\n"}, {"title": "Wheels of Fortune", "rating": "R", "description": "To claim a big inheritance, a down-on-his-luck mechanic must win a series of competitions as outlined in his birth father's will.\n"}, {"title": "Where the Money Is", "rating": "PG-13", "description": "Paul Newman proves he's still got prodigious acting chops, playing an aging bank robber who may have one last job in him. Faking a stroke, the incarcerated Newman is transferred to a nursing home and the care of a skeptical nurse.\n"}, {"title": "Where's the Money", "rating": "R", "description": "Hunting for a stash of stolen money, a sharp-witted slacker from South Central Los Angeles infiltrates an all-white college fraternity.\n"}, {"title": "While We're Young", "rating": "R", "description": "A documentary filmmaker struggling with a creative block meets a vibrant young hipster couple who, initially, bring new energy into his life and work.\n"}, {"title": "Who's That Knocking at My Door?", "rating": "R", "description": "A woman's revelation that she was once raped sends her boyfriend, a reformed street thug, into an emotional and spiritual tailspin.\n"}, {"title": "Whose Streets?", "rating": "R", "description": "Powered by activists and leaders, this documentary follows the rise of the Black Lives Matter movement following the 2014 killing of Michael Brown.\n"}, {"title": "Wild Child", "rating": "PG-13", "description": "When a spoiled girl pushes her father too far with her spending and outlandish behavior, he ships the Malibu princess off to a strict boarding school.\n"}, {"title": "Wild Oats", "rating": "PG-13", "description": "When insurance accidentally pays her millions, retired teacher Eva and her pal Maddie head to the Canary Islands for the adventure of their lives.\n"}, {"title": "Wild Wild West", "rating": "PG-13", "description": "Armed with an ingenious arsenal, two top-notch government agents are tasked with tracking down a diabolical scientist in this futuristic Western.\n"}, {"title": "Wildlife", "rating": "PG-13", "description": "A teen’s life in 1960 Montana grows complicated when his father is fired, his mother returns to work, and the strain on the family begins to show.\n"}, {"title": "Wildling", "rating": "R", "description": "Confined to an attic for years by a man claiming to be her protector, teenage Anna is liberated and begins learning the rest of her terrifying story.\n"}, {"title": "Willy Wonka & the Chocolate Factory", "rating": "G", "description": "Zany Willy Wonka causes a stir when he announces that golden tickets hidden inside his candy bars will admit holders into his secret confectionary.\n"}, {"title": "Winchester", "rating": "PG-13", "description": "The heiress to a vast firearms fortune constructs a mansion with a maze-like interior to ward off the spirits of those killed by her family's product.\n"}, {"title": "Wine Country", "rating": "R", "description": "When longtime friends meet up for a wine-soaked birthday getaway in Napa Valley, their perfectly planned weekend turns messier by the minute.\n"}, {"title": "Winter's Bone", "rating": "R", "description": "In this unflinching noir drama, a resilient teen goes on the trail of her missing, drug-dealing father when his absence threatens the family's safety.\n"}, {"title": "Wish I Was Here", "rating": "R", "description": "With his acting career moribund, Aidan Bloom steers a new tack in life, taking over his children's education when private school becomes too costly.\n"}, {"title": "Wish Upon a Unicorn", "rating": "PG", "description": "Sisters Mia and Emma move to their grandmother’s farm far from the city and save a magical unicorn from local cowboys seeking its powers for themselves.\n"}, {"title": "Wolves", "rating": "R", "description": "A promising high school basketball player has his eye on an Ivy League scholarship. But his father's secret addictions could ruin everything.\n"}, {"title": "Woodshock", "rating": "R", "description": "Shattered after her mother's death, a woman floats away from reality under the effect of a potent, hallucinatory drug as her life decays into chaos.\n"}, {"title": "Woody Woodpecker", "rating": "PG", "description": "A rascally bird with a distinctive laugh pecks back with a vengeance when his forest habitat is threatened by a slick lawyer building his dream home.\n"}, {"title": "World Trade Center", "rating": "PG-13", "description": "Working under treacherous conditions, an army of dedicated rescuers struggles to find anyone who survived the World Trade Center's tragic collapse.\n"}, {"title": "Wyatt Earp", "rating": "PG-13", "description": "Legendary lawman Wyatt Earp is continually at odds with a gang of renegade cowboys, culminating in a fiery showdown with the outlaws at the OK Corral.\n"}, {"title": "XX", "rating": "R", "description": "This four-part anthology of short horror films features stories that include some traditional themes but all are shown from a female point of view.\n"}, {"title": "XXX: State of the Union", "rating": "PG-13", "description": "In this action-packed follow-up to XXX, U.S. intelligence officer Augustus Gibbons must thwart a massive conspiracy to overthrow the government.\n"}, {"title": "XXx", "rating": "PG-13", "description": "A notorious underground rush-seeker deemed untouchable by the law is coerced into cooperating with the government to infiltrate a Russian crime ring.\n"}, {"title": "Y Tu Mamá También", "rating": "R", "description": "When rich teens Tenoch and Julio meet the alluring, older Luisa, they try to impress her with stories of a road trip, then convince her to join them.\n"}, {"title": "Yellowbird", "rating": "PG", "description": " runs into trouble.\n"}, {"title": "Yes Man", "rating": "PG-13", "description": "After a bitter divorce, a bank drone falls under the sway of a self-help guru who urges him to say yes to everything that comes his way for a year.\n"}, {"title": "Yes, God, Yes\"", "rating": "R", "description": "A devoutly religious teen grapples with her own sexual awakening, and attends a Catholic school retreat in the hopes of suppressing her newfound urges.\n"}, {"title": "Yoga Hosers", "rating": "PG-13", "description": "With an all-important high school party at stake, two teen yoga fanatics enlist a man hunter to help fight an army of monsters created by Nazis.\n"}, {"title": "Young Adult", "rating": "R", "description": "When a divorced writer gets a letter from an old boyfriend announcing his wife's had a baby, she returns to her hometown to reconnect with her ex.\n"}, {"title": "Yours, Mine and Ours\"", "rating": "PG", "description": "When a father of eight and a mother of 10 prepare to wed, the couple's children attempt to sabotage the union in this remake of a 1968 comedy.\n"}, {"title": "Zack and Miri Make a Porno", "rating": "R", "description": "Zack and Miri make and star in an adult film to bring in easy money. But their unspoken feelings for each other might threaten the whole enterprise.\n"}, {"title": "Zodiac", "rating": "R", "description": "A political cartoonist, a crime reporter and a pair of cops investigate San Francisco's infamous Zodiac Killer in this thriller based on a true story.\n"}, {"title": "Zokkomon", "rating": "PG", "description": "When his cruel uncle abandons him, a young orphan learns to access the untapped superpowers that have been waiting within him all along.\n"}, {"title": "Zombieland", "rating": "R", "description": "Looking to survive in a world taken over by zombies, a dorky college student teams with an urban roughneck and a pair of grifter sisters.\n"}, {"title": "Zoom", "rating": "PG", "description": "Dragged from civilian life, a former superhero must train a new crop of youthful saviors when the military preps for an attack by a familiar villain.\n"}, {"title": "Æon Flux", "rating": "PG-13", "description": "Aiming to hasten an uprising, the leader of an underground rebellion dispatches acrobatic assassin Aeon Flux to eliminate the government's top leader.\n"}]