[{"title": "Carmen Sandiego", "country": "United States", "release_year": 2021, "listed_in": "Kids' TV, TV Thrillers", "description": "A master thief who uses her skills for good, Carmen Sandiego travels the world foiling V.I.L.E.'s evil plans – with help from her savvy sidekicks.\n"}, {"title": "Charming", "country": "Canada, United States, Cayman Islands", "release_year": 2021, "listed_in": "Children & Family Movies, Comedies", "description": "On the eve of his 21st birthday, an adored prince must find his one, true soulmate before a spell takes away all love from his kingdom.\n"}, {"title": "Cobra Kai", "country": "United States", "release_year": 2021, "listed_in": "TV Action & Adventure, TV Dramas", "description": " films.\n"}, {"title": "Crack: Cocaine, Corruption & Conspiracy\"", "country": "United States", "release_year": 2021, "listed_in": "Documentaries", "description": "A cheap, powerful drug emerges during a recession, igniting a moral panic fueled by racism. Explore the complex history of crack in the 1980s.\n"}, {"title": "Disenchantment", "country": "United States", "release_year": 2021, "listed_in": "TV Action & Adventure, TV Comedies, TV Sci-Fi & Fantasy", "description": "Princess duties call, but she'd rather be drinking. Free-spirited Bean exasperates the king as she wreaks havoc with her demon and elf pals.\n"}, {"title": "Dream Home Makeover", "country": "United States", "release_year": 2021, "listed_in": "Reality TV", "description": "Dreams come true for real families looking for the perfect home tailored to their own unique style, thanks to Shea and Syd McGee of Studio McGee.\n"}, {"title": "Headspace Guide to Meditation", "country": "United States", "release_year": 2021, "listed_in": "Docuseries, Science & Nature TV", "description": "Headspace takes a friendly, animated look at the benefits of meditation while offering techniques and guided meditations to jump-start your practice.\n"}, {"title": "Hilda", "country": "United Kingdom, Canada, United States", "release_year": 2021, "listed_in": "Kids' TV", "description": "Fearless, free-spirited Hilda finds new friends, adventure and magical creatures when she leaves her enchanted forest home and journeys to the city.\n"}, {"title": "History of Swear Words", "country": "United States", "release_year": 2021, "listed_in": "Docuseries, TV Comedies", "description": "Nicolas Cage hosts this proudly profane, funny and engagingly educational series about the history and impact of the most notorious English swear words.\n"}, {"title": "Inside the World’s Toughest Prisons", "country": "United Kingdom", "release_year": 2021, "listed_in": "British TV Shows, Crime TV Shows, Docuseries", "description": "Investigative journalist Paul Connolly becomes a voluntary inmate in the world's most volatile prisons, where intimidation and brutality rule.\n"}, {"title": "Lupin", "country": "United States", "release_year": 2021, "listed_in": "Crime TV Shows, International TV Shows, TV Action & Adventure", "description": "Inspired by the adventures of Arsène Lupin, gentleman thief Assane Diop sets out to avenge his father for an injustice inflicted by a wealthy family.\n"}, {"title": "Mighty Little Bheem: Kite Festival", "country": "India", "release_year": 2021, "listed_in": "Kids' TV, TV Comedies", "description": "With winter behind them, Bheem and his townspeople usher in a sunny new season in all their favorite ways during the Makar Sankranti festival.\n"}, {"title": "Monarca", "country": "Mexico", "release_year": 2021, "listed_in": "International TV Shows, Spanish-Language TV Shows, TV Dramas", "description": "After 20 years, Ana María returns to Mexico and vies for control of her family's tequila empire as it threatens to crumble under corruption and secrets.\n"}, {"title": "Nailed It! Mexico", "country": "Mexico, United States", "release_year": 2021, "listed_in": "International TV Shows, Reality TV, Spanish-Language TV Shows", "description": "The fun, fondant and hilarious cake fails head to Mexico, where very amateur bakers compete to re-create elaborate sweet treats for a cash prize.\n"}, {"title": "Pretend It’s a City", "country": "United States", "release_year": 2021, "listed_in": "Docuseries", "description": "Wander the New York City streets and fascinating mind of wry writer, humorist and raconteur Fran Lebowitz as she sits down with Martin Scorsese.\n"}, {"title": "Stuck Apart", "country": "Turkey", "release_year": 2021, "listed_in": "Comedies, Dramas, International Movies", "description": "Entrenched in a midlife crisis, Aziz seeks solace from his mundane job, lonesome friends and rowdy family while pretending to have his act together.\n"}, {"title": "Surviving Death", "country": "United States", "release_year": 2021, "listed_in": "Docuseries, Reality TV", "description": "What happens after we die? This docuseries explores personal stories and research on near-death experiences, reincarnation and paranormal phenomena.\n"}, {"title": "The Idhun Chronicles", "country": "Spain", "release_year": 2021, "listed_in": "Anime Series, International TV Shows, Spanish-Language TV Shows", "description": "A boy suddenly orphaned fights his parents' killer to save a planet, and discovers a new world of danger — and wonder.\n"}, {"title": "The Minimalists: Less Is Now", "country": "United States", "release_year": 2021, "listed_in": "Documentaries", "description": "They've built a movement out of minimalism. Longtime friends Joshua Fields Millburn and Ryan Nicodemus share how our lives can be better with less.\n"}, {"title": "The Netflix Afterparty", "country": "United States", "release_year": 2021, "listed_in": "Stand-Up Comedy & Talk Shows, TV Comedies", "description": "Hosts David Spade, Fortune Feimster and London Hughes welcome guests from the newest and biggest Netflix titles for fun conversations, skits and more.\n"}, {"title": "What Happened to Mr. Cha?", "country": "South Korea", "release_year": 2021, "listed_in": "Comedies, International Movies", "description": "With the peak of his career long behind him, an actor clings to his past glory — until a sudden wake-up call forces him to face who he's become.\n"}, {"title": "What Would Sophia Loren Do?", "country": "United States", "release_year": 2021, "listed_in": "Documentaries", "description": "In this delightful short documentary, an Italian American grandmother and film buff finds strength and joy in the life of her screen idol, Sophia Loren.\n"}, {"title": "3%", "country": "Brazil", "release_year": 2020, "listed_in": "International TV Shows, TV Dramas, TV Sci-Fi & Fantasy", "description": "In a future where the elite inhabit an island paradise far from the crowded slums, you get one chance to join the 3% saved from squalor.\n"}, {"title": "​SAINT SEIYA: Knights of the Zodiac", "country": "Japan", "release_year": 2020, "listed_in": "Anime Series, International TV Shows", "description": "Seiya and the Knights of the Zodiac rise again to protect the reincarnation of the goddess Athena, but a dark prophecy hangs over them all.\n"}, {"title": "(Un)Well", "country": "United States", "release_year": 2020, "listed_in": "Reality TV", "description": "This docuseries takes a deep dive into the lucrative wellness industry, which touts health and healing. But do the products live up to the promises?\n"}, {"title": "#Alive", "country": "South Korea", "release_year": 2020, "listed_in": "Horror Movies, International Movies, Thrillers", "description": "As a grisly virus rampages a city, a lone man stays locked inside his apartment, digitally cut off from seeking help and desperate to find a way out.\n"}, {"title": "#blackAF", "country": "United States", "release_year": 2020, "listed_in": "TV Comedies", "description": "Kenya Barris and his family navigate relationships, race and culture while grappling with their newfound success in this comedy series.\n"}, {"title": "#cats_the_mewvie", "country": "Canada", "release_year": 2020, "listed_in": "Documentaries, International Movies", "description": "This pawesome documentary explores how our feline friends became online icons, from the earliest text memes to the rise of celebrity cat influencers.\n"}, {"title": "#FriendButMarried 2", "country": "Indonesia", "release_year": 2020, "listed_in": "Dramas, International Movies, Romantic Movies", "description": "As Ayu and Ditto finally transition from best friends to newlyweds, a quick pregnancy creates uncertainty for the future of their young marriage.\n"}, {"title": "Òlòtūré", "country": "Nigeria", "release_year": 2020, "listed_in": "Dramas, International Movies", "description": "In Lagos, a journalist goes undercover as a prostitute to expose human trafficking. What she finds is a world of exploited women and ruthless violence.\n"}, {"title": "100 Humans", "country": "United States", "release_year": 2020, "listed_in": "Docuseries, Science & Nature TV", "description": "One hundred hardy souls from diverse backgrounds participate in playful experiments exploring age, sex, happiness and other aspects of being human.\n"}, {"title": "100% Halal", "country": "Indonesia", "release_year": 2020, "listed_in": "Dramas, International Movies", "description": "After high school, a young woman marries the man of her father's choice but soon faces the possibility that her religion considers the union invalid.\n"}, {"title": "13 Reasons Why", "country": "United States", "release_year": 2020, "listed_in": "Crime TV Shows, TV Dramas, TV Mysteries", "description": "After a teenage girl's perplexing suicide, a classmate receives a series of tapes that unravel the mystery of her tragic choice.\n"}, {"title": "18 Presents", "country": "Italy", "release_year": 2020, "listed_in": "Dramas, Independent Movies, International Movies", "description": "A pregnant mother with terminal cancer leaves behind 18 sentimental gifts for her unborn daughter to receive every birthday until she reaches womanhood.\n"}, {"title": "365 Days", "country": "Poland", "release_year": 2020, "listed_in": "Dramas, International Movies, Romantic Movies", "description": "A fiery executive in a spiritless relationship falls victim to a dominant mafia boss, who imprisons her and gives her one year to fall in love with him.\n"}, {"title": "37 Seconds", "country": "Japan", "release_year": 2020, "listed_in": "Dramas, International Movies", "description": "Trapped by society and familial obligations, a young manga artist goes on an unconventional journey for sexual freedom and personal liberation.\n"}, {"title": "A Babysitter's Guide to Monster Hunting", "country": "United States", "release_year": 2020, "listed_in": "Children & Family Movies", "description": "Recruited by a secret society of babysitters, a high schooler battles the Boogeyman and his monsters when they nab the boy she's watching on Halloween.\n"}, {"title": "A California Christmas", "country": "United States", "release_year": 2020, "listed_in": "Comedies, Romantic Movies", "description": "With his carefree lifestyle on the line, a wealthy charmer poses as a ranch hand to get a hardworking farmer to sell her family’s land before Christmas.\n"}, {"title": "A Choo", "country": "Taiwan", "release_year": 2020, "listed_in": "Action & Adventure, International Movies, Romantic Movies", "description": "Determined to win the heart of his childhood crush from orphanage, EJ becomes a boxer with superpowers and soon confronts a formidable villain.\n"}, {"title": "A Fall from Grace", "country": "United States", "release_year": 2020, "listed_in": "Dramas, Thrillers", "description": "When gentle, law-abiding Grace confesses to killing her new husband, her skeptical young lawyer sets out to uncover the truth. A film by Tyler Perry.\n"}, {"title": "A Go! Go! Cory Carson Christmas", "country": "United States", "release_year": 2020, "listed_in": "Children & Family Movies", "description": "When a familiar-looking stranger crashes in without a memory, Cory helps him remember the magic of Christmas to save the holiday for everyone.\n"}, {"title": "A Life of Speed: The Juan Manuel Fangio Story", "country": "Argentina", "release_year": 2020, "listed_in": "Documentaries, International Movies, Sports Movies", "description": "Juan Manuel Fangio was the Formula One king, winning five world championships in the early 1950s — before protective gear or safety features were used.\n"}, {"title": "A Love So Beautiful", "country": "South Korea", "release_year": 2020, "listed_in": "International TV Shows, Romantic TV Shows, TV Comedies", "description": "Love is as tough as it is sweet for a lovestruck teenager, whose relationship with her next-door neighbor transforms as they grow into adulthood.\n"}, {"title": "A Love Song for Latasha", "country": "United States", "release_year": 2020, "listed_in": "Documentaries", "description": "The killing of Latasha Harlins became a flashpoint for the 1992 LA uprising. This documentary evocatively explores the 15-year-old's life and dreams.\n"}, {"title": "A New York Christmas Wedding", "country": "United States", "release_year": 2020, "listed_in": "Dramas, LGBTQ Movies, Romantic Movies", "description": "As her wedding nears, a bride-to-be is visited by an angel who reveals what could have been if she'd followed feelings for her childhood best friend.\n"}, {"title": "A Perfect Crime", "country": "Germany", "release_year": 2020, "listed_in": "Crime TV Shows, Docuseries, International TV Shows", "description": "This docuseries investigates the 1991 killing of politician Detlev Rohwedder, an unsolved mystery at the heart of Germany's tumultuous reunification.\n"}, {"title": "A Queen Is Born", "country": "Brazil", "release_year": 2020, "listed_in": "International TV Shows, Reality TV", "description": "Gloria Groove and Alexia Twister make drag dreams come true as they help six artists find the confidence to own the stage in this makeover show.\n"}, {"title": "A Secret Love", "country": "United States", "release_year": 2020, "listed_in": "Documentaries, LGBTQ Movies", "description": "Amid shifting times, two women kept their decades-long love a secret. But coming out later in life comes with its own set of challenges.\n"}, {"title": "A Shaun the Sheep Movie: Farmageddon", "country": "United Kingdom, France, Belgium, United States, China", "release_year": 2020, "listed_in": "Children & Family Movies, Comedies", "description": "Shaun and the flock race to help an adorable alien find her way home after her ship crash-lands near Mossy Bottom Farm and sparks a UFO frenzy.\n"}, {"title": "A truthful Mother", "country": "India", "release_year": 2020, "listed_in": "Children & Family Movies", "description": "Facing a drought, a hungry tiger and a noble cow have an extraordinary encounter in this fable based on a children’s book and a Kannada folk song.\n"}, {"title": "A Whisker Away", "country": "Japan", "release_year": 2020, "listed_in": "Anime Features, Children & Family Movies, International Movies", "description": "A peculiar girl transforms into a cat to catch her crush's attention. But before she realizes it, the line between human and animal starts to blur.\n"}, {"title": "Absurd Planet", "country": "United States", "release_year": 2020, "listed_in": "Docuseries, Science & Nature TV, TV Comedies", "description": "A cast of quirky critters and Mother Nature herself narrate this funny science series, which peeks into the lives of Earth’s most incredible animals.\n"}, {"title": "Adú", "country": "Spain", "release_year": 2020, "listed_in": "Dramas, International Movies", "description": "Near a Spanish town in northern Africa, a child takes a painful journey, a father reconnects with his daughter and a coast guard is guilt stricken.\n"}, {"title": "Afonso Padilha: Classless", "country": "Brazil", "release_year": 2020, "listed_in": "Stand-Up Comedy", "description": "Brazilian comedian Afonso Padilha dives into his humble beginnings and digs out hilarious stories about his childhood in this very personal set.\n"}, {"title": "After Life", "country": "United Kingdom", "release_year": 2020, "listed_in": "British TV Shows, International TV Shows, TV Comedies", "description": "Struggling to come to terms with his wife's death, a writer for a newspaper adopts a gruff new persona in an effort to push away those trying to help.\n"}, {"title": "After We Collided", "country": "United States", "release_year": 2020, "listed_in": "Dramas, Romantic Movies", "description": "Tessa fell hard and fast for Hardin, but after a betrayal tears them apart, she must decide whether to move on — or trust him with a second chance.\n"}, {"title": "Aggretsuko", "country": "Japan", "release_year": 2020, "listed_in": "Anime Series, International TV Shows", "description": "Frustrated with her thankless office job, Retsuko the Red Panda copes with her daily struggles by belting out death metal karaoke after work.\n"}, {"title": "Ainu Mosir", "country": "United States, Japan", "release_year": 2020, "listed_in": "Dramas, International Movies", "description": "A sensitive Ainu teen searches for a spiritual connection with his recently deceased dad while navigating his indigenous identity in a changing world.\n"}, {"title": "Airplane Mode", "country": "United States", "release_year": 2020, "listed_in": "Comedies, International Movies, Romantic Movies", "description": "When Ana, an influencer, crashes her car while talking on the phone, she’s shipped to her grumpy grandfather's farm – and forced into a digital detox.\n"}, {"title": "AJ and the Queen", "country": "United States", "release_year": 2020, "listed_in": "TV Comedies, TV Dramas", "description": "While traveling across the country in a run-down RV, drag queen Ruby Red discovers an unlikely sidekick in AJ: a tough-talking 10-year-old stowaway.\n"}, {"title": "AK vs AK", "country": "India", "release_year": 2020, "listed_in": "Comedies, Dramas, International Movies", "description": "After a public spat with a movie star, a disgraced director retaliates by kidnapping the actor’s daughter, filming the search for her in real time.\n"}, {"title": "Ala Vaikunthapurramuloo", "country": "India", "release_year": 2020, "listed_in": "Action & Adventure, Comedies, Dramas", "description": "After growing up enduring criticism from his father, a young man finds his world shaken upon learning he was switched at birth with a millionaire’s son.\n"}, {"title": "Alex Fernández: The Best Comedian in the World", "country": "Mexico", "release_year": 2020, "listed_in": "Stand-Up Comedy", "description": "Comic Alex Fernández performs his familiar autobiographical stories but goes a little deeper this time with a tender tale about one of his six siblings.\n"}, {"title": "Alexa & Katie", "country": "United States", "release_year": 2020, "listed_in": "Kids' TV, TV Comedies", "description": "Alexa is battling cancer. But with her best friend, Katie, by her side, she's also starting high school – and ready for whatever comes next.\n"}, {"title": "Alice in Borderland", "country": "Japan", "release_year": 2020, "listed_in": "International TV Shows, TV Action & Adventure, TV Mysteries", "description": "An aimless gamer and his two friends find themselves in a parallel Tokyo, where they're forced to compete in a series of sadistic games to survive.\n"}, {"title": "Alien Worlds", "country": "United Kingdom", "release_year": 2020, "listed_in": "British TV Shows, Docuseries, International TV Shows", "description": "Applying the laws of life on Earth to the rest of the galaxy, this series blends science fact and fiction to imagine alien life on other planets.\n"}, {"title": "Alien Xmas", "country": "United States", "release_year": 2020, "listed_in": "Children & Family Movies", "description": "A young elf mistakes a tiny alien for a Christmas gift, not knowing her new plaything has plans to destroy Earth's gravity — and steal all the presents.\n"}, {"title": "All Because of You", "country": "Malaysia", "release_year": 2020, "listed_in": "Action & Adventure, Comedies, International Movies", "description": "After falling for a guest, an unsuspecting hotel staff becomes embroiled in a hostage scheme and discovers true love in an unlikely place.\n"}, {"title": "All Day and a Night", "country": "United States", "release_year": 2020, "listed_in": "Dramas, Independent Movies", "description": "While serving life in prison, a young man looks back at the people, the circumstances and the system that set him on the path toward his crime.\n"}, {"title": "All For Love", "country": "Colombia", "release_year": 2020, "listed_in": "International TV Shows, Romantic TV Shows, Spanish-Language TV Shows", "description": "A penniless country boy goes in search of his runaway sister in Bogotá, where he falls for an aspiring singer, but gets tangled up in organized crime.\n"}, {"title": "All The Bright Places", "country": "United States", "release_year": 2020, "listed_in": "Dramas, Romantic Movies", "description": "Two teens facing personal struggles form a powerful bond as they embark on a cathartic journey chronicling the wonders of Indiana.\n"}, {"title": "All the Freckles in the World", "country": "Mexico", "release_year": 2020, "listed_in": "Comedies, International Movies, Romantic Movies", "description": "Thirteen-year-old José Miguel is immune to 1994 World Cup fever until he realizes soccer is the only way to win the heart of his crush.\n"}, {"title": "All Together Now", "country": "United States", "release_year": 2020, "listed_in": "Dramas", "description": "An optimistic, talented teen clings to a huge secret: She's homeless and living on a bus. When tragedy strikes, can she learn to accept a helping hand?\n"}, {"title": "Almost Happy", "country": "Argentina", "release_year": 2020, "listed_in": "International TV Shows, Spanish-Language TV Shows, TV Comedies", "description": "Sebastián is a radio show host of modest fame, trying to find a way in the world as he deals with his ex-wife (whom he still loves) and two kids.\n"}, {"title": "Almost Love", "country": "United States", "release_year": 2020, "listed_in": "Comedies, Dramas, Independent Movies", "description": "A close crew of striving New Yorkers experiences both joy and heartache in their romantic and professional lives.\n"}, {"title": "Altered Carbon", "country": "United States", "release_year": 2020, "listed_in": "Crime TV Shows, TV Action & Adventure, TV Dramas", "description": "After 250 years on ice, a prisoner returns to life in a new body with one chance to win his freedom: by solving a mind-bending murder.\n"}, {"title": "Altered Carbon: Resleeved", "country": "Japan, United States", "release_year": 2020, "listed_in": "Action & Adventure, Anime Features, International Movies", "description": "On the planet Latimer, Takeshi Kovacs must protect a tattooist while investigating the death of a yakuza boss alongside a no-nonsense CTAC.\n"}, {"title": "American Murder: The Family Next Door", "country": "United States", "release_year": 2020, "listed_in": "Documentaries", "description": "Using raw, firsthand footage, this documentary examines the disappearance of Shanann Watts and her children, and the terrible events that followed.\n"}, {"title": "American Pie 9: Girls' Rules", "country": "United States", "release_year": 2020, "listed_in": "Comedies", "description": "Four tight-knit high school seniors vow to turn their love lives around by homecoming when the arrival of a new student muddles their plans.\n"}, {"title": "An Unremarkable Christmas", "country": "Colombia", "release_year": 2020, "listed_in": "Comedies, Dramas, International Movies", "description": "An accountant and aspiring magician invites his boss to spend Christmas with his family — unaware that he's one of Colombia's most-wanted criminals.\n"}, {"title": "Andhakaaram", "country": "India", "release_year": 2020, "listed_in": "Horror Movies, International Movies, Thrillers", "description": "As a blind librarian, dispirited cricketer and desolate psychiatrist each seek retribution and release, their lives overlap under eerie influences.\n"}, {"title": "André & his olive tree", "country": "Singapore", "release_year": 2020, "listed_in": "Documentaries, International Movies", "description": "As he prepares to close his restaurant, Michelin-starred Chef André Chiang embarks on a personal and emotional journey of reflection.\n"}, {"title": "Anelka: Misunderstood", "country": "France", "release_year": 2020, "listed_in": "Documentaries, International Movies, Sports Movies", "description": "Inscrutable, incomparable or both? Famed French footballer Nicolas Anelka’s controversial legacy is explored in this in-depth documentary.\n"}, {"title": "Angela's Christmas Wish", "country": "United States", "release_year": 2020, "listed_in": "Children & Family Movies", "description": "With her father working far away in Australia, a determined Angela makes a plan — and a heartfelt wish — to reunite her family in time for the holidays.\n"}, {"title": "Animal Crackers", "country": "China, Spain, South Korea, United States", "release_year": 2020, "listed_in": "Children & Family Movies, Comedies", "description": "Enchanted animal crackers turn Owen into whatever shape he eats! But to save the family circus, he'll have to keep them out of his evil uncle's hands.\n"}, {"title": "Anitta: Made In Honório", "country": "Brazil", "release_year": 2020, "listed_in": "Docuseries, International TV Shows", "description": "In this intimate documentary, Brazilian pop queen Anitta opens up about fame, family and her fierce work ethic, revealing the woman behind the hits.\n"}, {"title": "Ares", "country": "Netherlands", "release_year": 2020, "listed_in": "International TV Shows, TV Dramas, TV Horror", "description": "Aiming to become part of Amsterdam's elite, an ambitious college student joins an exclusive society, unaware it's hiding a horrifying secret.\n"}, {"title": "Ari Eldjárn: Pardon My Icelandic", "country": "Iceland", "release_year": 2020, "listed_in": "Stand-Up Comedy", "description": "In this English-language special, Icelandic comedian Ari Eldjárn pokes fun at Nordic rivalries, Hollywood's take on Thor, the whims of toddlers and more.\n"}, {"title": "Ariana grande: excuse me, i love you\"", "country": "United States", "release_year": 2020, "listed_in": "Documentaries, Music & Musicals", "description": "Ariana Grande takes the stage in London for her Sweetener World Tour and shares a behind-the-scenes look at her life in rehearsal and on the road.\n"}, {"title": "Asphalt Burning", "country": "Norway", "release_year": 2020, "listed_in": "Action & Adventure, Comedies, International Movies", "description": "When the brakes slam on his wedding, Roy accepts a challenge from a new foe to race for his runaway bride at the iconic Nürburgring track in Germany.\n"}, {"title": "Asura Guru", "country": "India", "release_year": 2020, "listed_in": "Dramas, International Movies", "description": "For a tech-savvy thief, elaborate robberies and evading the police are second nature until a private detective is hired to investigate his latest heist.\n"}, {"title": "Athlete A", "country": "United States", "release_year": 2020, "listed_in": "Documentaries, Sports Movies", "description": "This documentary focuses on the gymnasts who survived USA Gymnastics doctor Larry Nassar's abuse and the reporters who exposed USAG's toxic culture.\n"}, {"title": "Aunty Donna's Big Ol' House of Fun", "country": "Australia", "release_year": 2020, "listed_in": "TV Comedies", "description": "Comedy trio Aunty Donna showcase their uniquely absurd and offbeat style through an array of sketches, songs and eclectic characters.\n"}, {"title": "Ava", "country": "United States", "release_year": 2020, "listed_in": "Action & Adventure, Dramas", "description": "An elite assassin wrestling with doubts about her work scrambles to protect herself — and her estranged family — after a hit goes dangerously wrong.\n"}, {"title": "Away", "country": "United States", "release_year": 2020, "listed_in": "Romantic TV Shows, TV Dramas, TV Sci-Fi & Fantasy", "description": "Commander Emma Green leaves behind her husband and daughter to lead an international crew of astronauts on a perilous three-year mission to Mars.\n"}, {"title": "Axone", "country": "India", "release_year": 2020, "listed_in": "Comedies, Dramas, Independent Movies", "description": "In Delhi, friends from Northeast India prepare a pungent delicacy for a wedding party, sparking conflict and comedy with their unaccustomed neighbors.\n"}, {"title": "Babies", "country": "United States", "release_year": 2020, "listed_in": "Docuseries, Science & Nature TV", "description": "From nature to nurture, this docuseries explores the groundbreaking science that reveals how infants discover life during their very first year.\n"}, {"title": "Baby", "country": "Italy", "release_year": 2020, "listed_in": "International TV Shows, TV Dramas, Teen TV Shows", "description": "Fed up with their families and classmates, two teen girls from a wealthy part of Rome are drawn to the city's underworld and start leading double lives.\n"}, {"title": "Babylon Berlin", "country": "Germany", "release_year": 2020, "listed_in": "Crime TV Shows, International TV Shows, TV Dramas", "description": "A Soviet freight train's hijacking leads a haunted cop and a poor typist to uncover a political conspiracy amid the vice and glamour of 1929 Berlin.\n"}, {"title": "Bad Boy Billionaires: India", "country": "India", "release_year": 2020, "listed_in": "British TV Shows, Docuseries, International TV Shows", "description": "This investigative docuseries explores the greed, fraud and corruption that built up — and ultimately brought down — India’s most infamous tycoons.\n"}, {"title": "BAKI", "country": "Japan", "release_year": 2020, "listed_in": "Anime Series, International TV Shows", "description": "While martial arts champion Baki Hanma trains hard to surpass his legendary father, five violent death row inmates descend upon Tokyo to take him on.\n"}, {"title": "Banana Split", "country": "United States", "release_year": 2020, "listed_in": "Comedies, Dramas, Independent Movies", "description": "Despite leaving for college, a heartsick teen tries to build a new friendship with a kindred spirit even though she's dating her ex-boyfriend.\n"}, {"title": "Barbarians", "country": "Germany", "release_year": 2020, "listed_in": "International TV Shows, TV Action & Adventure, TV Dramas", "description": "Torn between the mighty empire that raised him and his own tribal people, a Roman officer's conflicted allegiances lead to an epic historical clash.\n"}, {"title": "Barbie Princess Adventure", "country": "United States", "release_year": 2020, "listed_in": "Children & Family Movies, Music & Musicals", "description": "Through music and magic, Barbie learns what it's like to be a modern princess when she trades places with a royal lookalike.\n"}, {"title": "Becoming", "country": "United States", "release_year": 2020, "listed_in": "Documentaries", "description": "\n"}, {"title": "Ben Platt Live from Radio City Music Hall", "country": "United States", "release_year": 2020, "listed_in": "Music & Musicals", "description": "Sing to Me Instead.”\n"}, {"title": "Berlin, Berlin: Lolle on the Run\"", "country": "Germany", "release_year": 2020, "listed_in": "Comedies, International Movies", "description": "In this cinematic sequel to the hit TV series, Lolle has moved on from Sven and is about to marry her friend Hart – until Sven disrupts her plans.\n"}, {"title": "Bert Kreischer: Hey Big Boy", "country": "United States", "release_year": 2020, "listed_in": "Stand-Up Comedy", "description": "Ever the stand-up party animal, comic Bert Kreischer riffs on parenting and family life, being a gun and pet owner, his dad discovering pot, and more.\n"}, {"title": "Best Leftovers Ever!", "country": "United States", "release_year": 2020, "listed_in": "Reality TV", "description": "Decadent pasta from day-old fries? Skillful cooks transform tired leftovers into tantalizing new dishes in this wildly creative culinary competition.\n"}, {"title": "Best Wishes, Warmest Regards: A Schitt's Creek Farewell\"", "country": "Canada", "release_year": 2020, "listed_in": "Documentaries, LGBTQ Movies", "description": "\n"}]